MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2C48J0AGB1000A/mcu.h
/*******************************************************************************
* Copyright (C) 2014 Spansion LLC. All Rights Reserved. 
*
* This software is owned and published by: 
* Spansion LLC, 915 DeGuigne Dr. Sunnyvale, CA  94088-3453 ("Spansion").
*
* BY DOWNLOADING, INSTALLING OR USING THIS SOFTWARE, YOU AGREE TO BE BOUND 
* BY ALL THE TERMS AND CONDITIONS OF THIS AGREEMENT.
*
* This software contains source code for use with Spansion 
* components. This software is licensed by Spansion to be adapted only 
* for use in systems utilizing Spansion components. Spansion shall not be 
* responsible for misuse or illegal use of this software for devices not 
* supported herein.  Spansion is providing this software "AS IS" and will 
* not be responsible for issues arising from incorrect user implementation 
* of the software.  
*
* SPANSION MAKES NO WARRANTY, EXPRESS OR IMPLIED, ARISING BY LAW OR OTHERWISE,
* REGARDING THE SOFTWARE (INCLUDING ANY ACOOMPANYING WRITTEN MATERIALS), 
* ITS PERFORMANCE OR SUITABILITY FOR YOUR INTENDED USE, INCLUDING, 
* WITHOUT LIMITATION, THE IMPLIED WARRANTY OF MERCHANTABILITY, THE IMPLIED 
* WARRANTY OF FITNESS FOR A PARTICULAR PURPOSE OR USE, AND THE IMPLIED 
* WARRANTY OF NONINFRINGEMENT.  
* SPANSION SHALL HAVE NO LIABILITY (WHETHER IN CONTRACT, WARRANTY, TORT, 
* NEGLIGENCE OR OTHERWISE) FOR ANY DAMAGES WHATSOEVER (INCLUDING, WITHOUT 
* LIMITATION, DAMAGES FOR LOSS OF BUSINESS PROFITS, BUSINESS INTERRUPTION, 
* LOSS OF BUSINESS INFORMATION, OR OTHER PECUNIARY LOSS) ARISING FROM USE OR 
* INABILITY TO USE THE SOFTWARE, INCLUDING, WITHOUT LIMITATION, ANY DIRECT, 
* INDIRECT, INCIDENTAL, SPECIAL OR CONSEQUENTIAL DAMAGES OR LOSS OF DATA, 
* SAVINGS OR PROFITS, 
* EVEN IF SPANSION HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES. 
* YOU ASSUME ALL RESPONSIBILITIES FOR SELECTION OF THE SOFTWARE TO ACHIEVE YOUR
* INTENDED RESULTS, AND FOR THE INSTALLATION OF, USE OF, AND RESULTS OBTAINED 
* FROM, THE SOFTWARE.  
*
* This software may be replicated in part or whole for the licensed use, 
* with the restriction that this Disclaimer and Copyright notice must be 
* included with each copy of this software, whether used in part or whole, 
* at all times.  
*/
/******************************************************************************/
/** \file s6e2c4.h
 **
 ** Unfified Header File for FM4 PDL
 **
 ** History:
 **  - 2014-08-01  0.0.1  EH   Preliminary version
 **  - 2014-08-22  0.0.2  EH   Added CKRT bit of CNTREG register in I2S
 **                            Renamed RFTH bit of INTCNT register in I2S
 **                            Renamed HSSPI IRQ name
 **                            Renamed prefix of HSSPI definition
 **                            Renamed GPIO bit name
 **  - 2014-09-25  1.0.0  EH   Added FM4_DEVICE_TYPE definition
 **                            Added DMS bit of RXF1S register in CAN-FD
 **                            Revised DASZ bit of DFASZR register in Dual Flash
 **                            Revised DRWT bit of DFRWTR register in Dual Flash
 **                            Revised ICEN bit of ICCR register in I2S Clock Generation
 **                            Revised SCS70E & SCS60E bits of EPFR23 register in GPIO
 **                            Deleted TESTB bit of SWC_PSR register in Clock
 **  - 2014-10-22  1.1.0  EH   Added TCSD register in MFT
 **                            Added ACSC register in MFT
 **                            Modified OCSD register in MFT
 **                            Modified NZCL register in MFT
 **                            Modified ACSC register in MFT
 **                            Modified ESCR register in CSIO of MFS
 **                            Modified SCSCR register in CSIO of MFS
 **                            Modified SCSFR register in CSIO of MFS
 **  - 2014-10-23  1.2.0  EH   Added QPRCRR register in QPRC
 **
 ******************************************************************************/

#ifndef _S6E2C4_H_
#define _S6E2C4_H_

#ifdef __cplusplus
extern "C" {
#endif

#define FM4_DEVICE_TYPE 3

/******************************************************************************
 * Configuration of the Cortex-M3 Processor and Core Peripherals
 ******************************************************************************/
#define __MPU_PRESENT           1 /* FM4 provide an MPU                           */
#define __NVIC_PRIO_BITS        4 /* FM4 uses 4 Bits for the Priority Levels      */
#define __Vendor_SysTickConfig  0 /* Set to 1 if different SysTick Config is used */
#define __FPU_PRESENT           1 /* FPU present                                  */

// #include "mcu.h"  // Note: Changed for MikroE implementation.

/**
 ******************************************************************************
 ** \brief Interrupt number definition for all type MCUs
 ******************************************************************************/
#if (PDL_MCU_INT_TYPE == PDL_INT_TYPE_A)
typedef enum IRQn
{
    NMI_IRQn          = -14, /*  2 Non Maskable      */
    HardFault_IRQn    = -13, /*  3 Hard Fault        */
    MemManage_IRQn    = -12, /*  4 Memory Management */
    BusFault_IRQn     = -11, /*  5 Bus Fault         */
    UsageFault_IRQn   = -10, /*  6 Usage Fault       */
    SVC_IRQn          = -5,  /* 11 SV Call           */
    DebugMonitor_IRQn = -4,  /* 12 Debug Monitor     */
    PendSV_IRQn       = -2,  /* 14 Pend SV           */
    SysTick_IRQn      = -1,  /* 15 System Tick       */

    CSV_IRQn              =   0,  /* Clock Supervisor                             */
    SWDT_IRQn             =   1,  /* Software Watchdog Timer                      */
    LVD_IRQn              =   2,  /* Low Voltage Detection                        */
    IRQ003SEL_IRQn        =   3,  /* Interrupt Selection IRQ003SEL                */
    IRQ004SEL_IRQn        =   4,  /* Interrupt Selection IRQ004SEL                */
    IRQ005SEL_IRQn        =   5,  /* Interrupt Selection IRQ005SEL                */
    IRQ006SEL_IRQn        =   6,  /* Interrupt Selection IRQ006SEL                */
    IRQ007SEL_IRQn        =   7,  /* Interrupt Selection IRQ007SEL                */
    IRQ008SEL_IRQn        =   8,  /* Interrupt Selection IRQ008SEL                */
    IRQ009SEL_IRQn        =   9,  /* Interrupt Selection IRQ009SEL                */
    IRQ010SEL_IRQn        =  10,  /* Interrupt Selection IRQ010SEL                */
    EXINT0_IRQn           =  11,  /* External Interrupt Ch. 0                     */
    EXINT1_IRQn           =  12,  /* External Interrupt Ch. 1                     */
    EXINT2_IRQn           =  13,  /* External Interrupt Ch. 2                     */
    EXINT3_IRQn           =  14,  /* External Interrupt Ch. 3                     */
    EXINT4_IRQn           =  15,  /* External Interrupt Ch. 4                     */
    EXINT5_IRQn           =  16,  /* External Interrupt Ch. 5                     */
    EXINT6_IRQn           =  17,  /* External Interrupt Ch. 6                     */
    EXINT7_IRQn           =  18,  /* External Interrupt Ch. 7                     */
    QPRC0_IRQn            =  19,  /* Quad Decoder and Revolution Counter Ch. 0    */
    QPRC1_IRQn            =  20,  /* Quad Decoder and Revolution Counter Ch. 1    */
    WFG0_DTIF0_IRQn       =  21,  /* MFT0 Wave Form Generator / DTIF              */
    WFG1_DTIF1_IRQn       =  22,  /* MFT1 Wave Form Generator / DTIF              */
    WFG2_DTIF2_IRQn       =  23,  /* MFT2 Wave Form Generator / DTIF              */
    FRT0_PEAK_IRQn        =  24,  /* MFT0 Free Running Timer Peak Detection       */
    FRT0_ZERO_IRQn        =  25,  /* MFT0 Free Running Timer Zero Detection       */
    ICU0_IRQn             =  26,  /* MFT0 Input Capture Unit                      */
    OCU0_IRQn             =  27,  /* MFT0 Output Compare Unit                     */
    FRT1_PEAK_IRQn        =  28,  /* MFT1 Free Running Timer Peak Detection       */
    FRT1_ZERO_IRQn        =  29,  /* MFT1 Free Running Timer Zero Detection       */
    ICU1_IRQn             =  30,  /* MFT1 Input Capture Unit                      */
    OCU1_IRQn             =  31,  /* MFT1 Output Compare Unit                     */
    FRT2_PEAK_IRQn        =  32,  /* MFT2 Free Running Timer Peak Detection       */
    FRT2_ZERO_IRQn        =  33,  /* MFT2 Free Running Timer Zero Detection       */
    ICU2_IRQn             =  34,  /* MFT2 Input Capture Unit                      */
    OCU2_IRQn             =  35,  /* MFT2 Output Compare Unit                     */
    PPG00_02_04_IRQn      =  36,  /* Programmable Pulse Generator Ch. 0, 2, 4     */
    PPG08_10_12_IRQn      =  37,  /* Programmable Pulse Generator Ch. 8, 10, 12   */
    PPG16_18_20_IRQn      =  38,  /* Programmable Pulse Generator Ch. 16, 18, 20  */
    BT0_IRQn              =  39,  /* Base Timer Ch. 0                             */
    BT1_IRQn              =  40,  /* Base Timer Ch. 1                             */
    BT2_IRQn              =  41,  /* Base Timer Ch. 2                             */
    BT3_IRQn              =  42,  /* Base Timer Ch. 3                             */
    BT4_IRQn              =  43,  /* Base Timer Ch. 4                             */
    BT5_IRQn              =  44,  /* Base Timer Ch. 5                             */
    BT6_IRQn              =  45,  /* Base Timer Ch. 6                             */
    BT7_IRQn              =  46,  /* Base Timer Ch. 7                             */
    DT1_2_IRQn            =  47,  /* Dual Timmer Ch. 1, 2                         */
    WC_IRQn               =  48,  /* Watch Counter                                */
    EXTBUS_ERR_IRQn       =  49,  /* External Bus Error                           */
    RTC_IRQn              =  50,  /* Realtime Clock                               */
    EXINT8_IRQn           =  51,  /* External Interrupt Ch. 8                     */
    EXINT9_IRQn           =  52,  /* External Interrupt Ch. 9                     */
    EXINT10_IRQn          =  53,  /* External Interrupt Ch. 10                    */
    EXINT11_IRQn          =  54,  /* External Interrupt Ch. 11                    */
    EXINT12_IRQn          =  55,  /* External Interrupt Ch. 12                    */
    EXINT13_IRQn          =  56,  /* External Interrupt Ch. 13                    */
    EXINT14_IRQn          =  57,  /* External Interrupt Ch. 14                    */
    EXINT15_IRQn          =  58,  /* External Interrupt Ch. 15                    */
    TIM_IRQn              =  59,  /* Clock/PLL/USB&Ethernet-PLL/I2S-PLL Timer     */
    MFS0_RX_IRQn          =  60,  /* Multifunction Serial I/F Reception Ch. 0     */
    MFS0_TX_IRQn          =  61,  /* Multifunction Serial I/F Transmission Ch. 0  */
    MFS1_RX_IRQn          =  62,  /* Multifunction Serial I/F Reception Ch. 1     */
    MFS1_TX_IRQn          =  63,  /* Multifunction Serial I/F Transmission Ch. 1  */
    MFS2_RX_IRQn          =  64,  /* Multifunction Serial I/F Reception Ch. 2     */
    MFS2_TX_IRQn          =  65,  /* Multifunction Serial I/F Transmission Ch. 2  */
    MFS3_RX_IRQn          =  66,  /* Multifunction Serial I/F Reception Ch. 3     */
    MFS3_TX_IRQn          =  67,  /* Multifunction Serial I/F Transmission Ch. 3  */
    MFS4_RX_IRQn          =  68,  /* Multifunction Serial I/F Reception Ch. 4     */
    MFS4_TX_IRQn          =  69,  /* Multifunction Serial I/F Transmission Ch. 4  */
    MFS5_RX_IRQn          =  70,  /* Multifunction Serial I/F Reception Ch. 5     */
    MFS5_TX_IRQn          =  71,  /* Multifunction Serial I/F Transmission Ch. 5  */
    MFS6_RX_IRQn          =  72,  /* Multifunction Serial I/F Reception Ch. 6     */
    MFS6_TX_IRQn          =  73,  /* Multifunction Serial I/F Transmission Ch. 6  */
    MFS7_RX_IRQn          =  74,  /* Multifunction Serial I/F Reception Ch. 7     */
    MFS7_TX_IRQn          =  75,  /* Multifunction Serial I/F Transmission Ch. 7  */
    ADC0_IRQn             =  76,  /* Analog Digital Converter Unit 0              */
    ADC1_IRQn             =  77,  /* Analog Digital Converter Unit 1              */
    USB0_IRQn             =  78,  /* USB0 Function                                */
    USB0_HOST_IRQn        =  79,  /* USB0 Function and Host                       */
    CAN0_IRQn             =  80,  /* CAN I/F Ch. 0                                */
    CAN1_CANFD_IRQn       =  81,  /* CAN I/F Ch. 1 & CAN-FD I/F                   */
    ETHER0_IRQn           =  82,  /* Ethernet                                     */
    DMAC0_IRQn            =  83,  /* Direct Memory Access Controller Ch. 0        */
    DMAC1_IRQn            =  84,  /* Direct Memory Access Controller Ch. 1        */
    DMAC2_IRQn            =  85,  /* Direct Memory Access Controller Ch. 2        */
    DMAC3_IRQn            =  86,  /* Direct Memory Access Controller Ch. 3        */
    DMAC4_IRQn            =  87,  /* Direct Memory Access Controller Ch. 4        */
    DMAC5_IRQn            =  88,  /* Direct Memory Access Controller Ch. 5        */
    DMAC6_IRQn            =  89,  /* Direct Memory Access Controller Ch. 6        */
    DMAC7_IRQn            =  90,  /* Direct Memory Access Controller Ch. 7        */
    DSTC_IRQn             =  91,  /* DSTC SW Transfer                             */
    EXINT16_17_18_19_IRQn =  92,  /* External Interrupt Ch. 16 - 19               */
    EXINT20_21_22_23_IRQn =  93,  /* External Interrupt Ch. 20 - 23               */
    EXINT24_25_26_27_IRQn =  94,  /* External Interrupt Ch. 24 - 27               */
    EXINT28_29_30_31_IRQn =  95,  /* External Interrupt Ch. 28 - 31               */
    QPRC2_IRQn            =  96,  /* Quad Decoder and Revolution Counter Ch. 2    */
    QPRC3_IRQn            =  97,  /* Quad Decoder and Revolution Counter Ch. 3    */
    BT8_IRQn              =  98,  /* Base Timer Ch. 8                             */
    BT9_IRQn              =  99,  /* Base Timer Ch. 9                             */
    BT10_IRQn             = 100,  /* Base Timer Ch. 10                            */
    BT11_IRQn             = 101,  /* Base Timer Ch. 11                            */
    BT12_IRQn             = 102,  /* Base Timer Ch. 12                            */
    MFS8_RX_IRQn          = 103,  /* Multifunction Serial I/F Reception Ch. 8     */
    MFS8_TX_IRQn          = 104,  /* Multifunction Serial I/F Transmission Ch. 8  */
    MFS9_RX_IRQn          = 105,  /* Multifunction Serial I/F Reception Ch. 9     */
    MFS9_TX_IRQn          = 106,  /* Multifunction Serial I/F Transmission Ch. 9  */
    MFS10_RX_IRQn         = 107,  /* Multifunction Serial I/F Reception Ch. 10    */
    MFS10_TX_IRQn         = 108,  /* Multifunction Serial I/F Transmission Ch. 10 */
    MFS11_RX_IRQn         = 109,  /* Multifunction Serial I/F Reception Ch. 11    */
    MFS11_TX_IRQn         = 110,  /* Multifunction Serial I/F Transmission Ch. 11 */
    ADC2_IRQn             = 111,  /* Analog Digital Converter Unit 2              */
    USB1_HDMICEC0_IRQn    = 113,  /* USB1 Function & HDMI-CEC ch.0                */
    USB1_HOST_HDMICEC1_IRQn = 114,  /* USB1 Function and Host & HDMI-CEC ch.1     */
    HSSPI_IRQn            = 115,  /* High-Speed Quad SPI                          */
    PRGCRC_I2S_IRQn       = 117,  /* Programmable CRC & I2S I/F                   */
    SD_IRQn               = 118,  /* SD Card I/F                                  */
    FLASH_IRQn            = 119,  /* Flash                                        */
    MFS12_RX_IRQn         = 120,  /* Multifunction Serial I/F Reception Ch. 12    */
    MFS12_TX_IRQn         = 121,  /* Multifunction Serial I/F Transmission Ch. 12 */
    MFS13_RX_IRQn         = 122,  /* Multifunction Serial I/F Reception Ch. 13    */
    MFS13_TX_IRQn         = 123,  /* Multifunction Serial I/F Transmission Ch. 13 */
    MFS14_RX_IRQn         = 124,  /* Multifunction Serial I/F Reception Ch. 14    */
    MFS14_TX_IRQn         = 125,  /* Multifunction Serial I/F Transmission Ch. 14 */
    MFS15_RX_IRQn         = 126,  /* Multifunction Serial I/F Reception Ch. 15    */
    MFS15_TX_IRQn         = 127   /* Multifunction Serial I/F Transmission Ch. 15 */
} IRQn_Type;

