MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2C48J0AGB1000A/mcu.h
/******************************************************************************
 * IRQSEL_MODULE
******************************************************************************/
typedef struct
{
  union {
    __IO uint32_t      IRQ03SEL;
    stc_irqsel_field_t IRQ03SEL_f;
  };
  union {
    __IO uint32_t      IRQ04SEL;
    stc_irqsel_field_t IRQ04SEL_f;
  };
  union {
    __IO uint32_t      IRQ05SEL;
    stc_irqsel_field_t IRQ05SEL_f;
  };
  union {
    __IO uint32_t      IRQ06SEL;
    stc_irqsel_field_t IRQ06SEL_f;
  };
  union {
    __IO uint32_t      IRQ07SEL;
    stc_irqsel_field_t IRQ07SEL_f;
  };
  union {
    __IO uint32_t      IRQ08SEL;
    stc_irqsel_field_t IRQ08SEL_f;
  };
  union {
    __IO uint32_t      IRQ09SEL;
    stc_irqsel_field_t IRQ09SEL_f;
  };
  union {
    __IO uint32_t      IRQ10SEL;
    stc_irqsel_field_t IRQ10SEL_f;
  };
} FM4_IRQSEL_TypeDef;

/******************************************************************************
 * HDMI-CEC_MODULE
 ******************************************************************************/
/* HDMI-CEC MODULE registers */
typedef struct
{
  union {
    __IO  uint8_t TXCTRL;
    stc_hdmicec_txctrl_field_t TXCTRL_f;
  };
        uint8_t RESERVED1[3];
  union {
    __IO  uint8_t TXDATA;
    stc_hdmicec_txdata_field_t TXDATA_f;
  };
        uint8_t RESERVED2[3];
  union {
    __IO  uint8_t TXSTS;
    stc_hdmicec_txsts_field_t TXSTS_f;
  };
        uint8_t RESERVED3[3];
  union {
    __IO  uint8_t SFREE;
    stc_hdmicec_sfree_field_t SFREE_f;
  };
        uint8_t RESERVED4[51];
  union {
    __IO  uint8_t RCST;
    stc_hdmicec_rcst_field_t RCST_f;
  };
  union {
    __IO  uint8_t RCCR;
    stc_hdmicec_rccr_field_t RCCR_f;
  };
        uint8_t RESERVED5[2];
    __IO  uint8_t RCDAHW;
    __IO  uint8_t RCSHW;
        uint8_t RESERVED6[3];
    __IO  uint8_t RCDBHW;
        uint8_t RESERVED7[2];
    __IO  uint8_t RCADR2;
    __IO  uint8_t RCADR1;
        uint8_t RESERVED8[2];
    __IO  uint8_t RCDTHL;
    __IO  uint8_t RCDTHH;
        uint8_t RESERVED9[2];
    __IO  uint8_t RCDTLL;
    __IO  uint8_t RCDTLH;
        uint8_t RESERVED10[2];
  union {
    __IO uint16_t RCCKD;
    stc_hdmicec_rcckd_field_t RCCKD_f;
  };
        uint8_t RESERVED11[2];
    __IO  uint8_t RCRHW;
  union {
    __IO  uint8_t RCRC;
    stc_hdmicec_rcrc_field_t RCRC_f;
  };
        uint8_t RESERVED12[3];
  union {
    __IO  uint8_t RCLE;
    stc_hdmicec_rcle_field_t RCLE_f;
  };
        uint8_t RESERVED13[2];
    __IO  uint8_t RCLESW;
    __IO  uint8_t RCLELW;
}FM4_HDMICEC_TypeDef;

/******************************************************************************
 * GPIO_MODULE
 ******************************************************************************/
/* GPIO registers */
typedef struct
{
  union {
    __IO uint32_t PFR0;
    stc_gpio_pfr0_field_t PFR0_f;
  };
  union {
    __IO uint32_t PFR1;
    stc_gpio_pfr1_field_t PFR1_f;
  };
  union {
    __IO uint32_t PFR2;
    stc_gpio_pfr2_field_t PFR2_f;
  };
  union {
    __IO uint32_t PFR3;
    stc_gpio_pfr3_field_t PFR3_f;
  };
  union {
    __IO uint32_t PFR4;
    stc_gpio_pfr4_field_t PFR4_f;
  };
  union {
    __IO uint32_t PFR5;
    stc_gpio_pfr5_field_t PFR5_f;
  };
  union {
    __IO uint32_t PFR6;
    stc_gpio_pfr6_field_t PFR6_f;
  };
  union {
    __IO uint32_t PFR7;
    stc_gpio_pfr7_field_t PFR7_f;
  };
  union {
    __IO uint32_t PFR8;
    stc_gpio_pfr8_field_t PFR8_f;
  };
  union {
    __IO uint32_t PFR9;
    stc_gpio_pfr9_field_t PFR9_f;
  };
  union {
    __IO uint32_t PFRA;
    stc_gpio_pfra_field_t PFRA_f;
  };
  union {
    __IO uint32_t PFRB;
    stc_gpio_pfrb_field_t PFRB_f;
  };
  union {
    __IO uint32_t PFRC;
    stc_gpio_pfrc_field_t PFRC_f;
  };
  union {
    __IO uint32_t PFRD;
    stc_gpio_pfrd_field_t PFRD_f;
  };
  union {
    __IO uint32_t PFRE;
    stc_gpio_pfre_field_t PFRE_f;
  };
  union {
    __IO uint32_t PFRF;
    stc_gpio_pfrf_field_t PFRF_f;
  };
        uint8_t RESERVED1[192];
  union {
    __IO uint32_t PCR0;
    stc_gpio_pcr0_field_t PCR0_f;
  };
  union {
    __IO uint32_t PCR1;
    stc_gpio_pcr1_field_t PCR1_f;
  };
  union {
    __IO uint32_t PCR2;
    stc_gpio_pcr2_field_t PCR2_f;
  };
  union {
    __IO uint32_t PCR3;
    stc_gpio_pcr3_field_t PCR3_f;
  };
  union {
    __IO uint32_t PCR4;
    stc_gpio_pcr4_field_t PCR4_f;
  };
  union {
    __IO uint32_t PCR5;
    stc_gpio_pcr5_field_t PCR5_f;
  };
  union {
    __IO uint32_t PCR6;
    stc_gpio_pcr6_field_t PCR6_f;
  };
  union {
    __IO uint32_t PCR7;
    stc_gpio_pcr7_field_t PCR7_f;
  };
  union {
    __IO uint32_t PCR8;
    stc_gpio_pcr8_field_t PCR8_f;
  };
  union {
    __IO uint32_t PCR9;
    stc_gpio_pcr9_field_t PCR9_f;
  };
  union {
    __IO uint32_t PCRA;
    stc_gpio_pcra_field_t PCRA_f;
  };
  union {
    __IO uint32_t PCRB;
    stc_gpio_pcrb_field_t PCRB_f;
  };
  union {
    __IO uint32_t PCRC;
    stc_gpio_pcrc_field_t PCRC_f;
  };
  union {
    __IO uint32_t PCRD;
    stc_gpio_pcrd_field_t PCRD_f;
  };
  union {
    __IO uint32_t PCRE;
    stc_gpio_pcre_field_t PCRE_f;
  };
  union {
    __IO uint32_t PCRF;
    stc_gpio_pcrf_field_t PCRF_f;
  };
        uint8_t RESERVED2[192];
  union {
    __IO uint32_t DDR0;
    stc_gpio_ddr0_field_t DDR0_f;
  };
  union {
    __IO uint32_t DDR1;
    stc_gpio_ddr1_field_t DDR1_f;
  };
  union {
    __IO uint32_t DDR2;
    stc_gpio_ddr2_field_t DDR2_f;
  };
  union {
    __IO uint32_t DDR3;
    stc_gpio_ddr3_field_t DDR3_f;
  };
  union {
    __IO uint32_t DDR4;
    stc_gpio_ddr4_field_t DDR4_f;
  };
  union {
    __IO uint32_t DDR5;
    stc_gpio_ddr5_field_t DDR5_f;
  };
  union {
    __IO uint32_t DDR6;
    stc_gpio_ddr6_field_t DDR6_f;
  };
  union {
    __IO uint32_t DDR7;
    stc_gpio_ddr7_field_t DDR7_f;
  };
  union {
    __IO uint32_t DDR8;
    stc_gpio_ddr8_field_t DDR8_f;
  };
  union {
    __IO uint32_t DDR9;
    stc_gpio_ddr9_field_t DDR9_f;
  };
  union {
    __IO uint32_t DDRA;
    stc_gpio_ddra_field_t DDRA_f;
  };
  union {
    __IO uint32_t DDRB;
    stc_gpio_ddrb_field_t DDRB_f;
  };
  union {
    __IO uint32_t DDRC;
    stc_gpio_ddrc_field_t DDRC_f;
  };
  union {
    __IO uint32_t DDRD;
    stc_gpio_ddrd_field_t DDRD_f;
  };
  union {
    __IO uint32_t DDRE;
    stc_gpio_ddre_field_t DDRE_f;
  };
  union {
    __IO uint32_t DDRF;
    stc_gpio_ddrf_field_t DDRF_f;
  };
        uint8_t RESERVED3[192];
  union {
    __IO uint32_t PDIR0;
    stc_gpio_pdir0_field_t PDIR0_f;
  };
  union {
    __IO uint32_t PDIR1;
    stc_gpio_pdir1_field_t PDIR1_f;
  };
  union {
    __IO uint32_t PDIR2;
    stc_gpio_pdir2_field_t PDIR2_f;
  };
  union {
    __IO uint32_t PDIR3;
    stc_gpio_pdir3_field_t PDIR3_f;
  };
  union {
    __IO uint32_t PDIR4;
    stc_gpio_pdir4_field_t PDIR4_f;
  };
  union {
    __IO uint32_t PDIR5;
    stc_gpio_pdir5_field_t PDIR5_f;
  };
  union {
    __IO uint32_t PDIR6;
    stc_gpio_pdir6_field_t PDIR6_f;
  };
  union {
    __IO uint32_t PDIR7;
    stc_gpio_pdir7_field_t PDIR7_f;
  };
  union {
    __IO uint32_t PDIR8;
    stc_gpio_pdir8_field_t PDIR8_f;
  };
  union {
    __IO uint32_t PDIR9;
    stc_gpio_pdir9_field_t PDIR9_f;
  };
  union {
    __IO uint32_t PDIRA;
    stc_gpio_pdira_field_t PDIRA_f;
  };
  union {
    __IO uint32_t PDIRB;
    stc_gpio_pdirb_field_t PDIRB_f;
  };
  union {
    __IO uint32_t PDIRC;
    stc_gpio_pdirc_field_t PDIRC_f;
  };
  union {
    __IO uint32_t PDIRD;
    stc_gpio_pdird_field_t PDIRD_f;
  };
  union {
    __IO uint32_t PDIRE;
    stc_gpio_pdire_field_t PDIRE_f;
  };
  union {
    __IO uint32_t PDIRF;
    stc_gpio_pdirf_field_t PDIRF_f;
  };
        uint8_t RESERVED4[192];
  union {
    __IO uint32_t PDOR0;
    stc_gpio_pdor0_field_t PDOR0_f;
  };
  union {
    __IO uint32_t PDOR1;
    stc_gpio_pdor1_field_t PDOR1_f;
  };
  union {
    __IO uint32_t PDOR2;
    stc_gpio_pdor2_field_t PDOR2_f;
  };
  union {
    __IO uint32_t PDOR3;
    stc_gpio_pdor3_field_t PDOR3_f;
  };
  union {
    __IO uint32_t PDOR4;
    stc_gpio_pdor4_field_t PDOR4_f;
  };
  union {
    __IO uint32_t PDOR5;
    stc_gpio_pdor5_field_t PDOR5_f;
  };
  union {
    __IO uint32_t PDOR6;
    stc_gpio_pdor6_field_t PDOR6_f;
  };
  union {
    __IO uint32_t PDOR7;
    stc_gpio_pdor7_field_t PDOR7_f;
  };
  union {
    __IO uint32_t PDOR8;
    stc_gpio_pdor8_field_t PDOR8_f;
  };
  union {
    __IO uint32_t PDOR9;
    stc_gpio_pdor9_field_t PDOR9_f;
  };
  union {
    __IO uint32_t PDORA;
    stc_gpio_pdora_field_t PDORA_f;
  };
  union {
    __IO uint32_t PDORB;
    stc_gpio_pdorb_field_t PDORB_f;
  };
  union {
    __IO uint32_t PDORC;
    stc_gpio_pdorc_field_t PDORC_f;
  };
  union {
    __IO uint32_t PDORD;
    stc_gpio_pdord_field_t PDORD_f;
  };
  union {
    __IO uint32_t PDORE;
    stc_gpio_pdore_field_t PDORE_f;
  };
  union {
    __IO uint32_t PDORF;
    stc_gpio_pdorf_field_t PDORF_f;
  };
        uint8_t RESERVED5[192];
  union {
    __IO uint32_t ADE;
    stc_gpio_ade_field_t ADE_f;
  };
        uint8_t RESERVED6[124];
  union {
    __IO uint32_t SPSR;
    stc_gpio_spsr_field_t SPSR_f;
  };
        uint8_t RESERVED7[124];
  union {
    __IO uint32_t EPFR00;
    stc_gpio_epfr00_field_t EPFR00_f;
  };
  union {
    __IO uint32_t EPFR01;
    stc_gpio_epfr01_field_t EPFR01_f;
  };
  union {
    __IO uint32_t EPFR02;
    stc_gpio_epfr02_field_t EPFR02_f;
  };
  union {
    __IO uint32_t EPFR03;
    stc_gpio_epfr03_field_t EPFR03_f;
  };
  union {
    __IO uint32_t EPFR04;
    stc_gpio_epfr04_field_t EPFR04_f;
  };
  union {
    __IO uint32_t EPFR05;
    stc_gpio_epfr05_field_t EPFR05_f;
  };
  union {
    __IO uint32_t EPFR06;
    stc_gpio_epfr06_field_t EPFR06_f;
  };
  union {
    __IO uint32_t EPFR07;
    stc_gpio_epfr07_field_t EPFR07_f;
  };
  union {
    __IO uint32_t EPFR08;
    stc_gpio_epfr08_field_t EPFR08_f;
  };
  union {
    __IO uint32_t EPFR09;
    stc_gpio_epfr09_field_t EPFR09_f;
  };
  union {
    __IO uint32_t EPFR10;
    stc_gpio_epfr10_field_t EPFR10_f;
  };
  union {
    __IO uint32_t EPFR11;
    stc_gpio_epfr11_field_t EPFR11_f;
  };
  union {
    __IO uint32_t EPFR12;
    stc_gpio_epfr12_field_t EPFR12_f;
  };
  union {
    __IO uint32_t EPFR13;
    stc_gpio_epfr13_field_t EPFR13_f;
  };
  union {
    __IO uint32_t EPFR14;
    stc_gpio_epfr14_field_t EPFR14_f;
  };
  union {
    __IO uint32_t EPFR15;
    stc_gpio_epfr15_field_t EPFR15_f;
  };
  union {
    __IO uint32_t EPFR16;
    stc_gpio_epfr16_field_t EPFR16_f;
  };
  union {
    __IO uint32_t EPFR17;
    stc_gpio_epfr17_field_t EPFR17_f;
  };
  union {
    __IO uint32_t EPFR18;
    stc_gpio_epfr18_field_t EPFR18_f;
  };
  __IO uint32_t EPFR19;
  union {
    __IO uint32_t EPFR20;
    stc_gpio_epfr20_field_t EPFR20_f;
  };
  __IO uint32_t EPFR21;
  __IO uint32_t EPFR22;
  union {
    __IO uint32_t EPFR23;
    stc_gpio_epfr23_field_t EPFR23_f;
  };
  union {
    __IO uint32_t EPFR24;
    stc_gpio_epfr24_field_t EPFR24_f;
  };
  union {
    __IO uint32_t EPFR25;
    stc_gpio_epfr25_field_t EPFR25_f;
  };
  union {
    __IO uint32_t EPFR26;
    stc_gpio_epfr26_field_t EPFR26_f;
  };
        uint8_t RESERVED8[148];
  union {
    __IO uint32_t PZR0;
    stc_gpio_pzr0_field_t PZR0_f;
  };
  union {
    __IO uint32_t PZR1;
    stc_gpio_pzr1_field_t PZR1_f;
  };
  union {
    __IO uint32_t PZR2;
    stc_gpio_pzr2_field_t PZR2_f;
  };
  union {
    __IO uint32_t PZR3;
    stc_gpio_pzr3_field_t PZR3_f;
  };
  union {
    __IO uint32_t PZR4;
    stc_gpio_pzr4_field_t PZR4_f;
  };
  union {
    __IO uint32_t PZR5;
    stc_gpio_pzr5_field_t PZR5_f;
  };
  union {
    __IO uint32_t PZR6;
    stc_gpio_pzr6_field_t PZR6_f;
  };
  union {
    __IO uint32_t PZR7;
    stc_gpio_pzr7_field_t PZR7_f;
  };
  union {
    __IO uint32_t PZR8;
    stc_gpio_pzr8_field_t PZR8_f;
  };
  union {
    __IO uint32_t PZR9;
    stc_gpio_pzr9_field_t PZR9_f;
  };
  union {
    __IO uint32_t PZRA;
    stc_gpio_pzra_field_t PZRA_f;
  };
  union {
    __IO uint32_t PZRB;
    stc_gpio_pzrb_field_t PZRB_f;
  };
  union {
    __IO uint32_t PZRC;
    stc_gpio_pzrc_field_t PZRC_f;
  };
  union {
    __IO uint32_t PZRD;
    stc_gpio_pzrd_field_t PZRD_f;
  };
  union {
    __IO uint32_t PZRE;
    stc_gpio_pzre_field_t PZRE_f;
  };
  union {
    __IO uint32_t PZRF;
    stc_gpio_pzrf_field_t PZRF_f;
  };
  union {
    __IO uint32_t PDSR0;
    stc_gpio_pdsr0_field_t PDSR0_f;
  };
  union {
    __IO uint32_t PDSR1;
    stc_gpio_pdsr1_field_t PDSR1_f;
  };
  union {
    __IO uint32_t PDSR2;
    stc_gpio_pdsr2_field_t PDSR2_f;
  };
  union {
    __IO uint32_t PDSR3;
    stc_gpio_pdsr3_field_t PDSR3_f;
  };
  union {
    __IO uint32_t PDSR4;
    stc_gpio_pdsr4_field_t PDSR4_f;
  };
  union {
    __IO uint32_t PDSR5;
    stc_gpio_pdsr5_field_t PDSR5_f;
  };
  union {
    __IO uint32_t PDSR6;
    stc_gpio_pdsr6_field_t PDSR6_f;
  };
  union {
    __IO uint32_t PDSR7;
    stc_gpio_pdsr7_field_t PDSR7_f;
  };
  union {
    __IO uint32_t PDSR8;
    stc_gpio_pdsr8_field_t PDSR8_f;
  };
  union {
    __IO uint32_t PDSR9;
    stc_gpio_pdsr9_field_t PDSR9_f;
  };
  union {
    __IO uint32_t PDSRA;
    stc_gpio_pdsra_field_t PDSRA_f;
  };
  union {
    __IO uint32_t PDSRB;
    stc_gpio_pdsrb_field_t PDSRB_f;
  };
  union {
    __IO uint32_t PDSRC;
    stc_gpio_pdsrc_field_t PDSRC_f;
  };
  union {
    __IO uint32_t PDSRD;
    stc_gpio_pdsrd_field_t PDSRD_f;
  };
  union {
    __IO uint32_t PDSRE;
    stc_gpio_pdsre_field_t PDSRE_f;
  };
  union {
    __IO uint32_t PDSRF;
    stc_gpio_pdsrf_field_t PDSRF_f;
  };
}FM4_GPIO_TypeDef;

