MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2C48J0AGB1000A/mcu.h
/******************************************************************************
 * Peripheral declaration
 ******************************************************************************/
#define FM4_FLASH_IF    ((FM4_FLASH_IF_TypeDef *)FM4_FLASH_IF_BASE)
#define FM4_UNIQUE_ID   ((FM4_UNIQUE_ID_TypeDef *)FM4_UNIQUE_ID_BASE)
#define FM4_ECC_CAPTURE ((FM4_ECC_CAPTURE_TypeDef *)FM4_ECC_CAPTURE_BASE)
#define FM4_DUALFLASH_IF ((FM4_DUALFLASH_IF_TypeDef *)FM4_DUALFLASH_IF_BASE)
#define FM4_CRG         ((FM4_CRG_TypeDef *)FM4_CRG_BASE)
#define FM4_HWWDT       ((FM4_HWWDT_TypeDef *)FM4_HWWDT_BASE)
#define FM4_SWWDT       ((FM4_SWWDT_TypeDef *)FM4_SWWDT_BASE)
#define FM4_DTIM        ((FM4_DTIM_TypeDef *)FM4_DTIM_BASE)
#define FM4_MFT0_FRT    ((FM4_MFT_FRT_TypeDef *)FM4_MFT0_FRT_BASE)
#define FM4_MFT0_OCU    ((FM4_MFT_OCU_TypeDef *)FM4_MFT0_OCU_BASE)
#define FM4_MFT0_WFG    ((FM4_MFT_WFG_TypeDef *)FM4_MFT0_WFG_BASE)
#define FM4_MFT0_ICU    ((FM4_MFT_ICU_TypeDef *)FM4_MFT0_ICU_BASE)
#define FM4_MFT0_ADCMP  ((FM4_MFT_ADCMP_TypeDef *)FM4_MFT0_ADCMP_BASE)
#define FM4_MFT1_FRT    ((FM4_MFT_FRT_TypeDef *)FM4_MFT1_FRT_BASE)
#define FM4_MFT1_OCU    ((FM4_MFT_OCU_TypeDef *)FM4_MFT1_OCU_BASE)
#define FM4_MFT1_WFG    ((FM4_MFT_WFG_TypeDef *)FM4_MFT1_WFG_BASE)
#define FM4_MFT1_ICU    ((FM4_MFT_ICU_TypeDef *)FM4_MFT1_ICU_BASE)
#define FM4_MFT1_ADCMP  ((FM4_MFT_ADCMP_TypeDef *)FM4_MFT1_ADCMP_BASE)
#define FM4_MFT2_FRT    ((FM4_MFT_FRT_TypeDef *)FM4_MFT2_FRT_BASE)
#define FM4_MFT2_OCU    ((FM4_MFT_OCU_TypeDef *)FM4_MFT2_OCU_BASE)
#define FM4_MFT2_WFG    ((FM4_MFT_WFG_TypeDef *)FM4_MFT2_WFG_BASE)
#define FM4_MFT2_ICU    ((FM4_MFT_ICU_TypeDef *)FM4_MFT2_ICU_BASE)
#define FM4_MFT2_ADCMP  ((FM4_MFT_ADCMP_TypeDef *)FM4_MFT2_ADCMP_BASE)
#define FM4_MFT_PPG     ((FM4_MFT_PPG_TypeDef *)FM4_MFT_PPG_BASE)
#define FM4_BT0_PPG     ((FM4_BT_PPG_TypeDef *)FM4_BT0_PPG_BASE)
#define FM4_BT0_PWM     ((FM4_BT_PWM_TypeDef *)FM4_BT0_PWM_BASE)
#define FM4_BT0_RT      ((FM4_BT_RT_TypeDef *)FM4_BT0_RT_BASE)
#define FM4_BT0_PWC     ((FM4_BT_PWC_TypeDef *)FM4_BT0_PWC_BASE)
#define FM4_BT1_PPG     ((FM4_BT_PPG_TypeDef *)FM4_BT1_PPG_BASE)
#define FM4_BT1_PWM     ((FM4_BT_PWM_TypeDef *)FM4_BT1_PWM_BASE)
#define FM4_BT1_RT      ((FM4_BT_RT_TypeDef *)FM4_BT1_RT_BASE)
#define FM4_BT1_PWC     ((FM4_BT_PWC_TypeDef *)FM4_BT1_PWC_BASE)
#define FM4_BT2_PPG     ((FM4_BT_PPG_TypeDef *)FM4_BT2_PPG_BASE)
#define FM4_BT2_PWM     ((FM4_BT_PWM_TypeDef *)FM4_BT2_PWM_BASE)
#define FM4_BT2_RT      ((FM4_BT_RT_TypeDef *)FM4_BT2_RT_BASE)
#define FM4_BT2_PWC     ((FM4_BT_PWC_TypeDef *)FM4_BT2_PWC_BASE)
#define FM4_BT3_PPG     ((FM4_BT_PPG_TypeDef *)FM4_BT3_PPG_BASE)
#define FM4_BT3_PWM     ((FM4_BT_PWM_TypeDef *)FM4_BT3_PWM_BASE)
#define FM4_BT3_RT      ((FM4_BT_RT_TypeDef *)FM4_BT3_RT_BASE)
#define FM4_BT3_PWC     ((FM4_BT_PWC_TypeDef *)FM4_BT3_PWC_BASE)
#define FM4_BT4_PPG     ((FM4_BT_PPG_TypeDef *)FM4_BT4_PPG_BASE)
#define FM4_BT4_PWM     ((FM4_BT_PWM_TypeDef *)FM4_BT4_PWM_BASE)
#define FM4_BT4_RT      ((FM4_BT_RT_TypeDef *)FM4_BT4_RT_BASE)
#define FM4_BT4_PWC     ((FM4_BT_PWC_TypeDef *)FM4_BT4_PWC_BASE)
#define FM4_BT5_PPG     ((FM4_BT_PPG_TypeDef *)FM4_BT5_PPG_BASE)
#define FM4_BT5_PWM     ((FM4_BT_PWM_TypeDef *)FM4_BT5_PWM_BASE)
#define FM4_BT5_RT      ((FM4_BT_RT_TypeDef *)FM4_BT5_RT_BASE)
#define FM4_BT5_PWC     ((FM4_BT_PWC_TypeDef *)FM4_BT5_PWC_BASE)
#define FM4_BT6_PPG     ((FM4_BT_PPG_TypeDef *)FM4_BT6_PPG_BASE)
#define FM4_BT6_PWM     ((FM4_BT_PWM_TypeDef *)FM4_BT6_PWM_BASE)
#define FM4_BT6_RT      ((FM4_BT_RT_TypeDef *)FM4_BT6_RT_BASE)
#define FM4_BT6_PWC     ((FM4_BT_PWC_TypeDef *)FM4_BT6_PWC_BASE)
#define FM4_BT7_PPG     ((FM4_BT_PPG_TypeDef *)FM4_BT7_PPG_BASE)
#define FM4_BT7_PWM     ((FM4_BT_PWM_TypeDef *)FM4_BT7_PWM_BASE)
#define FM4_BT7_RT      ((FM4_BT_RT_TypeDef *)FM4_BT7_RT_BASE)
#define FM4_BT7_PWC     ((FM4_BT_PWC_TypeDef *)FM4_BT7_PWC_BASE)
#define FM4_BTIOSEL03   ((FM4_BTIOSEL03_TypeDef *)FM4_BTIOSEL03_BASE)
#define FM4_BTIOSEL47   ((FM4_BTIOSEL47_TypeDef *)FM4_BTIOSEL47_BASE)
#define FM4_BT8_PPG     ((FM4_BT_PPG_TypeDef *)FM4_BT8_PPG_BASE)
#define FM4_BT8_PWM     ((FM4_BT_PWM_TypeDef *)FM4_BT8_PWM_BASE)
#define FM4_BT8_RT      ((FM4_BT_RT_TypeDef *)FM4_BT8_RT_BASE)
#define FM4_BT8_PWC     ((FM4_BT_PWC_TypeDef *)FM4_BT8_PWC_BASE)
#define FM4_BT9_PPG     ((FM4_BT_PPG_TypeDef *)FM4_BT9_PPG_BASE)
#define FM4_BT9_PWM     ((FM4_BT_PWM_TypeDef *)FM4_BT9_PWM_BASE)
#define FM4_BT9_RT      ((FM4_BT_RT_TypeDef *)FM4_BT9_RT_BASE)
#define FM4_BT9_PWC     ((FM4_BT_PWC_TypeDef *)FM4_BT9_PWC_BASE)
#define FM4_BT10_PPG    ((FM4_BT_PPG_TypeDef *)FM4_BT10_PPG_BASE)
#define FM4_BT10_PWM    ((FM4_BT_PWM_TypeDef *)FM4_BT10_PWM_BASE)
#define FM4_BT10_RT     ((FM4_BT_RT_TypeDef *)FM4_BT10_RT_BASE)
#define FM4_BT10_PWC    ((FM4_BT_PWC_TypeDef *)FM4_BT10_PWC_BASE)
#define FM4_BT11_PPG    ((FM4_BT_PPG_TypeDef *)FM4_BT11_PPG_BASE)
#define FM4_BT11_PWM    ((FM4_BT_PWM_TypeDef *)FM4_BT11_PWM_BASE)
#define FM4_BT11_RT     ((FM4_BT_RT_TypeDef *)FM4_BT11_RT_BASE)
#define FM4_BT11_PWC    ((FM4_BT_PWC_TypeDef *)FM4_BT11_PWC_BASE)
#define FM4_BT12_PPG    ((FM4_BT_PPG_TypeDef *)FM4_BT12_PPG_BASE)
#define FM4_BT12_PWM    ((FM4_BT_PWM_TypeDef *)FM4_BT12_PWM_BASE)
#define FM4_BT12_RT     ((FM4_BT_RT_TypeDef *)FM4_BT12_RT_BASE)
#define FM4_BT12_PWC    ((FM4_BT_PWC_TypeDef *)FM4_BT12_PWC_BASE)
#define FM4_BT13_PPG    ((FM4_BT_PPG_TypeDef *)FM4_BT13_PPG_BASE)
#define FM4_BT13_PWM    ((FM4_BT_PWM_TypeDef *)FM4_BT13_PWM_BASE)
#define FM4_BT13_RT     ((FM4_BT_RT_TypeDef *)FM4_BT13_RT_BASE)
#define FM4_BT13_PWC    ((FM4_BT_PWC_TypeDef *)FM4_BT13_PWC_BASE)
#define FM4_BT14_PPG    ((FM4_BT_PPG_TypeDef *)FM4_BT14_PPG_BASE)
#define FM4_BT14_PWM    ((FM4_BT_PWM_TypeDef *)FM4_BT14_PWM_BASE)
#define FM4_BT14_RT     ((FM4_BT_RT_TypeDef *)FM4_BT14_RT_BASE)
#define FM4_BT14_PWC    ((FM4_BT_PWC_TypeDef *)FM4_BT14_PWC_BASE)
#define FM4_BT15_PPG    ((FM4_BT_PPG_TypeDef *)FM4_BT15_PPG_BASE)
#define FM4_BT15_PWM    ((FM4_BT_PWM_TypeDef *)FM4_BT15_PWM_BASE)
#define FM4_BT15_RT     ((FM4_BT_RT_TypeDef *)FM4_BT15_RT_BASE)
#define FM4_BT15_PWC    ((FM4_BT_PWC_TypeDef *)FM4_BT15_PWC_BASE)
#define FM4_BTIOSEL8B   ((FM4_BTIOSEL8B_TypeDef *)FM4_BTIOSEL8B_BASE)
#define FM4_BTIOSELCF   ((FM4_BTIOSELCF_TypeDef *)FM4_BTIOSELCF_BASE)
#define FM4_SBSSR       ((FM4_SBSSR_TypeDef *)FM4_SBSSR_BASE)
#define FM4_QPRC0       ((FM4_QPRC_TypeDef *)FM4_QPRC0_BASE)
#define FM4_QPRC1       ((FM4_QPRC_TypeDef *)FM4_QPRC1_BASE)
#define FM4_QPRC2       ((FM4_QPRC_TypeDef *)FM4_QPRC2_BASE)
#define FM4_QPRC3       ((FM4_QPRC_TypeDef *)FM4_QPRC3_BASE)
#define FM4_QPRC0_NF    ((FM4_QPRC_NF_TypeDef *)FM4_QPRC0_NF_BASE)
#define FM4_QPRC1_NF    ((FM4_QPRC_NF_TypeDef *)FM4_QPRC1_NF_BASE)
#define FM4_QPRC2_NF    ((FM4_QPRC_NF_TypeDef *)FM4_QPRC2_NF_BASE)
#define FM4_QPRC3_NF    ((FM4_QPRC_NF_TypeDef *)FM4_QPRC3_NF_BASE)
#define FM4_ADC0        ((FM4_ADC_TypeDef *)FM4_ADC0_BASE)
#define FM4_ADC1        ((FM4_ADC_TypeDef *)FM4_ADC1_BASE)
#define FM4_ADC2        ((FM4_ADC_TypeDef *)FM4_ADC2_BASE)
#define FM4_DAC0        ((FM4_DAC_TypeDef *)FM4_DAC0_BASE)
#define FM4_DAC1        ((FM4_DAC_TypeDef *)FM4_DAC1_BASE)
#define FM4_CRTRIM      ((FM4_CRTRIM_TypeDef *)FM4_CRTRIM_BASE)
#define FM4_EXTI        ((FM4_EXTI_TypeDef *)FM4_EXTI_BASE)
#define FM4_INTREQ      ((FM4_INTREQ_TypeDef *)FM4_INTREQ_BASE)
#define FM4_IRQSEL      ((FM4_IRQSEL_TypeDef *)FM4_IRQSEL_BASE)
#define FM4_HDMICEC0    ((FM4_HDMICEC_TypeDef *)FM4_HDMICEC0_BASE)
#define FM4_HDMICEC1    ((FM4_HDMICEC_TypeDef *)FM4_HDMICEC1_BASE)
#define FM4_GPIO        ((FM4_GPIO_TypeDef *)FM4_GPIO_BASE)
#define FM4_LVD         ((FM4_LVD_TypeDef *)FM4_LVD_BASE)
#define FM4_DS          ((FM4_DS_TypeDef *)FM4_DS_BASE)
#define FM4_CANPRES     ((FM4_CANPRE_TypeDef *)FM4_CANPRES_BASE)
#define FM4_MFS0        ((FM4_MFS_TypeDef *)FM4_MFS0_BASE)
#define FM4_MFS1        ((FM4_MFS_TypeDef *)FM4_MFS1_BASE)
#define FM4_MFS2        ((FM4_MFS_TypeDef *)FM4_MFS2_BASE)
#define FM4_MFS3        ((FM4_MFS_TypeDef *)FM4_MFS3_BASE)
#define FM4_MFS4        ((FM4_MFS_TypeDef *)FM4_MFS4_BASE)
#define FM4_MFS5        ((FM4_MFS_TypeDef *)FM4_MFS5_BASE)
#define FM4_MFS6        ((FM4_MFS_TypeDef *)FM4_MFS6_BASE)
#define FM4_MFS7        ((FM4_MFS_TypeDef *)FM4_MFS7_BASE)
#define FM4_MFS8        ((FM4_MFS_TypeDef *)FM4_MFS8_BASE)
#define FM4_MFS9        ((FM4_MFS_TypeDef *)FM4_MFS9_BASE)
#define FM4_MFS10       ((FM4_MFS_TypeDef *)FM4_MFS10_BASE)
#define FM4_MFS11       ((FM4_MFS_TypeDef *)FM4_MFS11_BASE)
#define FM4_MFS12       ((FM4_MFS_TypeDef *)FM4_MFS12_BASE)
#define FM4_MFS13       ((FM4_MFS_TypeDef *)FM4_MFS13_BASE)
#define FM4_MFS14       ((FM4_MFS_TypeDef *)FM4_MFS14_BASE)
#define FM4_MFS15       ((FM4_MFS_TypeDef *)FM4_MFS15_BASE)
#define FM4_CRC         ((FM4_CRC_TypeDef *)FM4_CRC_BASE)
#define FM4_WC          ((FM4_WC_TypeDef *)FM4_WC_BASE)
#define FM4_RTC         ((FM4_RTC_TypeDef *)FM4_RTC_BASE)
#define FM4_LCR         ((FM4_LCR_TypeDef *)FM4_LCR_BASE)
#define FM4_CLK_GATING  ((FM4_CLK_GATING_TypeDef *)FM4_CLK_GATING_BASE)
#define FM4_PLL_CONTROL ((FM4_PLL_CONTROL_TypeDef *)FM4_PLL_CONTROL_BASE)
#define FM4_I2SPRE      ((FM4_I2SPRE_TypeDef *)FM4_I2SPRE_BASE)
#define FM4_EXBUS       ((FM4_EXBUS_TypeDef *)FM4_EXBUS_BASE)
#define FM4_DMAC        ((FM4_DMAC_TypeDef *)FM4_DMAC_BASE)
#define FM4_DSTC        ((FM4_DSTC_TypeDef *)FM4_DSTC_BASE)
#define FM4_CAN0        ((FM4_CAN_TypeDef *)FM4_CAN0_BASE)
#define FM4_CAN1        ((FM4_CAN_TypeDef *)FM4_CAN1_BASE)
#define FM4_I2S0        ((FM4_I2S_TypeDef *)FM4_I2S0_BASE)
#define FM4_SDIF        ((FM4_SDIF_TypeDef *)FM4_SDIF_BASE)
#define FM4_CANFD       ((FM4_CANFD_TypeDef *)FM4_CANFD_BASE)
#define FM4_PCRC        ((FM4_PCRC_TypeDef *)FM4_PCRC_BASE)
#define FM4_HSSPI       ((FM4_HSSPI_TypeDef *)FM4_HSSPI_BASE)

