MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2C48J0AGB1000A/mcu.h
/******************************************************************************
 * Peripheral Bit Band Alias declaration
 ******************************************************************************/

/* Flash interface registers */
#define bFM4_FLASH_IF_FASZR_ASZ0               *((volatile unsigned char*)(0x42000000UL))
#define bFM4_FLASH_IF_FASZR_ASZ1               *((volatile unsigned char*)(0x42000004UL))
#define bFM4_FLASH_IF_FRWTR_RWT0               *((volatile unsigned char*)(0x42000080UL))
#define bFM4_FLASH_IF_FRWTR_RWT1               *((volatile unsigned char*)(0x42000084UL))
#define bFM4_FLASH_IF_FSTR_RDY                 *((volatile unsigned char*)(0x42000100UL))
#define bFM4_FLASH_IF_FSTR_HNG                 *((volatile unsigned char*)(0x42000104UL))
#define bFM4_FLASH_IF_FSTR_ERR                 *((volatile unsigned char*)(0x42000108UL))
#define bFM4_FLASH_IF_FSYNDN_SD0               *((volatile unsigned char*)(0x42000200UL))
#define bFM4_FLASH_IF_FSYNDN_SD1               *((volatile unsigned char*)(0x42000204UL))
#define bFM4_FLASH_IF_FSYNDN_SD2               *((volatile unsigned char*)(0x42000208UL))
#define bFM4_FLASH_IF_FBFCR_BE                 *((volatile unsigned char*)(0x42000280UL))
#define bFM4_FLASH_IF_FBFCR_BS                 *((volatile unsigned char*)(0x42000284UL))
#define bFM4_FLASH_IF_FICR_RDYIE               *((volatile unsigned char*)(0x42000400UL))
#define bFM4_FLASH_IF_FICR_HANGIE              *((volatile unsigned char*)(0x42000404UL))
#define bFM4_FLASH_IF_FICR_ERRIE               *((volatile unsigned char*)(0x42000408UL))
#define bFM4_FLASH_IF_FISR_RDYIF               *((volatile unsigned char*)(0x42000480UL))
#define bFM4_FLASH_IF_FISR_HANGIF              *((volatile unsigned char*)(0x42000484UL))
#define bFM4_FLASH_IF_FISR_ERRIF               *((volatile unsigned char*)(0x42000488UL))
#define bFM4_FLASH_IF_FICLR_RDYIC              *((volatile unsigned char*)(0x42000500UL))
#define bFM4_FLASH_IF_FICLR_HANGIC             *((volatile unsigned char*)(0x42000504UL))
#define bFM4_FLASH_IF_FICLR_ERRIC              *((volatile unsigned char*)(0x42000508UL))
#define bFM4_FLASH_IF_DFCTRLR_DFE              *((volatile unsigned char*)(0x42000600UL))
#define bFM4_FLASH_IF_DFCTRLR_RME              *((volatile unsigned char*)(0x42000604UL))
#define bFM4_FLASH_IF_DFCTRLR_WKEY0            *((volatile unsigned char*)(0x42000640UL))
#define bFM4_FLASH_IF_DFCTRLR_WKEY1            *((volatile unsigned char*)(0x42000644UL))
#define bFM4_FLASH_IF_DFCTRLR_WKEY2            *((volatile unsigned char*)(0x42000648UL))
#define bFM4_FLASH_IF_DFCTRLR_WKEY3            *((volatile unsigned char*)(0x4200064CUL))
#define bFM4_FLASH_IF_DFCTRLR_WKEY4            *((volatile unsigned char*)(0x42000650UL))
#define bFM4_FLASH_IF_DFCTRLR_WKEY5            *((volatile unsigned char*)(0x42000654UL))
#define bFM4_FLASH_IF_DFCTRLR_WKEY6            *((volatile unsigned char*)(0x42000658UL))
#define bFM4_FLASH_IF_DFCTRLR_WKEY7            *((volatile unsigned char*)(0x4200065CUL))
#define bFM4_FLASH_IF_DFCTRLR_WKEY8            *((volatile unsigned char*)(0x42000660UL))
#define bFM4_FLASH_IF_DFCTRLR_WKEY9            *((volatile unsigned char*)(0x42000664UL))
#define bFM4_FLASH_IF_DFCTRLR_WKEY10           *((volatile unsigned char*)(0x42000668UL))
#define bFM4_FLASH_IF_DFCTRLR_WKEY11           *((volatile unsigned char*)(0x4200066CUL))
#define bFM4_FLASH_IF_DFCTRLR_WKEY12           *((volatile unsigned char*)(0x42000670UL))
#define bFM4_FLASH_IF_DFCTRLR_WKEY13           *((volatile unsigned char*)(0x42000674UL))
#define bFM4_FLASH_IF_DFCTRLR_WKEY14           *((volatile unsigned char*)(0x42000678UL))
#define bFM4_FLASH_IF_DFCTRLR_WKEY15           *((volatile unsigned char*)(0x4200067CUL))
#define bFM4_FLASH_IF_CRTRMM_TRMM0             *((volatile unsigned char*)(0x42002000UL))
#define bFM4_FLASH_IF_CRTRMM_TRMM1             *((volatile unsigned char*)(0x42002004UL))
#define bFM4_FLASH_IF_CRTRMM_TRMM2             *((volatile unsigned char*)(0x42002008UL))
#define bFM4_FLASH_IF_CRTRMM_TRMM3             *((volatile unsigned char*)(0x4200200CUL))
#define bFM4_FLASH_IF_CRTRMM_TRMM4             *((volatile unsigned char*)(0x42002010UL))
#define bFM4_FLASH_IF_CRTRMM_TRMM5             *((volatile unsigned char*)(0x42002014UL))
#define bFM4_FLASH_IF_CRTRMM_TRMM6             *((volatile unsigned char*)(0x42002018UL))
#define bFM4_FLASH_IF_CRTRMM_TRMM7             *((volatile unsigned char*)(0x4200201CUL))
#define bFM4_FLASH_IF_CRTRMM_TRMM8             *((volatile unsigned char*)(0x42002020UL))
#define bFM4_FLASH_IF_CRTRMM_TRMM9             *((volatile unsigned char*)(0x42002024UL))
#define bFM4_FLASH_IF_CRTRMM_TTRMM0            *((volatile unsigned char*)(0x42002040UL))
#define bFM4_FLASH_IF_CRTRMM_TTRMM1            *((volatile unsigned char*)(0x42002044UL))
#define bFM4_FLASH_IF_CRTRMM_TTRMM2            *((volatile unsigned char*)(0x42002048UL))
#define bFM4_FLASH_IF_CRTRMM_TTRMM3            *((volatile unsigned char*)(0x4200204CUL))
#define bFM4_FLASH_IF_CRTRMM_TTRMM4            *((volatile unsigned char*)(0x42002050UL))
#define bFM4_FLASH_IF_FGPDM1_GPD10             *((volatile unsigned char*)(0x42002200UL))
#define bFM4_FLASH_IF_FGPDM1_GPD11             *((volatile unsigned char*)(0x42002204UL))
#define bFM4_FLASH_IF_FGPDM1_GPD12             *((volatile unsigned char*)(0x42002208UL))
#define bFM4_FLASH_IF_FGPDM1_GPD13             *((volatile unsigned char*)(0x4200220CUL))
#define bFM4_FLASH_IF_FGPDM1_GPD14             *((volatile unsigned char*)(0x42002210UL))
#define bFM4_FLASH_IF_FGPDM1_GPD15             *((volatile unsigned char*)(0x42002214UL))
#define bFM4_FLASH_IF_FGPDM1_GPD16             *((volatile unsigned char*)(0x42002218UL))
#define bFM4_FLASH_IF_FGPDM1_GPD17             *((volatile unsigned char*)(0x4200221CUL))
#define bFM4_FLASH_IF_FGPDM1_GPD18             *((volatile unsigned char*)(0x42002220UL))
#define bFM4_FLASH_IF_FGPDM1_GPD19             *((volatile unsigned char*)(0x42002224UL))
#define bFM4_FLASH_IF_FGPDM1_GPD110            *((volatile unsigned char*)(0x42002228UL))
#define bFM4_FLASH_IF_FGPDM1_GPD111            *((volatile unsigned char*)(0x4200222CUL))
#define bFM4_FLASH_IF_FGPDM1_GPD112            *((volatile unsigned char*)(0x42002230UL))
#define bFM4_FLASH_IF_FGPDM1_GPD113            *((volatile unsigned char*)(0x42002234UL))
#define bFM4_FLASH_IF_FGPDM1_GPD114            *((volatile unsigned char*)(0x42002238UL))
#define bFM4_FLASH_IF_FGPDM1_GPD115            *((volatile unsigned char*)(0x4200223CUL))
#define bFM4_FLASH_IF_FGPDM1_GPD116            *((volatile unsigned char*)(0x42002240UL))
#define bFM4_FLASH_IF_FGPDM1_GPD117            *((volatile unsigned char*)(0x42002244UL))
#define bFM4_FLASH_IF_FGPDM1_GPD118            *((volatile unsigned char*)(0x42002248UL))
#define bFM4_FLASH_IF_FGPDM1_GPD119            *((volatile unsigned char*)(0x4200224CUL))
#define bFM4_FLASH_IF_FGPDM1_GPD120            *((volatile unsigned char*)(0x42002250UL))
#define bFM4_FLASH_IF_FGPDM1_GPD121            *((volatile unsigned char*)(0x42002254UL))
#define bFM4_FLASH_IF_FGPDM1_GPD122            *((volatile unsigned char*)(0x42002258UL))
#define bFM4_FLASH_IF_FGPDM1_GPD123            *((volatile unsigned char*)(0x4200225CUL))
#define bFM4_FLASH_IF_FGPDM1_GPD124            *((volatile unsigned char*)(0x42002260UL))
#define bFM4_FLASH_IF_FGPDM1_GPD125            *((volatile unsigned char*)(0x42002264UL))
#define bFM4_FLASH_IF_FGPDM1_GPD126            *((volatile unsigned char*)(0x42002268UL))
#define bFM4_FLASH_IF_FGPDM1_GPD127            *((volatile unsigned char*)(0x4200226CUL))
#define bFM4_FLASH_IF_FGPDM1_GPD128            *((volatile unsigned char*)(0x42002270UL))
#define bFM4_FLASH_IF_FGPDM1_GPD129            *((volatile unsigned char*)(0x42002274UL))
#define bFM4_FLASH_IF_FGPDM1_GPD130            *((volatile unsigned char*)(0x42002278UL))
#define bFM4_FLASH_IF_FGPDM1_GPD131            *((volatile unsigned char*)(0x4200227CUL))
#define bFM4_FLASH_IF_FGPDM2_GPD20             *((volatile unsigned char*)(0x42002280UL))
#define bFM4_FLASH_IF_FGPDM2_GPD21             *((volatile unsigned char*)(0x42002284UL))
#define bFM4_FLASH_IF_FGPDM2_GPD22             *((volatile unsigned char*)(0x42002288UL))
#define bFM4_FLASH_IF_FGPDM2_GPD23             *((volatile unsigned char*)(0x4200228CUL))
#define bFM4_FLASH_IF_FGPDM2_GPD24             *((volatile unsigned char*)(0x42002290UL))
#define bFM4_FLASH_IF_FGPDM2_GPD25             *((volatile unsigned char*)(0x42002294UL))
#define bFM4_FLASH_IF_FGPDM2_GPD26             *((volatile unsigned char*)(0x42002298UL))
#define bFM4_FLASH_IF_FGPDM2_GPD27             *((volatile unsigned char*)(0x4200229CUL))
#define bFM4_FLASH_IF_FGPDM2_GPD28             *((volatile unsigned char*)(0x420022A0UL))
#define bFM4_FLASH_IF_FGPDM2_GPD29             *((volatile unsigned char*)(0x420022A4UL))
#define bFM4_FLASH_IF_FGPDM2_GPD210            *((volatile unsigned char*)(0x420022A8UL))
#define bFM4_FLASH_IF_FGPDM2_GPD211            *((volatile unsigned char*)(0x420022ACUL))
#define bFM4_FLASH_IF_FGPDM2_GPD212            *((volatile unsigned char*)(0x420022B0UL))
#define bFM4_FLASH_IF_FGPDM2_GPD213            *((volatile unsigned char*)(0x420022B4UL))
#define bFM4_FLASH_IF_FGPDM2_GPD214            *((volatile unsigned char*)(0x420022B8UL))
#define bFM4_FLASH_IF_FGPDM2_GPD215            *((volatile unsigned char*)(0x420022BCUL))
#define bFM4_FLASH_IF_FGPDM2_GPD216            *((volatile unsigned char*)(0x420022C0UL))
#define bFM4_FLASH_IF_FGPDM2_GPD217            *((volatile unsigned char*)(0x420022C4UL))
#define bFM4_FLASH_IF_FGPDM2_GPD218            *((volatile unsigned char*)(0x420022C8UL))
#define bFM4_FLASH_IF_FGPDM2_GPD219            *((volatile unsigned char*)(0x420022CCUL))
#define bFM4_FLASH_IF_FGPDM2_GPD220            *((volatile unsigned char*)(0x420022D0UL))
#define bFM4_FLASH_IF_FGPDM2_GPD221            *((volatile unsigned char*)(0x420022D4UL))
#define bFM4_FLASH_IF_FGPDM2_GPD222            *((volatile unsigned char*)(0x420022D8UL))
#define bFM4_FLASH_IF_FGPDM2_GPD223            *((volatile unsigned char*)(0x420022DCUL))
#define bFM4_FLASH_IF_FGPDM2_GPD224            *((volatile unsigned char*)(0x420022E0UL))
#define bFM4_FLASH_IF_FGPDM2_GPD225            *((volatile unsigned char*)(0x420022E4UL))
#define bFM4_FLASH_IF_FGPDM2_GPD226            *((volatile unsigned char*)(0x420022E8UL))
#define bFM4_FLASH_IF_FGPDM2_GPD227            *((volatile unsigned char*)(0x420022ECUL))
#define bFM4_FLASH_IF_FGPDM2_GPD228            *((volatile unsigned char*)(0x420022F0UL))
#define bFM4_FLASH_IF_FGPDM2_GPD229            *((volatile unsigned char*)(0x420022F4UL))
#define bFM4_FLASH_IF_FGPDM2_GPD230            *((volatile unsigned char*)(0x420022F8UL))
#define bFM4_FLASH_IF_FGPDM2_GPD231            *((volatile unsigned char*)(0x420022FCUL))
#define bFM4_FLASH_IF_FGPDM3_GPD30             *((volatile unsigned char*)(0x42002300UL))
#define bFM4_FLASH_IF_FGPDM3_GPD31             *((volatile unsigned char*)(0x42002304UL))
#define bFM4_FLASH_IF_FGPDM3_GPD32             *((volatile unsigned char*)(0x42002308UL))
#define bFM4_FLASH_IF_FGPDM3_GPD33             *((volatile unsigned char*)(0x4200230CUL))
#define bFM4_FLASH_IF_FGPDM3_GPD34             *((volatile unsigned char*)(0x42002310UL))
#define bFM4_FLASH_IF_FGPDM3_GPD35             *((volatile unsigned char*)(0x42002314UL))
#define bFM4_FLASH_IF_FGPDM3_GPD36             *((volatile unsigned char*)(0x42002318UL))
#define bFM4_FLASH_IF_FGPDM3_GPD37             *((volatile unsigned char*)(0x4200231CUL))
#define bFM4_FLASH_IF_FGPDM3_GPD38             *((volatile unsigned char*)(0x42002320UL))
#define bFM4_FLASH_IF_FGPDM3_GPD39             *((volatile unsigned char*)(0x42002324UL))
#define bFM4_FLASH_IF_FGPDM3_GPD310            *((volatile unsigned char*)(0x42002328UL))
#define bFM4_FLASH_IF_FGPDM3_GPD311            *((volatile unsigned char*)(0x4200232CUL))
#define bFM4_FLASH_IF_FGPDM3_GPD312            *((volatile unsigned char*)(0x42002330UL))
#define bFM4_FLASH_IF_FGPDM3_GPD313            *((volatile unsigned char*)(0x42002334UL))
#define bFM4_FLASH_IF_FGPDM3_GPD314            *((volatile unsigned char*)(0x42002338UL))
#define bFM4_FLASH_IF_FGPDM3_GPD315            *((volatile unsigned char*)(0x4200233CUL))
#define bFM4_FLASH_IF_FGPDM3_GPD316            *((volatile unsigned char*)(0x42002340UL))
#define bFM4_FLASH_IF_FGPDM3_GPD317            *((volatile unsigned char*)(0x42002344UL))
#define bFM4_FLASH_IF_FGPDM3_GPD318            *((volatile unsigned char*)(0x42002348UL))
#define bFM4_FLASH_IF_FGPDM3_GPD319            *((volatile unsigned char*)(0x4200234CUL))
#define bFM4_FLASH_IF_FGPDM3_GPD320            *((volatile unsigned char*)(0x42002350UL))
#define bFM4_FLASH_IF_FGPDM3_GPD321            *((volatile unsigned char*)(0x42002354UL))
#define bFM4_FLASH_IF_FGPDM3_GPD322            *((volatile unsigned char*)(0x42002358UL))
#define bFM4_FLASH_IF_FGPDM3_GPD323            *((volatile unsigned char*)(0x4200235CUL))
#define bFM4_FLASH_IF_FGPDM3_GPD324            *((volatile unsigned char*)(0x42002360UL))
#define bFM4_FLASH_IF_FGPDM3_GPD325            *((volatile unsigned char*)(0x42002364UL))
#define bFM4_FLASH_IF_FGPDM3_GPD326            *((volatile unsigned char*)(0x42002368UL))
#define bFM4_FLASH_IF_FGPDM3_GPD327            *((volatile unsigned char*)(0x4200236CUL))
#define bFM4_FLASH_IF_FGPDM3_GPD328            *((volatile unsigned char*)(0x42002370UL))
#define bFM4_FLASH_IF_FGPDM3_GPD329            *((volatile unsigned char*)(0x42002374UL))
#define bFM4_FLASH_IF_FGPDM3_GPD330            *((volatile unsigned char*)(0x42002378UL))
#define bFM4_FLASH_IF_FGPDM3_GPD331            *((volatile unsigned char*)(0x4200237CUL))
#define bFM4_FLASH_IF_FGPDM4_GPD40             *((volatile unsigned char*)(0x42002380UL))
#define bFM4_FLASH_IF_FGPDM4_GPD41             *((volatile unsigned char*)(0x42002384UL))
#define bFM4_FLASH_IF_FGPDM4_GPD42             *((volatile unsigned char*)(0x42002388UL))
#define bFM4_FLASH_IF_FGPDM4_GPD43             *((volatile unsigned char*)(0x4200238CUL))
#define bFM4_FLASH_IF_FGPDM4_GPD44             *((volatile unsigned char*)(0x42002390UL))
#define bFM4_FLASH_IF_FGPDM4_GPD45             *((volatile unsigned char*)(0x42002394UL))
#define bFM4_FLASH_IF_FGPDM4_GPD46             *((volatile unsigned char*)(0x42002398UL))
#define bFM4_FLASH_IF_FGPDM4_GPD47             *((volatile unsigned char*)(0x4200239CUL))
#define bFM4_FLASH_IF_FGPDM4_GPD48             *((volatile unsigned char*)(0x420023A0UL))
#define bFM4_FLASH_IF_FGPDM4_GPD49             *((volatile unsigned char*)(0x420023A4UL))
#define bFM4_FLASH_IF_FGPDM4_GPD410            *((volatile unsigned char*)(0x420023A8UL))
#define bFM4_FLASH_IF_FGPDM4_GPD411            *((volatile unsigned char*)(0x420023ACUL))
#define bFM4_FLASH_IF_FGPDM4_GPD412            *((volatile unsigned char*)(0x420023B0UL))
#define bFM4_FLASH_IF_FGPDM4_GPD413            *((volatile unsigned char*)(0x420023B4UL))
#define bFM4_FLASH_IF_FGPDM4_GPD414            *((volatile unsigned char*)(0x420023B8UL))
#define bFM4_FLASH_IF_FGPDM4_GPD415            *((volatile unsigned char*)(0x420023BCUL))
#define bFM4_FLASH_IF_FGPDM4_GPD416            *((volatile unsigned char*)(0x420023C0UL))
#define bFM4_FLASH_IF_FGPDM4_GPD417            *((volatile unsigned char*)(0x420023C4UL))
#define bFM4_FLASH_IF_FGPDM4_GPD418            *((volatile unsigned char*)(0x420023C8UL))
#define bFM4_FLASH_IF_FGPDM4_GPD419            *((volatile unsigned char*)(0x420023CCUL))
#define bFM4_FLASH_IF_FGPDM4_GPD420            *((volatile unsigned char*)(0x420023D0UL))
#define bFM4_FLASH_IF_FGPDM4_GPD421            *((volatile unsigned char*)(0x420023D4UL))
#define bFM4_FLASH_IF_FGPDM4_GPD422            *((volatile unsigned char*)(0x420023D8UL))
#define bFM4_FLASH_IF_FGPDM4_GPD423            *((volatile unsigned char*)(0x420023DCUL))
#define bFM4_FLASH_IF_FGPDM4_GPD424            *((volatile unsigned char*)(0x420023E0UL))
#define bFM4_FLASH_IF_FGPDM4_GPD425            *((volatile unsigned char*)(0x420023E4UL))
#define bFM4_FLASH_IF_FGPDM4_GPD426            *((volatile unsigned char*)(0x420023E8UL))
#define bFM4_FLASH_IF_FGPDM4_GPD427            *((volatile unsigned char*)(0x420023ECUL))
#define bFM4_FLASH_IF_FGPDM4_GPD428            *((volatile unsigned char*)(0x420023F0UL))
#define bFM4_FLASH_IF_FGPDM4_GPD429            *((volatile unsigned char*)(0x420023F4UL))
#define bFM4_FLASH_IF_FGPDM4_GPD430            *((volatile unsigned char*)(0x420023F8UL))
#define bFM4_FLASH_IF_FGPDM4_GPD431            *((volatile unsigned char*)(0x420023FCUL))

/* Dual Flash interface registers */
#define bFM4_DUALFLASH_IF_DFASZR_DASZ0         *((volatile unsigned char*)(0x42008000UL))
#define bFM4_DUALFLASH_IF_DFASZR_DASZ1         *((volatile unsigned char*)(0x42008004UL))
#define bFM4_DUALFLASH_IF_DFRWTR_DRWT0         *((volatile unsigned char*)(0x42008080UL))
#define bFM4_DUALFLASH_IF_DFRWTR_DRWT1         *((volatile unsigned char*)(0x42008084UL))
#define bFM4_DUALFLASH_IF_DFSTR_DFRDY          *((volatile unsigned char*)(0x42008100UL))
#define bFM4_DUALFLASH_IF_DFSTR_DFHNG          *((volatile unsigned char*)(0x42008104UL))
#define bFM4_DUALFLASH_IF_DFSTR_DFERR          *((volatile unsigned char*)(0x42008108UL))

/* Unique ID registers */
#define bFM4_UNIQUE_ID_UIDR0_UID0              *((volatile unsigned int*)(0x42004010UL))
#define bFM4_UNIQUE_ID_UIDR0_UID1              *((volatile unsigned int*)(0x42004014UL))
#define bFM4_UNIQUE_ID_UIDR0_UID2              *((volatile unsigned int*)(0x42004018UL))
#define bFM4_UNIQUE_ID_UIDR0_UID3              *((volatile unsigned int*)(0x4200401CUL))
#define bFM4_UNIQUE_ID_UIDR0_UID4              *((volatile unsigned int*)(0x42004020UL))
#define bFM4_UNIQUE_ID_UIDR0_UID5              *((volatile unsigned int*)(0x42004024UL))
#define bFM4_UNIQUE_ID_UIDR0_UID6              *((volatile unsigned int*)(0x42004028UL))
#define bFM4_UNIQUE_ID_UIDR0_UID7              *((volatile unsigned int*)(0x4200402CUL))
#define bFM4_UNIQUE_ID_UIDR0_UID8              *((volatile unsigned int*)(0x42004030UL))
#define bFM4_UNIQUE_ID_UIDR0_UID9              *((volatile unsigned int*)(0x42004034UL))
#define bFM4_UNIQUE_ID_UIDR0_UID10             *((volatile unsigned int*)(0x42004038UL))
#define bFM4_UNIQUE_ID_UIDR0_UID11             *((volatile unsigned int*)(0x4200403CUL))
#define bFM4_UNIQUE_ID_UIDR0_UID12             *((volatile unsigned int*)(0x42004040UL))
#define bFM4_UNIQUE_ID_UIDR0_UID13             *((volatile unsigned int*)(0x42004044UL))
#define bFM4_UNIQUE_ID_UIDR0_UID14             *((volatile unsigned int*)(0x42004048UL))
#define bFM4_UNIQUE_ID_UIDR0_UID15             *((volatile unsigned int*)(0x4200404CUL))
#define bFM4_UNIQUE_ID_UIDR0_UID16             *((volatile unsigned int*)(0x42004050UL))
#define bFM4_UNIQUE_ID_UIDR0_UID17             *((volatile unsigned int*)(0x42004054UL))
#define bFM4_UNIQUE_ID_UIDR0_UID18             *((volatile unsigned int*)(0x42004058UL))
#define bFM4_UNIQUE_ID_UIDR0_UID19             *((volatile unsigned int*)(0x4200405CUL))
#define bFM4_UNIQUE_ID_UIDR0_UID20             *((volatile unsigned int*)(0x42004060UL))
#define bFM4_UNIQUE_ID_UIDR0_UID21             *((volatile unsigned int*)(0x42004064UL))
#define bFM4_UNIQUE_ID_UIDR0_UID22             *((volatile unsigned int*)(0x42004068UL))
#define bFM4_UNIQUE_ID_UIDR0_UID23             *((volatile unsigned int*)(0x4200406CUL))
#define bFM4_UNIQUE_ID_UIDR0_UID24             *((volatile unsigned int*)(0x42004070UL))
#define bFM4_UNIQUE_ID_UIDR0_UID25             *((volatile unsigned int*)(0x42004074UL))
#define bFM4_UNIQUE_ID_UIDR0_UID26             *((volatile unsigned int*)(0x42004078UL))
#define bFM4_UNIQUE_ID_UIDR0_UID27             *((volatile unsigned int*)(0x4200407CUL))
#define bFM4_UNIQUE_ID_UIDR1_UID28             *((volatile unsigned int*)(0x42004080UL))
#define bFM4_UNIQUE_ID_UIDR1_UID29             *((volatile unsigned int*)(0x42004084UL))
#define bFM4_UNIQUE_ID_UIDR1_UID30             *((volatile unsigned int*)(0x42004088UL))
#define bFM4_UNIQUE_ID_UIDR1_UID31             *((volatile unsigned int*)(0x4200408CUL))
#define bFM4_UNIQUE_ID_UIDR1_UID32             *((volatile unsigned int*)(0x42004090UL))
#define bFM4_UNIQUE_ID_UIDR1_UID33             *((volatile unsigned int*)(0x42004094UL))
#define bFM4_UNIQUE_ID_UIDR1_UID34             *((volatile unsigned int*)(0x42004098UL))
#define bFM4_UNIQUE_ID_UIDR1_UID35             *((volatile unsigned int*)(0x4200409CUL))
#define bFM4_UNIQUE_ID_UIDR1_UID36             *((volatile unsigned int*)(0x420040A0UL))
#define bFM4_UNIQUE_ID_UIDR1_UID37             *((volatile unsigned int*)(0x420040A4UL))
#define bFM4_UNIQUE_ID_UIDR1_UID38             *((volatile unsigned int*)(0x420040A8UL))
#define bFM4_UNIQUE_ID_UIDR1_UID39             *((volatile unsigned int*)(0x420040ACUL))
#define bFM4_UNIQUE_ID_UIDR1_UID40             *((volatile unsigned int*)(0x420040B0UL))

