MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2C48J0AGB1000A/mcu.h
/* Multifunction Timer unit 1 Free Running Timer registers */
#define bFM4_MFT1_FRT_TCSA0_CLK0               *((volatile unsigned char*)(0x42422900UL))
#define bFM4_MFT1_FRT_TCSA0_CLK1               *((volatile unsigned char*)(0x42422904UL))
#define bFM4_MFT1_FRT_TCSA0_CLK2               *((volatile unsigned char*)(0x42422908UL))
#define bFM4_MFT1_FRT_TCSA0_CLK3               *((volatile unsigned char*)(0x4242290CUL))
#define bFM4_MFT1_FRT_TCSA0_SCLR               *((volatile unsigned char*)(0x42422910UL))
#define bFM4_MFT1_FRT_TCSA0_MODE               *((volatile unsigned char*)(0x42422914UL))
#define bFM4_MFT1_FRT_TCSA0_STOP               *((volatile unsigned char*)(0x42422918UL))
#define bFM4_MFT1_FRT_TCSA0_BFE                *((volatile unsigned char*)(0x4242291CUL))
#define bFM4_MFT1_FRT_TCSA0_ICRE               *((volatile unsigned char*)(0x42422920UL))
#define bFM4_MFT1_FRT_TCSA0_ICLR               *((volatile unsigned char*)(0x42422924UL))
#define bFM4_MFT1_FRT_TCSA0_IRQZE              *((volatile unsigned char*)(0x42422934UL))
#define bFM4_MFT1_FRT_TCSA0_IRQZF              *((volatile unsigned char*)(0x42422938UL))
#define bFM4_MFT1_FRT_TCSA0_ECKE               *((volatile unsigned char*)(0x4242293CUL))
#define bFM4_MFT1_FRT_TCSC0_MSZI0              *((volatile unsigned char*)(0x42422940UL))
#define bFM4_MFT1_FRT_TCSC0_MSZI1              *((volatile unsigned char*)(0x42422944UL))
#define bFM4_MFT1_FRT_TCSC0_MSZI2              *((volatile unsigned char*)(0x42422948UL))
#define bFM4_MFT1_FRT_TCSC0_MSZI3              *((volatile unsigned char*)(0x4242294CUL))
#define bFM4_MFT1_FRT_TCSC0_MSPI0              *((volatile unsigned char*)(0x42422950UL))
#define bFM4_MFT1_FRT_TCSC0_MSPI1              *((volatile unsigned char*)(0x42422954UL))
#define bFM4_MFT1_FRT_TCSC0_MSPI2              *((volatile unsigned char*)(0x42422958UL))
#define bFM4_MFT1_FRT_TCSC0_MSPI3              *((volatile unsigned char*)(0x4242295CUL))
#define bFM4_MFT1_FRT_TCSC0_MSZC0              *((volatile unsigned char*)(0x42422960UL))
#define bFM4_MFT1_FRT_TCSC0_MSZC1              *((volatile unsigned char*)(0x42422964UL))
#define bFM4_MFT1_FRT_TCSC0_MSZC2              *((volatile unsigned char*)(0x42422968UL))
#define bFM4_MFT1_FRT_TCSC0_MSZC3              *((volatile unsigned char*)(0x4242296CUL))
#define bFM4_MFT1_FRT_TCSC0_MSPC0              *((volatile unsigned char*)(0x42422970UL))
#define bFM4_MFT1_FRT_TCSC0_MSPC1              *((volatile unsigned char*)(0x42422974UL))
#define bFM4_MFT1_FRT_TCSC0_MSPC2              *((volatile unsigned char*)(0x42422978UL))
#define bFM4_MFT1_FRT_TCSC0_MSPC3              *((volatile unsigned char*)(0x4242297CUL))
#define bFM4_MFT1_FRT_TCSA1_CLK0               *((volatile unsigned char*)(0x42422A80UL))
#define bFM4_MFT1_FRT_TCSA1_CLK1               *((volatile unsigned char*)(0x42422A84UL))
#define bFM4_MFT1_FRT_TCSA1_CLK2               *((volatile unsigned char*)(0x42422A88UL))
#define bFM4_MFT1_FRT_TCSA1_CLK3               *((volatile unsigned char*)(0x42422A8CUL))
#define bFM4_MFT1_FRT_TCSA1_SCLR               *((volatile unsigned char*)(0x42422A90UL))
#define bFM4_MFT1_FRT_TCSA1_MODE               *((volatile unsigned char*)(0x42422A94UL))
#define bFM4_MFT1_FRT_TCSA1_STOP               *((volatile unsigned char*)(0x42422A98UL))
#define bFM4_MFT1_FRT_TCSA1_BFE                *((volatile unsigned char*)(0x42422A9CUL))
#define bFM4_MFT1_FRT_TCSA1_ICRE               *((volatile unsigned char*)(0x42422AA0UL))
#define bFM4_MFT1_FRT_TCSA1_ICLR               *((volatile unsigned char*)(0x42422AA4UL))
#define bFM4_MFT1_FRT_TCSA1_IRQZE              *((volatile unsigned char*)(0x42422AB4UL))
#define bFM4_MFT1_FRT_TCSA1_IRQZF              *((volatile unsigned char*)(0x42422AB8UL))
#define bFM4_MFT1_FRT_TCSA1_ECKE               *((volatile unsigned char*)(0x42422ABCUL))
#define bFM4_MFT1_FRT_TCSC1_MSZI0              *((volatile unsigned char*)(0x42422AC0UL))
#define bFM4_MFT1_FRT_TCSC1_MSZI1              *((volatile unsigned char*)(0x42422AC4UL))
#define bFM4_MFT1_FRT_TCSC1_MSZI2              *((volatile unsigned char*)(0x42422AC8UL))
#define bFM4_MFT1_FRT_TCSC1_MSZI3              *((volatile unsigned char*)(0x42422ACCUL))
#define bFM4_MFT1_FRT_TCSC1_MSPI0              *((volatile unsigned char*)(0x42422AD0UL))
#define bFM4_MFT1_FRT_TCSC1_MSPI1              *((volatile unsigned char*)(0x42422AD4UL))
#define bFM4_MFT1_FRT_TCSC1_MSPI2              *((volatile unsigned char*)(0x42422AD8UL))
#define bFM4_MFT1_FRT_TCSC1_MSPI3              *((volatile unsigned char*)(0x42422ADCUL))
#define bFM4_MFT1_FRT_TCSC1_MSZC0              *((volatile unsigned char*)(0x42422AE0UL))
#define bFM4_MFT1_FRT_TCSC1_MSZC1              *((volatile unsigned char*)(0x42422AE4UL))
#define bFM4_MFT1_FRT_TCSC1_MSZC2              *((volatile unsigned char*)(0x42422AE8UL))
#define bFM4_MFT1_FRT_TCSC1_MSZC3              *((volatile unsigned char*)(0x42422AECUL))
#define bFM4_MFT1_FRT_TCSC1_MSPC0              *((volatile unsigned char*)(0x42422AF0UL))
#define bFM4_MFT1_FRT_TCSC1_MSPC1              *((volatile unsigned char*)(0x42422AF4UL))
#define bFM4_MFT1_FRT_TCSC1_MSPC2              *((volatile unsigned char*)(0x42422AF8UL))
#define bFM4_MFT1_FRT_TCSC1_MSPC3              *((volatile unsigned char*)(0x42422AFCUL))
#define bFM4_MFT1_FRT_TCSA2_CLK0               *((volatile unsigned char*)(0x42422C00UL))
#define bFM4_MFT1_FRT_TCSA2_CLK1               *((volatile unsigned char*)(0x42422C04UL))
#define bFM4_MFT1_FRT_TCSA2_CLK2               *((volatile unsigned char*)(0x42422C08UL))
#define bFM4_MFT1_FRT_TCSA2_CLK3               *((volatile unsigned char*)(0x42422C0CUL))
#define bFM4_MFT1_FRT_TCSA2_SCLR               *((volatile unsigned char*)(0x42422C10UL))
#define bFM4_MFT1_FRT_TCSA2_MODE               *((volatile unsigned char*)(0x42422C14UL))
#define bFM4_MFT1_FRT_TCSA2_STOP               *((volatile unsigned char*)(0x42422C18UL))
#define bFM4_MFT1_FRT_TCSA2_BFE                *((volatile unsigned char*)(0x42422C1CUL))
#define bFM4_MFT1_FRT_TCSA2_ICRE               *((volatile unsigned char*)(0x42422C20UL))
#define bFM4_MFT1_FRT_TCSA2_ICLR               *((volatile unsigned char*)(0x42422C24UL))
#define bFM4_MFT1_FRT_TCSA2_IRQZE              *((volatile unsigned char*)(0x42422C34UL))
#define bFM4_MFT1_FRT_TCSA2_IRQZF              *((volatile unsigned char*)(0x42422C38UL))
#define bFM4_MFT1_FRT_TCSA2_ECKE               *((volatile unsigned char*)(0x42422C3CUL))
#define bFM4_MFT1_FRT_TCSC2_MSZI0              *((volatile unsigned char*)(0x42422C40UL))
#define bFM4_MFT1_FRT_TCSC2_MSZI1              *((volatile unsigned char*)(0x42422C44UL))
#define bFM4_MFT1_FRT_TCSC2_MSZI2              *((volatile unsigned char*)(0x42422C48UL))
#define bFM4_MFT1_FRT_TCSC2_MSZI3              *((volatile unsigned char*)(0x42422C4CUL))
#define bFM4_MFT1_FRT_TCSC2_MSPI0              *((volatile unsigned char*)(0x42422C50UL))
#define bFM4_MFT1_FRT_TCSC2_MSPI1              *((volatile unsigned char*)(0x42422C54UL))
#define bFM4_MFT1_FRT_TCSC2_MSPI2              *((volatile unsigned char*)(0x42422C58UL))
#define bFM4_MFT1_FRT_TCSC2_MSPI3              *((volatile unsigned char*)(0x42422C5CUL))
#define bFM4_MFT1_FRT_TCSC2_MSZC0              *((volatile unsigned char*)(0x42422C60UL))
#define bFM4_MFT1_FRT_TCSC2_MSZC1              *((volatile unsigned char*)(0x42422C64UL))
#define bFM4_MFT1_FRT_TCSC2_MSZC2              *((volatile unsigned char*)(0x42422C68UL))
#define bFM4_MFT1_FRT_TCSC2_MSZC3              *((volatile unsigned char*)(0x42422C6CUL))
#define bFM4_MFT1_FRT_TCSC2_MSPC0              *((volatile unsigned char*)(0x42422C70UL))
#define bFM4_MFT1_FRT_TCSC2_MSPC1              *((volatile unsigned char*)(0x42422C74UL))
#define bFM4_MFT1_FRT_TCSC2_MSPC2              *((volatile unsigned char*)(0x42422C78UL))
#define bFM4_MFT1_FRT_TCSC2_MSPC3              *((volatile unsigned char*)(0x42422C7CUL))
#define bFM4_MFT1_FRT_TCAL_STOP00              *((volatile unsigned char*)(0x42422C80UL))
#define bFM4_MFT1_FRT_TCAL_STOP01              *((volatile unsigned char*)(0x42422C84UL))
#define bFM4_MFT1_FRT_TCAL_STOP02              *((volatile unsigned char*)(0x42422C88UL))
#define bFM4_MFT1_FRT_TCAL_STOP10              *((volatile unsigned char*)(0x42422C8CUL))
#define bFM4_MFT1_FRT_TCAL_STOP11              *((volatile unsigned char*)(0x42422C90UL))
#define bFM4_MFT1_FRT_TCAL_STOP12              *((volatile unsigned char*)(0x42422C94UL))
#define bFM4_MFT1_FRT_TCAL_STOP20              *((volatile unsigned char*)(0x42422C98UL))
#define bFM4_MFT1_FRT_TCAL_STOP21              *((volatile unsigned char*)(0x42422C9CUL))
#define bFM4_MFT1_FRT_TCAL_STOP22              *((volatile unsigned char*)(0x42422CA0UL))
#define bFM4_MFT1_FRT_TCAL_SCLR00              *((volatile unsigned char*)(0x42422CC0UL))
#define bFM4_MFT1_FRT_TCAL_SCLR01              *((volatile unsigned char*)(0x42422CC4UL))
#define bFM4_MFT1_FRT_TCAL_SCLR02              *((volatile unsigned char*)(0x42422CC8UL))
#define bFM4_MFT1_FRT_TCAL_SCLR10              *((volatile unsigned char*)(0x42422CCCUL))
#define bFM4_MFT1_FRT_TCAL_SCLR11              *((volatile unsigned char*)(0x42422CD0UL))
#define bFM4_MFT1_FRT_TCAL_SCLR12              *((volatile unsigned char*)(0x42422CD4UL))
#define bFM4_MFT1_FRT_TCAL_SCLR20              *((volatile unsigned char*)(0x42422CD8UL))
#define bFM4_MFT1_FRT_TCAL_SCLR21              *((volatile unsigned char*)(0x42422CDCUL))
#define bFM4_MFT1_FRT_TCAL_SCLR22              *((volatile unsigned char*)(0x42422CE0UL))
#define bFM4_MFT1_FRT_TCSD_OFMD1               *((volatile unsigned char*)(0x42423D80UL))
#define bFM4_MFT1_FRT_TCSD_OFMD2               *((volatile unsigned char*)(0x42423D84UL))

/* Multifunction Timer unit 1 Output Compare Unit registers */
#define bFM4_MFT1_OCU_OCSA10_CST0              *((volatile unsigned char*)(0x42422300UL))
#define bFM4_MFT1_OCU_OCSA10_CST1              *((volatile unsigned char*)(0x42422304UL))
#define bFM4_MFT1_OCU_OCSA10_IOE0              *((volatile unsigned char*)(0x42422310UL))
#define bFM4_MFT1_OCU_OCSA10_IOE1              *((volatile unsigned char*)(0x42422314UL))
#define bFM4_MFT1_OCU_OCSA10_IOP0              *((volatile unsigned char*)(0x42422318UL))
#define bFM4_MFT1_OCU_OCSA10_IOP1              *((volatile unsigned char*)(0x4242231CUL))
#define bFM4_MFT1_OCU_OCSB10_OTD0              *((volatile unsigned char*)(0x42422320UL))
#define bFM4_MFT1_OCU_OCSB10_OTD1              *((volatile unsigned char*)(0x42422324UL))
#define bFM4_MFT1_OCU_OCSB10_CMOD              *((volatile unsigned char*)(0x42422330UL))
#define bFM4_MFT1_OCU_OCSB10_FM4               *((volatile unsigned char*)(0x4242233CUL))
#define bFM4_MFT1_OCU_OCSD10_OCCP0BUFE0        *((volatile unsigned char*)(0x42422340UL))
#define bFM4_MFT1_OCU_OCSD10_OCCP0BUFE1        *((volatile unsigned char*)(0x42422344UL))
#define bFM4_MFT1_OCU_OCSD10_OCCP1BUFE0        *((volatile unsigned char*)(0x42422348UL))
#define bFM4_MFT1_OCU_OCSD10_OCCP1BUFE1        *((volatile unsigned char*)(0x4242234CUL))
#define bFM4_MFT1_OCU_OCSD10_OCSE0BUFE0        *((volatile unsigned char*)(0x42422350UL))
#define bFM4_MFT1_OCU_OCSD10_OCSE0BUFE1        *((volatile unsigned char*)(0x42422354UL))
#define bFM4_MFT1_OCU_OCSD10_OCSE1BUFE0        *((volatile unsigned char*)(0x42422358UL))
#define bFM4_MFT1_OCU_OCSD10_OCSE1BUFE1        *((volatile unsigned char*)(0x4242235CUL))
#define bFM4_MFT1_OCU_OCSD10_OPBM0             *((volatile unsigned char*)(0x42422360UL))
#define bFM4_MFT1_OCU_OCSD10_OPBM1             *((volatile unsigned char*)(0x42422364UL))
#define bFM4_MFT1_OCU_OCSD10_OEBM0             *((volatile unsigned char*)(0x42422368UL))
#define bFM4_MFT1_OCU_OCSD10_OEBM1             *((volatile unsigned char*)(0x4242236CUL))
#define bFM4_MFT1_OCU_OCSD10_OFEX0             *((volatile unsigned char*)(0x42422370UL))
#define bFM4_MFT1_OCU_OCSD10_OFEX1             *((volatile unsigned char*)(0x42422374UL))
#define bFM4_MFT1_OCU_OCSA32_CST0              *((volatile unsigned char*)(0x42422380UL))
#define bFM4_MFT1_OCU_OCSA32_CST1              *((volatile unsigned char*)(0x42422384UL))
#define bFM4_MFT1_OCU_OCSA32_IOE0              *((volatile unsigned char*)(0x42422390UL))
#define bFM4_MFT1_OCU_OCSA32_IOE1              *((volatile unsigned char*)(0x42422394UL))
#define bFM4_MFT1_OCU_OCSA32_IOP0              *((volatile unsigned char*)(0x42422398UL))
#define bFM4_MFT1_OCU_OCSA32_IOP1              *((volatile unsigned char*)(0x4242239CUL))
#define bFM4_MFT1_OCU_OCSB32_OTD0              *((volatile unsigned char*)(0x424223A0UL))
#define bFM4_MFT1_OCU_OCSB32_OTD1              *((volatile unsigned char*)(0x424223A4UL))
#define bFM4_MFT1_OCU_OCSB32_CMOD              *((volatile unsigned char*)(0x424223B0UL))
#define bFM4_MFT1_OCU_OCSB32_FM4               *((volatile unsigned char*)(0x424223BCUL))
#define bFM4_MFT1_OCU_OCSD32_OCCP2BUFE0        *((volatile unsigned char*)(0x424223C0UL))
#define bFM4_MFT1_OCU_OCSD32_OCCP2BUFE1        *((volatile unsigned char*)(0x424223C4UL))
#define bFM4_MFT1_OCU_OCSD32_OCCP3BUFE0        *((volatile unsigned char*)(0x424223C8UL))
#define bFM4_MFT1_OCU_OCSD32_OCCP3BUFE1        *((volatile unsigned char*)(0x424223CCUL))
#define bFM4_MFT1_OCU_OCSD32_OCSE2BUFE0        *((volatile unsigned char*)(0x424223D0UL))
#define bFM4_MFT1_OCU_OCSD32_OCSE2BUFE1        *((volatile unsigned char*)(0x424223D4UL))
#define bFM4_MFT1_OCU_OCSD32_OCSE3BUFE0        *((volatile unsigned char*)(0x424223D8UL))
#define bFM4_MFT1_OCU_OCSD32_OCSE3BUFE1        *((volatile unsigned char*)(0x424223DCUL))
#define bFM4_MFT1_OCU_OCSD32_OPBM2             *((volatile unsigned char*)(0x424223E0UL))
#define bFM4_MFT1_OCU_OCSD32_OPBM3             *((volatile unsigned char*)(0x424223E4UL))
#define bFM4_MFT1_OCU_OCSD32_OEBM2             *((volatile unsigned char*)(0x424223E8UL))
#define bFM4_MFT1_OCU_OCSD32_OEBM3             *((volatile unsigned char*)(0x424223ECUL))
#define bFM4_MFT1_OCU_OCSD32_OFEX2             *((volatile unsigned char*)(0x424223F0UL))
#define bFM4_MFT1_OCU_OCSD32_OFEX3             *((volatile unsigned char*)(0x424223F4UL))
#define bFM4_MFT1_OCU_OCSA54_CST0              *((volatile unsigned char*)(0x42422400UL))
#define bFM4_MFT1_OCU_OCSA54_CST1              *((volatile unsigned char*)(0x42422404UL))
#define bFM4_MFT1_OCU_OCSA54_IOE0              *((volatile unsigned char*)(0x42422410UL))
#define bFM4_MFT1_OCU_OCSA54_IOE1              *((volatile unsigned char*)(0x42422414UL))
#define bFM4_MFT1_OCU_OCSA54_IOP0              *((volatile unsigned char*)(0x42422418UL))
#define bFM4_MFT1_OCU_OCSA54_IOP1              *((volatile unsigned char*)(0x4242241CUL))
#define bFM4_MFT1_OCU_OCSB54_OTD0              *((volatile unsigned char*)(0x42422420UL))
#define bFM4_MFT1_OCU_OCSB54_OTD1              *((volatile unsigned char*)(0x42422424UL))
#define bFM4_MFT1_OCU_OCSB54_CMOD              *((volatile unsigned char*)(0x42422430UL))
#define bFM4_MFT1_OCU_OCSB54_FM4               *((volatile unsigned char*)(0x4242243CUL))
#define bFM4_MFT1_OCU_OCSD54_OCCP4BUFE0        *((volatile unsigned char*)(0x42422440UL))
#define bFM4_MFT1_OCU_OCSD54_OCCP4BUFE1        *((volatile unsigned char*)(0x42422444UL))
#define bFM4_MFT1_OCU_OCSD54_OCCP5BUFE0        *((volatile unsigned char*)(0x42422448UL))
#define bFM4_MFT1_OCU_OCSD54_OCCP5BUFE1        *((volatile unsigned char*)(0x4242244CUL))
#define bFM4_MFT1_OCU_OCSD54_OCSE4BUFE0        *((volatile unsigned char*)(0x42422450UL))
#define bFM4_MFT1_OCU_OCSD54_OCSE4BUFE1        *((volatile unsigned char*)(0x42422454UL))
#define bFM4_MFT1_OCU_OCSD54_OCSE5BUFE0        *((volatile unsigned char*)(0x42422458UL))
#define bFM4_MFT1_OCU_OCSD54_OCSE5BUFE1        *((volatile unsigned char*)(0x4242245CUL))
#define bFM4_MFT1_OCU_OCSD54_OPBM4             *((volatile unsigned char*)(0x42422460UL))
#define bFM4_MFT1_OCU_OCSD54_OPBM5             *((volatile unsigned char*)(0x42422464UL))
#define bFM4_MFT1_OCU_OCSD54_OEBM4             *((volatile unsigned char*)(0x42422468UL))
#define bFM4_MFT1_OCU_OCSD54_OEBM5             *((volatile unsigned char*)(0x4242246CUL))
#define bFM4_MFT1_OCU_OCSD54_OFEX4             *((volatile unsigned char*)(0x42422470UL))
#define bFM4_MFT1_OCU_OCSD54_OFEX5             *((volatile unsigned char*)(0x42422474UL))
#define bFM4_MFT1_OCU_OCSC_MOD0                *((volatile unsigned char*)(0x424224A0UL))
#define bFM4_MFT1_OCU_OCSC_MOD1                *((volatile unsigned char*)(0x424224A4UL))
#define bFM4_MFT1_OCU_OCSC_MOD2                *((volatile unsigned char*)(0x424224A8UL))
#define bFM4_MFT1_OCU_OCSC_MOD3                *((volatile unsigned char*)(0x424224ACUL))
#define bFM4_MFT1_OCU_OCSC_MOD4                *((volatile unsigned char*)(0x424224B0UL))
#define bFM4_MFT1_OCU_OCSC_MOD5                *((volatile unsigned char*)(0x424224B4UL))
#define bFM4_MFT1_OCU_OCFS10_FSO00             *((volatile unsigned char*)(0x42422D00UL))
#define bFM4_MFT1_OCU_OCFS10_FSO01             *((volatile unsigned char*)(0x42422D04UL))
#define bFM4_MFT1_OCU_OCFS10_FSO02             *((volatile unsigned char*)(0x42422D08UL))
#define bFM4_MFT1_OCU_OCFS10_FSO03             *((volatile unsigned char*)(0x42422D0CUL))
#define bFM4_MFT1_OCU_OCFS10_FSO10             *((volatile unsigned char*)(0x42422D10UL))
#define bFM4_MFT1_OCU_OCFS10_FSO11             *((volatile unsigned char*)(0x42422D14UL))
#define bFM4_MFT1_OCU_OCFS10_FSO12             *((volatile unsigned char*)(0x42422D18UL))
#define bFM4_MFT1_OCU_OCFS10_FSO13             *((volatile unsigned char*)(0x42422D1CUL))
#define bFM4_MFT1_OCU_OCFS32_FSO00             *((volatile unsigned char*)(0x42422D20UL))
#define bFM4_MFT1_OCU_OCFS32_FSO01             *((volatile unsigned char*)(0x42422D24UL))
#define bFM4_MFT1_OCU_OCFS32_FSO02             *((volatile unsigned char*)(0x42422D28UL))
#define bFM4_MFT1_OCU_OCFS32_FSO03             *((volatile unsigned char*)(0x42422D2CUL))
#define bFM4_MFT1_OCU_OCFS32_FSO10             *((volatile unsigned char*)(0x42422D30UL))
#define bFM4_MFT1_OCU_OCFS32_FSO11             *((volatile unsigned char*)(0x42422D34UL))
#define bFM4_MFT1_OCU_OCFS32_FSO12             *((volatile unsigned char*)(0x42422D38UL))
#define bFM4_MFT1_OCU_OCFS32_FSO13             *((volatile unsigned char*)(0x42422D3CUL))
#define bFM4_MFT1_OCU_OCFS54_FSO00             *((volatile unsigned char*)(0x42422D40UL))
#define bFM4_MFT1_OCU_OCFS54_FSO01             *((volatile unsigned char*)(0x42422D44UL))
#define bFM4_MFT1_OCU_OCFS54_FSO02             *((volatile unsigned char*)(0x42422D48UL))
#define bFM4_MFT1_OCU_OCFS54_FSO03             *((volatile unsigned char*)(0x42422D4CUL))
#define bFM4_MFT1_OCU_OCFS54_FSO10             *((volatile unsigned char*)(0x42422D50UL))
#define bFM4_MFT1_OCU_OCFS54_FSO11             *((volatile unsigned char*)(0x42422D54UL))
#define bFM4_MFT1_OCU_OCFS54_FSO12             *((volatile unsigned char*)(0x42422D58UL))
#define bFM4_MFT1_OCU_OCFS54_FSO13             *((volatile unsigned char*)(0x42422D5CUL))

/* Multifunction Timer unit 1 Waveform Generator and Noise Canceler registers */
#define bFM4_MFT1_WFG_WFSA10_DCK0              *((volatile unsigned char*)(0x42423480UL))
#define bFM4_MFT1_WFG_WFSA10_DCK1              *((volatile unsigned char*)(0x42423484UL))
#define bFM4_MFT1_WFG_WFSA10_DCK2              *((volatile unsigned char*)(0x42423488UL))
#define bFM4_MFT1_WFG_WFSA10_GTEN0             *((volatile unsigned char*)(0x42423498UL))
#define bFM4_MFT1_WFG_WFSA10_GTEN1             *((volatile unsigned char*)(0x4242349CUL))
#define bFM4_MFT1_WFG_WFSA10_PSEL0             *((volatile unsigned char*)(0x424234A0UL))
#define bFM4_MFT1_WFG_WFSA10_PSEL1             *((volatile unsigned char*)(0x424234A4UL))
#define bFM4_MFT1_WFG_WFSA10_PGEN0             *((volatile unsigned char*)(0x424234A8UL))
#define bFM4_MFT1_WFG_WFSA10_PGEN1             *((volatile unsigned char*)(0x424234ACUL))
#define bFM4_MFT1_WFG_WFSA32_DCK0              *((volatile unsigned char*)(0x42423500UL))
#define bFM4_MFT1_WFG_WFSA32_DCK1              *((volatile unsigned char*)(0x42423504UL))
#define bFM4_MFT1_WFG_WFSA32_DCK2              *((volatile unsigned char*)(0x42423508UL))
#define bFM4_MFT1_WFG_WFSA32_GTEN0             *((volatile unsigned char*)(0x42423518UL))
#define bFM4_MFT1_WFG_WFSA32_GTEN1             *((volatile unsigned char*)(0x4242351CUL))
#define bFM4_MFT1_WFG_WFSA32_PSEL0             *((volatile unsigned char*)(0x42423520UL))
#define bFM4_MFT1_WFG_WFSA32_PSEL1             *((volatile unsigned char*)(0x42423524UL))
#define bFM4_MFT1_WFG_WFSA32_PGEN0             *((volatile unsigned char*)(0x42423528UL))
#define bFM4_MFT1_WFG_WFSA32_PGEN1             *((volatile unsigned char*)(0x4242352CUL))
#define bFM4_MFT1_WFG_WFSA54_DCK0              *((volatile unsigned char*)(0x42423580UL))
#define bFM4_MFT1_WFG_WFSA54_DCK1              *((volatile unsigned char*)(0x42423584UL))
#define bFM4_MFT1_WFG_WFSA54_DCK2              *((volatile unsigned char*)(0x42423588UL))
#define bFM4_MFT1_WFG_WFSA54_GTEN0             *((volatile unsigned char*)(0x42423598UL))
#define bFM4_MFT1_WFG_WFSA54_GTEN1             *((volatile unsigned char*)(0x4242359CUL))
#define bFM4_MFT1_WFG_WFSA54_PSEL0             *((volatile unsigned char*)(0x424235A0UL))
#define bFM4_MFT1_WFG_WFSA54_PSEL1             *((volatile unsigned char*)(0x424235A4UL))
#define bFM4_MFT1_WFG_WFSA54_PGEN0             *((volatile unsigned char*)(0x424235A8UL))
#define bFM4_MFT1_WFG_WFSA54_PGEN1             *((volatile unsigned char*)(0x424235ACUL))
#define bFM4_MFT1_WFG_WFIR_DTIFA               *((volatile unsigned char*)(0x42423600UL))
#define bFM4_MFT1_WFG_WFIR_DTICA               *((volatile unsigned char*)(0x42423604UL))
#define bFM4_MFT1_WFG_WFIR_DTIFB               *((volatile unsigned char*)(0x42423608UL))
#define bFM4_MFT1_WFG_WFIR_DTICB               *((volatile unsigned char*)(0x4242360CUL))
#define bFM4_MFT1_WFG_WFIR_TMIF10              *((volatile unsigned char*)(0x42423610UL))
#define bFM4_MFT1_WFG_WFIR_TMIC10              *((volatile unsigned char*)(0x42423614UL))
#define bFM4_MFT1_WFG_WFIR_TMIE10              *((volatile unsigned char*)(0x42423618UL))
#define bFM4_MFT1_WFG_WFIR_TMIS10              *((volatile unsigned char*)(0x4242361CUL))
#define bFM4_MFT1_WFG_WFIR_TMIF32              *((volatile unsigned char*)(0x42423620UL))
#define bFM4_MFT1_WFG_WFIR_TMIC32              *((volatile unsigned char*)(0x42423624UL))
#define bFM4_MFT1_WFG_WFIR_TMIE32              *((volatile unsigned char*)(0x42423628UL))
#define bFM4_MFT1_WFG_WFIR_TMIS32              *((volatile unsigned char*)(0x4242362CUL))
#define bFM4_MFT1_WFG_WFIR_TMIF54              *((volatile unsigned char*)(0x42423630UL))
#define bFM4_MFT1_WFG_WFIR_TMIC54              *((volatile unsigned char*)(0x42423634UL))
#define bFM4_MFT1_WFG_WFIR_TMIE54              *((volatile unsigned char*)(0x42423638UL))
#define bFM4_MFT1_WFG_WFIR_TMIS54              *((volatile unsigned char*)(0x4242363CUL))
#define bFM4_MFT1_WFG_NZCL_DTIEA               *((volatile unsigned char*)(0x42423680UL))
#define bFM4_MFT1_WFG_NZCL_NWS0                *((volatile unsigned char*)(0x42423684UL))
#define bFM4_MFT1_WFG_NZCL_NWS1                *((volatile unsigned char*)(0x42423688UL))
#define bFM4_MFT1_WFG_NZCL_NWS2                *((volatile unsigned char*)(0x4242368CUL))
#define bFM4_MFT1_WFG_NZCL_SDTI                *((volatile unsigned char*)(0x42423690UL))
#define bFM4_MFT1_WFG_NZCL_DTIEB               *((volatile unsigned char*)(0x42423694UL))
#define bFM4_MFT1_WFG_NZCL_DHOLD               *((volatile unsigned char*)(0x4242369CUL))
#define bFM4_MFT1_WFG_NZCL_DIMA                *((volatile unsigned char*)(0x424236A0UL))
#define bFM4_MFT1_WFG_NZCL_DIMB                *((volatile unsigned char*)(0x424236A4UL))
#define bFM4_MFT1_WFG_NZCL_WIM10               *((volatile unsigned char*)(0x424236B0UL))
#define bFM4_MFT1_WFG_NZCL_WIM32               *((volatile unsigned char*)(0x424236B4UL))
#define bFM4_MFT1_WFG_NZCL_WIM54               *((volatile unsigned char*)(0x424236B8UL))

