MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2C48J0AGB1000A/mcu.h
/* Base Timer 0 PWM registers */
#define bFM4_BT0_PWM_TMCR_STRG                 *((volatile unsigned char*)(0x424A0180UL))
#define bFM4_BT0_PWM_TMCR_CTEN                 *((volatile unsigned char*)(0x424A0184UL))
#define bFM4_BT0_PWM_TMCR_MDSE                 *((volatile unsigned char*)(0x424A0188UL))
#define bFM4_BT0_PWM_TMCR_OSEL                 *((volatile unsigned char*)(0x424A018CUL))
#define bFM4_BT0_PWM_TMCR_FMD0                 *((volatile unsigned char*)(0x424A0190UL))
#define bFM4_BT0_PWM_TMCR_FMD1                 *((volatile unsigned char*)(0x424A0194UL))
#define bFM4_BT0_PWM_TMCR_FMD2                 *((volatile unsigned char*)(0x424A0198UL))
#define bFM4_BT0_PWM_TMCR_EGS0                 *((volatile unsigned char*)(0x424A01A0UL))
#define bFM4_BT0_PWM_TMCR_EGS1                 *((volatile unsigned char*)(0x424A01A4UL))
#define bFM4_BT0_PWM_TMCR_PMSK                 *((volatile unsigned char*)(0x424A01A8UL))
#define bFM4_BT0_PWM_TMCR_RTGEN                *((volatile unsigned char*)(0x424A01ACUL))
#define bFM4_BT0_PWM_TMCR_CKS0                 *((volatile unsigned char*)(0x424A01B0UL))
#define bFM4_BT0_PWM_TMCR_CKS1                 *((volatile unsigned char*)(0x424A01B4UL))
#define bFM4_BT0_PWM_TMCR_CKS2                 *((volatile unsigned char*)(0x424A01B8UL))
#define bFM4_BT0_PWM_STC_UDIR                  *((volatile unsigned char*)(0x424A0200UL))
#define bFM4_BT0_PWM_STC_DTIR                  *((volatile unsigned char*)(0x424A0204UL))
#define bFM4_BT0_PWM_STC_TGIR                  *((volatile unsigned char*)(0x424A0208UL))
#define bFM4_BT0_PWM_STC_UDIE                  *((volatile unsigned char*)(0x424A0210UL))
#define bFM4_BT0_PWM_STC_DTIE                  *((volatile unsigned char*)(0x424A0214UL))
#define bFM4_BT0_PWM_STC_TGIE                  *((volatile unsigned char*)(0x424A0218UL))
#define bFM4_BT0_PWM_TMCR2_CKS3                *((volatile unsigned char*)(0x424A0220UL))

/* Base Timer 0 RT registers */
#define bFM4_BT0_RT_TMCR_STRG                  *((volatile unsigned char*)(0x424A0180UL))
#define bFM4_BT0_RT_TMCR_CTEN                  *((volatile unsigned char*)(0x424A0184UL))
#define bFM4_BT0_RT_TMCR_MDSE                  *((volatile unsigned char*)(0x424A0188UL))
#define bFM4_BT0_RT_TMCR_OSEL                  *((volatile unsigned char*)(0x424A018CUL))
#define bFM4_BT0_RT_TMCR_FMD0                  *((volatile unsigned char*)(0x424A0190UL))
#define bFM4_BT0_RT_TMCR_FMD1                  *((volatile unsigned char*)(0x424A0194UL))
#define bFM4_BT0_RT_TMCR_FMD2                  *((volatile unsigned char*)(0x424A0198UL))
#define bFM4_BT0_RT_TMCR_T32                   *((volatile unsigned char*)(0x424A019CUL))
#define bFM4_BT0_RT_TMCR_EGS0                  *((volatile unsigned char*)(0x424A01A0UL))
#define bFM4_BT0_RT_TMCR_EGS1                  *((volatile unsigned char*)(0x424A01A4UL))
#define bFM4_BT0_RT_TMCR_CKS0                  *((volatile unsigned char*)(0x424A01B0UL))
#define bFM4_BT0_RT_TMCR_CKS1                  *((volatile unsigned char*)(0x424A01B4UL))
#define bFM4_BT0_RT_TMCR_CKS2                  *((volatile unsigned char*)(0x424A01B8UL))
#define bFM4_BT0_RT_STC_UDIR                   *((volatile unsigned char*)(0x424A0200UL))
#define bFM4_BT0_RT_STC_TGIR                   *((volatile unsigned char*)(0x424A0208UL))
#define bFM4_BT0_RT_STC_UDIE                   *((volatile unsigned char*)(0x424A0210UL))
#define bFM4_BT0_RT_STC_TGIE                   *((volatile unsigned char*)(0x424A0218UL))
#define bFM4_BT0_RT_TMCR2_CKS3                 *((volatile unsigned char*)(0x424A0220UL))

/* Base Timer 0 PWC registers */
#define bFM4_BT0_PWC_TMCR_CTEN                 *((volatile unsigned char*)(0x424A0184UL))
#define bFM4_BT0_PWC_TMCR_MDSE                 *((volatile unsigned char*)(0x424A0188UL))
#define bFM4_BT0_PWC_TMCR_FMD0                 *((volatile unsigned char*)(0x424A0190UL))
#define bFM4_BT0_PWC_TMCR_FMD1                 *((volatile unsigned char*)(0x424A0194UL))
#define bFM4_BT0_PWC_TMCR_FMD2                 *((volatile unsigned char*)(0x424A0198UL))
#define bFM4_BT0_PWC_TMCR_T32                  *((volatile unsigned char*)(0x424A019CUL))
#define bFM4_BT0_PWC_TMCR_EGS0                 *((volatile unsigned char*)(0x424A01A0UL))
#define bFM4_BT0_PWC_TMCR_EGS1                 *((volatile unsigned char*)(0x424A01A4UL))
#define bFM4_BT0_PWC_TMCR_EGS2                 *((volatile unsigned char*)(0x424A01A8UL))
#define bFM4_BT0_PWC_TMCR_CKS0                 *((volatile unsigned char*)(0x424A01B0UL))
#define bFM4_BT0_PWC_TMCR_CKS1                 *((volatile unsigned char*)(0x424A01B4UL))
#define bFM4_BT0_PWC_TMCR_CKS2                 *((volatile unsigned char*)(0x424A01B8UL))
#define bFM4_BT0_PWC_STC_OVIR                  *((volatile unsigned char*)(0x424A0200UL))
#define bFM4_BT0_PWC_STC_EDIR                  *((volatile unsigned char*)(0x424A0208UL))
#define bFM4_BT0_PWC_STC_OVIE                  *((volatile unsigned char*)(0x424A0210UL))
#define bFM4_BT0_PWC_STC_EDIE                  *((volatile unsigned char*)(0x424A0218UL))
#define bFM4_BT0_PWC_STC_ERR                   *((volatile unsigned char*)(0x424A021CUL))
#define bFM4_BT0_PWC_TMCR2_CKS3                *((volatile unsigned char*)(0x424A0220UL))

/* Base Timer 1 PPG registers */
#define bFM4_BT1_PPG_TMCR_STRG                 *((volatile unsigned char*)(0x424A0980UL))
#define bFM4_BT1_PPG_TMCR_CTEN                 *((volatile unsigned char*)(0x424A0984UL))
#define bFM4_BT1_PPG_TMCR_MDSE                 *((volatile unsigned char*)(0x424A0988UL))
#define bFM4_BT1_PPG_TMCR_OSEL                 *((volatile unsigned char*)(0x424A098CUL))
#define bFM4_BT1_PPG_TMCR_FMD0                 *((volatile unsigned char*)(0x424A0990UL))
#define bFM4_BT1_PPG_TMCR_FMD1                 *((volatile unsigned char*)(0x424A0994UL))
#define bFM4_BT1_PPG_TMCR_FMD2                 *((volatile unsigned char*)(0x424A0998UL))
#define bFM4_BT1_PPG_TMCR_EGS0                 *((volatile unsigned char*)(0x424A09A0UL))
#define bFM4_BT1_PPG_TMCR_EGS1                 *((volatile unsigned char*)(0x424A09A4UL))
#define bFM4_BT1_PPG_TMCR_PMSK                 *((volatile unsigned char*)(0x424A09A8UL))
#define bFM4_BT1_PPG_TMCR_RTGEN                *((volatile unsigned char*)(0x424A09ACUL))
#define bFM4_BT1_PPG_TMCR_CKS0                 *((volatile unsigned char*)(0x424A09B0UL))
#define bFM4_BT1_PPG_TMCR_CKS1                 *((volatile unsigned char*)(0x424A09B4UL))
#define bFM4_BT1_PPG_TMCR_CKS2                 *((volatile unsigned char*)(0x424A09B8UL))
#define bFM4_BT1_PPG_STC_UDIR                  *((volatile unsigned char*)(0x424A0A00UL))
#define bFM4_BT1_PPG_STC_TGIR                  *((volatile unsigned char*)(0x424A0A08UL))
#define bFM4_BT1_PPG_STC_UDIE                  *((volatile unsigned char*)(0x424A0A10UL))
#define bFM4_BT1_PPG_STC_TGIE                  *((volatile unsigned char*)(0x424A0A18UL))
#define bFM4_BT1_PPG_TMCR2_CKS3                *((volatile unsigned char*)(0x424A0A20UL))

/* Base Timer 1 PWM registers */
#define bFM4_BT1_PWM_TMCR_STRG                 *((volatile unsigned char*)(0x424A0980UL))
#define bFM4_BT1_PWM_TMCR_CTEN                 *((volatile unsigned char*)(0x424A0984UL))
#define bFM4_BT1_PWM_TMCR_MDSE                 *((volatile unsigned char*)(0x424A0988UL))
#define bFM4_BT1_PWM_TMCR_OSEL                 *((volatile unsigned char*)(0x424A098CUL))
#define bFM4_BT1_PWM_TMCR_FMD0                 *((volatile unsigned char*)(0x424A0990UL))
#define bFM4_BT1_PWM_TMCR_FMD1                 *((volatile unsigned char*)(0x424A0994UL))
#define bFM4_BT1_PWM_TMCR_FMD2                 *((volatile unsigned char*)(0x424A0998UL))
#define bFM4_BT1_PWM_TMCR_EGS0                 *((volatile unsigned char*)(0x424A09A0UL))
#define bFM4_BT1_PWM_TMCR_EGS1                 *((volatile unsigned char*)(0x424A09A4UL))
#define bFM4_BT1_PWM_TMCR_PMSK                 *((volatile unsigned char*)(0x424A09A8UL))
#define bFM4_BT1_PWM_TMCR_RTGEN                *((volatile unsigned char*)(0x424A09ACUL))
#define bFM4_BT1_PWM_TMCR_CKS0                 *((volatile unsigned char*)(0x424A09B0UL))
#define bFM4_BT1_PWM_TMCR_CKS1                 *((volatile unsigned char*)(0x424A09B4UL))
#define bFM4_BT1_PWM_TMCR_CKS2                 *((volatile unsigned char*)(0x424A09B8UL))
#define bFM4_BT1_PWM_STC_UDIR                  *((volatile unsigned char*)(0x424A0A00UL))
#define bFM4_BT1_PWM_STC_DTIR                  *((volatile unsigned char*)(0x424A0A04UL))
#define bFM4_BT1_PWM_STC_TGIR                  *((volatile unsigned char*)(0x424A0A08UL))
#define bFM4_BT1_PWM_STC_UDIE                  *((volatile unsigned char*)(0x424A0A10UL))
#define bFM4_BT1_PWM_STC_DTIE                  *((volatile unsigned char*)(0x424A0A14UL))
#define bFM4_BT1_PWM_STC_TGIE                  *((volatile unsigned char*)(0x424A0A18UL))
#define bFM4_BT1_PWM_TMCR2_CKS3                *((volatile unsigned char*)(0x424A0A20UL))

