MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2C48J0AGB1000A/mcu.h
/* Base Timer 14 PWM registers */
#define bFM4_BT14_PWM_TMCR_STRG                *((volatile unsigned char*)(0x424AD180UL))
#define bFM4_BT14_PWM_TMCR_CTEN                *((volatile unsigned char*)(0x424AD184UL))
#define bFM4_BT14_PWM_TMCR_MDSE                *((volatile unsigned char*)(0x424AD188UL))
#define bFM4_BT14_PWM_TMCR_OSEL                *((volatile unsigned char*)(0x424AD18CUL))
#define bFM4_BT14_PWM_TMCR_EGS0                *((volatile unsigned char*)(0x424AD1A0UL))
#define bFM4_BT14_PWM_TMCR_EGS1                *((volatile unsigned char*)(0x424AD1A4UL))
#define bFM4_BT14_PWM_TMCR_PMSK                *((volatile unsigned char*)(0x424AD1A8UL))
#define bFM4_BT14_PWM_TMCR_RTGEN               *((volatile unsigned char*)(0x424AD1ACUL))
#define bFM4_BT14_PWM_TMCR_CKS0                *((volatile unsigned char*)(0x424AD1B0UL))
#define bFM4_BT14_PWM_TMCR_CKS1                *((volatile unsigned char*)(0x424AD1B4UL))
#define bFM4_BT14_PWM_TMCR_CKS2                *((volatile unsigned char*)(0x424AD1B8UL))
#define bFM4_BT14_PWM_STC_UDIR                 *((volatile unsigned char*)(0x424AD200UL))
#define bFM4_BT14_PWM_STC_DTIR                 *((volatile unsigned char*)(0x424AD204UL))
#define bFM4_BT14_PWM_STC_TGIR                 *((volatile unsigned char*)(0x424AD208UL))
#define bFM4_BT14_PWM_STC_UDIE                 *((volatile unsigned char*)(0x424AD210UL))
#define bFM4_BT14_PWM_STC_DTIE                 *((volatile unsigned char*)(0x424AD214UL))
#define bFM4_BT14_PWM_STC_TGIE                 *((volatile unsigned char*)(0x424AD218UL))
#define bFM4_BT14_PWM_TMCR2_CKS3               *((volatile unsigned char*)(0x424AD220UL))

/* Base Timer 14 RT registers */
#define bFM4_BT14_RT_TMCR_STRG                 *((volatile unsigned char*)(0x424AD180UL))
#define bFM4_BT14_RT_TMCR_CTEN                 *((volatile unsigned char*)(0x424AD184UL))
#define bFM4_BT14_RT_TMCR_MDSE                 *((volatile unsigned char*)(0x424AD188UL))
#define bFM4_BT14_RT_TMCR_OSEL                 *((volatile unsigned char*)(0x424AD18CUL))
#define bFM4_BT14_RT_TMCR_T32                  *((volatile unsigned char*)(0x424AD19CUL))
#define bFM4_BT14_RT_TMCR_EGS0                 *((volatile unsigned char*)(0x424AD1A0UL))
#define bFM4_BT14_RT_TMCR_EGS1                 *((volatile unsigned char*)(0x424AD1A4UL))
#define bFM4_BT14_RT_TMCR_CKS0                 *((volatile unsigned char*)(0x424AD1B0UL))
#define bFM4_BT14_RT_TMCR_CKS1                 *((volatile unsigned char*)(0x424AD1B4UL))
#define bFM4_BT14_RT_TMCR_CKS2                 *((volatile unsigned char*)(0x424AD1B8UL))
#define bFM4_BT14_RT_STC_UDIR                  *((volatile unsigned char*)(0x424AD200UL))
#define bFM4_BT14_RT_STC_TGIR                  *((volatile unsigned char*)(0x424AD208UL))
#define bFM4_BT14_RT_STC_UDIE                  *((volatile unsigned char*)(0x424AD210UL))
#define bFM4_BT14_RT_STC_TGIE                  *((volatile unsigned char*)(0x424AD218UL))
#define bFM4_BT14_RT_TMCR2_CKS3                *((volatile unsigned char*)(0x424AD220UL))

/* Base Timer 14 PWC registers */
#define bFM4_BT14_PWC_TMCR_CTEN                *((volatile unsigned char*)(0x424AD184UL))
#define bFM4_BT14_PWC_TMCR_MDSE                *((volatile unsigned char*)(0x424AD188UL))
#define bFM4_BT14_PWC_TMCR_T32                 *((volatile unsigned char*)(0x424AD19CUL))
#define bFM4_BT14_PWC_TMCR_EGS0                *((volatile unsigned char*)(0x424AD1A0UL))
#define bFM4_BT14_PWC_TMCR_EGS1                *((volatile unsigned char*)(0x424AD1A4UL))
#define bFM4_BT14_PWC_TMCR_EGS2                *((volatile unsigned char*)(0x424AD1A8UL))
#define bFM4_BT14_PWC_TMCR_CKS0                *((volatile unsigned char*)(0x424AD1B0UL))
#define bFM4_BT14_PWC_TMCR_CKS1                *((volatile unsigned char*)(0x424AD1B4UL))
#define bFM4_BT14_PWC_TMCR_CKS2                *((volatile unsigned char*)(0x424AD1B8UL))
#define bFM4_BT14_PWC_STC_OVIR                 *((volatile unsigned char*)(0x424AD200UL))
#define bFM4_BT14_PWC_STC_EDIR                 *((volatile unsigned char*)(0x424AD208UL))
#define bFM4_BT14_PWC_STC_OVIE                 *((volatile unsigned char*)(0x424AD210UL))
#define bFM4_BT14_PWC_STC_EDIE                 *((volatile unsigned char*)(0x424AD218UL))
#define bFM4_BT14_PWC_STC_ERR                  *((volatile unsigned char*)(0x424AD21CUL))
#define bFM4_BT14_PWC_TMCR2_CKS3               *((volatile unsigned char*)(0x424AD220UL))

/* Base Timer 15 PPG registers */
#define bFM4_BT15_PPG_TMCR_STRG                *((volatile unsigned char*)(0x424AD980UL))
#define bFM4_BT15_PPG_TMCR_CTEN                *((volatile unsigned char*)(0x424AD984UL))
#define bFM4_BT15_PPG_TMCR_MDSE                *((volatile unsigned char*)(0x424AD988UL))
#define bFM4_BT15_PPG_TMCR_OSEL                *((volatile unsigned char*)(0x424AD98CUL))
#define bFM4_BT15_PPG_TMCR_EGS0                *((volatile unsigned char*)(0x424AD9A0UL))
#define bFM4_BT15_PPG_TMCR_EGS1                *((volatile unsigned char*)(0x424AD9A4UL))
#define bFM4_BT15_PPG_TMCR_PMSK                *((volatile unsigned char*)(0x424AD9A8UL))
#define bFM4_BT15_PPG_TMCR_RTGEN               *((volatile unsigned char*)(0x424AD9ACUL))
#define bFM4_BT15_PPG_TMCR_CKS0                *((volatile unsigned char*)(0x424AD9B0UL))
#define bFM4_BT15_PPG_TMCR_CKS1                *((volatile unsigned char*)(0x424AD9B4UL))
#define bFM4_BT15_PPG_TMCR_CKS2                *((volatile unsigned char*)(0x424AD9B8UL))
#define bFM4_BT15_PPG_STC_UDIR                 *((volatile unsigned char*)(0x424ADA00UL))
#define bFM4_BT15_PPG_STC_TGIR                 *((volatile unsigned char*)(0x424ADA08UL))
#define bFM4_BT15_PPG_STC_UDIE                 *((volatile unsigned char*)(0x424ADA10UL))
#define bFM4_BT15_PPG_STC_TGIE                 *((volatile unsigned char*)(0x424ADA18UL))
#define bFM4_BT15_PPG_TMCR2_CKS3               *((volatile unsigned char*)(0x424ADA20UL))

/* Base Timer 15 PWM registers */
#define bFM4_BT15_PWM_TMCR_STRG                *((volatile unsigned char*)(0x424AD980UL))
#define bFM4_BT15_PWM_TMCR_CTEN                *((volatile unsigned char*)(0x424AD984UL))
#define bFM4_BT15_PWM_TMCR_MDSE                *((volatile unsigned char*)(0x424AD988UL))
#define bFM4_BT15_PWM_TMCR_OSEL                *((volatile unsigned char*)(0x424AD98CUL))
#define bFM4_BT15_PWM_TMCR_EGS0                *((volatile unsigned char*)(0x424AD9A0UL))
#define bFM4_BT15_PWM_TMCR_EGS1                *((volatile unsigned char*)(0x424AD9A4UL))
#define bFM4_BT15_PWM_TMCR_PMSK                *((volatile unsigned char*)(0x424AD9A8UL))
#define bFM4_BT15_PWM_TMCR_RTGEN               *((volatile unsigned char*)(0x424AD9ACUL))
#define bFM4_BT15_PWM_TMCR_CKS0                *((volatile unsigned char*)(0x424AD9B0UL))
#define bFM4_BT15_PWM_TMCR_CKS1                *((volatile unsigned char*)(0x424AD9B4UL))
#define bFM4_BT15_PWM_TMCR_CKS2                *((volatile unsigned char*)(0x424AD9B8UL))
#define bFM4_BT15_PWM_STC_UDIR                 *((volatile unsigned char*)(0x424ADA00UL))
#define bFM4_BT15_PWM_STC_DTIR                 *((volatile unsigned char*)(0x424ADA04UL))
#define bFM4_BT15_PWM_STC_TGIR                 *((volatile unsigned char*)(0x424ADA08UL))
#define bFM4_BT15_PWM_STC_UDIE                 *((volatile unsigned char*)(0x424ADA10UL))
#define bFM4_BT15_PWM_STC_DTIE                 *((volatile unsigned char*)(0x424ADA14UL))
#define bFM4_BT15_PWM_STC_TGIE                 *((volatile unsigned char*)(0x424ADA18UL))
#define bFM4_BT15_PWM_TMCR2_CKS3               *((volatile unsigned char*)(0x424ADA20UL))

/* Base Timer 15 RT registers */
#define bFM4_BT15_RT_TMCR_STRG                 *((volatile unsigned char*)(0x424AD980UL))
#define bFM4_BT15_RT_TMCR_CTEN                 *((volatile unsigned char*)(0x424AD984UL))
#define bFM4_BT15_RT_TMCR_MDSE                 *((volatile unsigned char*)(0x424AD988UL))
#define bFM4_BT15_RT_TMCR_OSEL                 *((volatile unsigned char*)(0x424AD98CUL))
#define bFM4_BT15_RT_TMCR_T32                  *((volatile unsigned char*)(0x424AD99CUL))
#define bFM4_BT15_RT_TMCR_EGS0                 *((volatile unsigned char*)(0x424AD9A0UL))
#define bFM4_BT15_RT_TMCR_EGS1                 *((volatile unsigned char*)(0x424AD9A4UL))
#define bFM4_BT15_RT_TMCR_CKS0                 *((volatile unsigned char*)(0x424AD9B0UL))
#define bFM4_BT15_RT_TMCR_CKS1                 *((volatile unsigned char*)(0x424AD9B4UL))
#define bFM4_BT15_RT_TMCR_CKS2                 *((volatile unsigned char*)(0x424AD9B8UL))
#define bFM4_BT15_RT_STC_UDIR                  *((volatile unsigned char*)(0x424ADA00UL))
#define bFM4_BT15_RT_STC_TGIR                  *((volatile unsigned char*)(0x424ADA08UL))
#define bFM4_BT15_RT_STC_UDIE                  *((volatile unsigned char*)(0x424ADA10UL))
#define bFM4_BT15_RT_STC_TGIE                  *((volatile unsigned char*)(0x424ADA18UL))
#define bFM4_BT15_RT_TMCR2_CKS3                *((volatile unsigned char*)(0x424ADA20UL))

/* Base Timer 15 PWC registers */
#define bFM4_BT15_PWC_TMCR_CTEN                *((volatile unsigned char*)(0x424AD984UL))
#define bFM4_BT15_PWC_TMCR_MDSE                *((volatile unsigned char*)(0x424AD988UL))
#define bFM4_BT15_PWC_TMCR_T32                 *((volatile unsigned char*)(0x424AD99CUL))
#define bFM4_BT15_PWC_TMCR_EGS0                *((volatile unsigned char*)(0x424AD9A0UL))
#define bFM4_BT15_PWC_TMCR_EGS1                *((volatile unsigned char*)(0x424AD9A4UL))
#define bFM4_BT15_PWC_TMCR_EGS2                *((volatile unsigned char*)(0x424AD9A8UL))
#define bFM4_BT15_PWC_TMCR_CKS0                *((volatile unsigned char*)(0x424AD9B0UL))
#define bFM4_BT15_PWC_TMCR_CKS1                *((volatile unsigned char*)(0x424AD9B4UL))
#define bFM4_BT15_PWC_TMCR_CKS2                *((volatile unsigned char*)(0x424AD9B8UL))
#define bFM4_BT15_PWC_STC_OVIR                 *((volatile unsigned char*)(0x424ADA00UL))
#define bFM4_BT15_PWC_STC_EDIR                 *((volatile unsigned char*)(0x424ADA08UL))
#define bFM4_BT15_PWC_STC_OVIE                 *((volatile unsigned char*)(0x424ADA10UL))
#define bFM4_BT15_PWC_STC_EDIE                 *((volatile unsigned char*)(0x424ADA18UL))
#define bFM4_BT15_PWC_STC_ERR                  *((volatile unsigned char*)(0x424ADA1CUL))
#define bFM4_BT15_PWC_TMCR2_CKS3               *((volatile unsigned char*)(0x424ADA20UL))

