MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2C48J0AGB1000A/mcu.h
#define bFM4_GPIO_EPFR10_UECS4E                *((volatile unsigned char*)(0x42DEC528UL))
#define bFM4_GPIO_EPFR10_UECS5E                *((volatile unsigned char*)(0x42DEC52CUL))
#define bFM4_GPIO_EPFR10_UECS6E                *((volatile unsigned char*)(0x42DEC530UL))
#define bFM4_GPIO_EPFR10_UECS7E                *((volatile unsigned char*)(0x42DEC534UL))
#define bFM4_GPIO_EPFR10_UEAOOE                *((volatile unsigned char*)(0x42DEC538UL))
#define bFM4_GPIO_EPFR10_UEA08E                *((volatile unsigned char*)(0x42DEC53CUL))
#define bFM4_GPIO_EPFR10_UEA09E                *((volatile unsigned char*)(0x42DEC540UL))
#define bFM4_GPIO_EPFR10_UEA10E                *((volatile unsigned char*)(0x42DEC544UL))
#define bFM4_GPIO_EPFR10_UEA11E                *((volatile unsigned char*)(0x42DEC548UL))
#define bFM4_GPIO_EPFR10_UEA12E                *((volatile unsigned char*)(0x42DEC54CUL))
#define bFM4_GPIO_EPFR10_UEA13E                *((volatile unsigned char*)(0x42DEC550UL))
#define bFM4_GPIO_EPFR10_UEA14E                *((volatile unsigned char*)(0x42DEC554UL))
#define bFM4_GPIO_EPFR10_UEA15E                *((volatile unsigned char*)(0x42DEC558UL))
#define bFM4_GPIO_EPFR10_UEA16E                *((volatile unsigned char*)(0x42DEC55CUL))
#define bFM4_GPIO_EPFR10_UEA17E                *((volatile unsigned char*)(0x42DEC560UL))
#define bFM4_GPIO_EPFR10_UEA18E                *((volatile unsigned char*)(0x42DEC564UL))
#define bFM4_GPIO_EPFR10_UEA19E                *((volatile unsigned char*)(0x42DEC568UL))
#define bFM4_GPIO_EPFR10_UEA20E                *((volatile unsigned char*)(0x42DEC56CUL))
#define bFM4_GPIO_EPFR10_UEA21E                *((volatile unsigned char*)(0x42DEC570UL))
#define bFM4_GPIO_EPFR10_UEA22E                *((volatile unsigned char*)(0x42DEC574UL))
#define bFM4_GPIO_EPFR10_UEA23E                *((volatile unsigned char*)(0x42DEC578UL))
#define bFM4_GPIO_EPFR10_UEA24E                *((volatile unsigned char*)(0x42DEC57CUL))
#define bFM4_GPIO_EPFR11_UEALEE                *((volatile unsigned char*)(0x42DEC580UL))
#define bFM4_GPIO_EPFR11_UECS0E                *((volatile unsigned char*)(0x42DEC584UL))
#define bFM4_GPIO_EPFR11_UEA01E                *((volatile unsigned char*)(0x42DEC588UL))
#define bFM4_GPIO_EPFR11_UEA02E                *((volatile unsigned char*)(0x42DEC58CUL))
#define bFM4_GPIO_EPFR11_UEA03E                *((volatile unsigned char*)(0x42DEC590UL))
#define bFM4_GPIO_EPFR11_UEA04E                *((volatile unsigned char*)(0x42DEC594UL))
#define bFM4_GPIO_EPFR11_UEA05E                *((volatile unsigned char*)(0x42DEC598UL))
#define bFM4_GPIO_EPFR11_UEA06E                *((volatile unsigned char*)(0x42DEC59CUL))
#define bFM4_GPIO_EPFR11_UEA07E                *((volatile unsigned char*)(0x42DEC5A0UL))
#define bFM4_GPIO_EPFR11_UED00B                *((volatile unsigned char*)(0x42DEC5A4UL))
#define bFM4_GPIO_EPFR11_UED01B                *((volatile unsigned char*)(0x42DEC5A8UL))
#define bFM4_GPIO_EPFR11_UED02B                *((volatile unsigned char*)(0x42DEC5ACUL))
#define bFM4_GPIO_EPFR11_UED03B                *((volatile unsigned char*)(0x42DEC5B0UL))
#define bFM4_GPIO_EPFR11_UED04B                *((volatile unsigned char*)(0x42DEC5B4UL))
#define bFM4_GPIO_EPFR11_UED05B                *((volatile unsigned char*)(0x42DEC5B8UL))
#define bFM4_GPIO_EPFR11_UED06B                *((volatile unsigned char*)(0x42DEC5BCUL))
#define bFM4_GPIO_EPFR11_UED07B                *((volatile unsigned char*)(0x42DEC5C0UL))
#define bFM4_GPIO_EPFR11_UED08B                *((volatile unsigned char*)(0x42DEC5C4UL))
#define bFM4_GPIO_EPFR11_UED09B                *((volatile unsigned char*)(0x42DEC5C8UL))
#define bFM4_GPIO_EPFR11_UED10B                *((volatile unsigned char*)(0x42DEC5CCUL))
#define bFM4_GPIO_EPFR11_UED11B                *((volatile unsigned char*)(0x42DEC5D0UL))
#define bFM4_GPIO_EPFR11_UED12B                *((volatile unsigned char*)(0x42DEC5D4UL))
#define bFM4_GPIO_EPFR11_UED13B                *((volatile unsigned char*)(0x42DEC5D8UL))
#define bFM4_GPIO_EPFR11_UED14B                *((volatile unsigned char*)(0x42DEC5DCUL))
#define bFM4_GPIO_EPFR11_UED15B                *((volatile unsigned char*)(0x42DEC5E0UL))
#define bFM4_GPIO_EPFR11_UERLC                 *((volatile unsigned char*)(0x42DEC5E4UL))
#define bFM4_GPIO_EPFR12_TIOA8E0               *((volatile unsigned char*)(0x42DEC608UL))
#define bFM4_GPIO_EPFR12_TIOA8E1               *((volatile unsigned char*)(0x42DEC60CUL))
#define bFM4_GPIO_EPFR12_TIOB8S0               *((volatile unsigned char*)(0x42DEC610UL))
#define bFM4_GPIO_EPFR12_TIOB8S1               *((volatile unsigned char*)(0x42DEC614UL))
#define bFM4_GPIO_EPFR12_TIOA9S0               *((volatile unsigned char*)(0x42DEC620UL))
#define bFM4_GPIO_EPFR12_TIOA9S1               *((volatile unsigned char*)(0x42DEC624UL))
#define bFM4_GPIO_EPFR12_TIOA9E0               *((volatile unsigned char*)(0x42DEC628UL))
#define bFM4_GPIO_EPFR12_TIOA9E1               *((volatile unsigned char*)(0x42DEC62CUL))
#define bFM4_GPIO_EPFR12_TIOB9S0               *((volatile unsigned char*)(0x42DEC630UL))
#define bFM4_GPIO_EPFR12_TIOB9S1               *((volatile unsigned char*)(0x42DEC634UL))
#define bFM4_GPIO_EPFR12_TIOA10E0              *((volatile unsigned char*)(0x42DEC648UL))
#define bFM4_GPIO_EPFR12_TIOA10E1              *((volatile unsigned char*)(0x42DEC64CUL))
#define bFM4_GPIO_EPFR12_TIOB10S0              *((volatile unsigned char*)(0x42DEC650UL))
#define bFM4_GPIO_EPFR12_TIOB10S1              *((volatile unsigned char*)(0x42DEC654UL))
#define bFM4_GPIO_EPFR12_TIOA11S0              *((volatile unsigned char*)(0x42DEC660UL))
#define bFM4_GPIO_EPFR12_TIOA11S1              *((volatile unsigned char*)(0x42DEC664UL))
#define bFM4_GPIO_EPFR12_TIOA11E0              *((volatile unsigned char*)(0x42DEC668UL))
#define bFM4_GPIO_EPFR12_TIOA11E1              *((volatile unsigned char*)(0x42DEC66CUL))
#define bFM4_GPIO_EPFR12_TIOB11S0              *((volatile unsigned char*)(0x42DEC670UL))
#define bFM4_GPIO_EPFR12_TIOB11S1              *((volatile unsigned char*)(0x42DEC674UL))
#define bFM4_GPIO_EPFR13_TIOA12E0              *((volatile unsigned char*)(0x42DEC688UL))
#define bFM4_GPIO_EPFR13_TIOA12E1              *((volatile unsigned char*)(0x42DEC68CUL))
#define bFM4_GPIO_EPFR13_TIOB12S0              *((volatile unsigned char*)(0x42DEC690UL))
#define bFM4_GPIO_EPFR13_TIOB12S1              *((volatile unsigned char*)(0x42DEC694UL))
#define bFM4_GPIO_EPFR13_TIOA13S0              *((volatile unsigned char*)(0x42DEC6A0UL))
#define bFM4_GPIO_EPFR13_TIOA13S1              *((volatile unsigned char*)(0x42DEC6A4UL))
#define bFM4_GPIO_EPFR13_TIOA13E0              *((volatile unsigned char*)(0x42DEC6A8UL))
#define bFM4_GPIO_EPFR13_TIOA13E1              *((volatile unsigned char*)(0x42DEC6ACUL))
#define bFM4_GPIO_EPFR13_TIOB13S0              *((volatile unsigned char*)(0x42DEC6B0UL))
#define bFM4_GPIO_EPFR13_TIOB13S1              *((volatile unsigned char*)(0x42DEC6B4UL))
#define bFM4_GPIO_EPFR13_TIOA14E0              *((volatile unsigned char*)(0x42DEC6C8UL))
#define bFM4_GPIO_EPFR13_TIOA14E1              *((volatile unsigned char*)(0x42DEC6CCUL))
#define bFM4_GPIO_EPFR13_TIOB14S0              *((volatile unsigned char*)(0x42DEC6D0UL))
#define bFM4_GPIO_EPFR13_TIOB14S1              *((volatile unsigned char*)(0x42DEC6D4UL))
#define bFM4_GPIO_EPFR13_TIOA15S0              *((volatile unsigned char*)(0x42DEC6E0UL))
#define bFM4_GPIO_EPFR13_TIOA15S1              *((volatile unsigned char*)(0x42DEC6E4UL))
#define bFM4_GPIO_EPFR13_TIOA15E0              *((volatile unsigned char*)(0x42DEC6E8UL))
#define bFM4_GPIO_EPFR13_TIOA15E1              *((volatile unsigned char*)(0x42DEC6ECUL))
#define bFM4_GPIO_EPFR13_TIOB15S0              *((volatile unsigned char*)(0x42DEC6F0UL))
#define bFM4_GPIO_EPFR13_TIOB15S1              *((volatile unsigned char*)(0x42DEC6F4UL))
#define bFM4_GPIO_EPFR14_QAIN2S0               *((volatile unsigned char*)(0x42DEC700UL))
#define bFM4_GPIO_EPFR14_QAIN2S1               *((volatile unsigned char*)(0x42DEC704UL))
#define bFM4_GPIO_EPFR14_QBIN2S0               *((volatile unsigned char*)(0x42DEC708UL))
#define bFM4_GPIO_EPFR14_QBIN2S1               *((volatile unsigned char*)(0x42DEC70CUL))
#define bFM4_GPIO_EPFR14_QZIN2S0               *((volatile unsigned char*)(0x42DEC710UL))
#define bFM4_GPIO_EPFR14_QZIN2S1               *((volatile unsigned char*)(0x42DEC714UL))
#define bFM4_GPIO_EPFR15_EINT16S0              *((volatile unsigned char*)(0x42DEC780UL))
#define bFM4_GPIO_EPFR15_EINT16S1              *((volatile unsigned char*)(0x42DEC784UL))
#define bFM4_GPIO_EPFR15_EINT17S0              *((volatile unsigned char*)(0x42DEC788UL))
#define bFM4_GPIO_EPFR15_EINT17S1              *((volatile unsigned char*)(0x42DEC78CUL))
#define bFM4_GPIO_EPFR15_EINT18S0              *((volatile unsigned char*)(0x42DEC790UL))
#define bFM4_GPIO_EPFR15_EINT18S1              *((volatile unsigned char*)(0x42DEC794UL))
#define bFM4_GPIO_EPFR15_EINT19S0              *((volatile unsigned char*)(0x42DEC798UL))
#define bFM4_GPIO_EPFR15_EINT19S1              *((volatile unsigned char*)(0x42DEC79CUL))
#define bFM4_GPIO_EPFR15_EINT20S0              *((volatile unsigned char*)(0x42DEC7A0UL))
#define bFM4_GPIO_EPFR15_EINT20S1              *((volatile unsigned char*)(0x42DEC7A4UL))
#define bFM4_GPIO_EPFR15_EINT21S0              *((volatile unsigned char*)(0x42DEC7A8UL))
#define bFM4_GPIO_EPFR15_EINT21S1              *((volatile unsigned char*)(0x42DEC7ACUL))
#define bFM4_GPIO_EPFR15_EINT22S0              *((volatile unsigned char*)(0x42DEC7B0UL))
#define bFM4_GPIO_EPFR15_EINT22S1              *((volatile unsigned char*)(0x42DEC7B4UL))
#define bFM4_GPIO_EPFR15_EINT23S0              *((volatile unsigned char*)(0x42DEC7B8UL))
#define bFM4_GPIO_EPFR15_EINT23S1              *((volatile unsigned char*)(0x42DEC7BCUL))
#define bFM4_GPIO_EPFR15_EINT24S0              *((volatile unsigned char*)(0x42DEC7C0UL))
#define bFM4_GPIO_EPFR15_EINT24S1              *((volatile unsigned char*)(0x42DEC7C4UL))
#define bFM4_GPIO_EPFR15_EINT25S0              *((volatile unsigned char*)(0x42DEC7C8UL))
#define bFM4_GPIO_EPFR15_EINT25S1              *((volatile unsigned char*)(0x42DEC7CCUL))
#define bFM4_GPIO_EPFR15_EINT26S0              *((volatile unsigned char*)(0x42DEC7D0UL))
#define bFM4_GPIO_EPFR15_EINT26S1              *((volatile unsigned char*)(0x42DEC7D4UL))
#define bFM4_GPIO_EPFR15_EINT27S0              *((volatile unsigned char*)(0x42DEC7D8UL))
#define bFM4_GPIO_EPFR15_EINT27S1              *((volatile unsigned char*)(0x42DEC7DCUL))
#define bFM4_GPIO_EPFR15_EINT28S0              *((volatile unsigned char*)(0x42DEC7E0UL))
#define bFM4_GPIO_EPFR15_EINT28S1              *((volatile unsigned char*)(0x42DEC7E4UL))
#define bFM4_GPIO_EPFR15_EINT29S0              *((volatile unsigned char*)(0x42DEC7E8UL))
#define bFM4_GPIO_EPFR15_EINT29S1              *((volatile unsigned char*)(0x42DEC7ECUL))
#define bFM4_GPIO_EPFR15_EINT30S0              *((volatile unsigned char*)(0x42DEC7F0UL))
#define bFM4_GPIO_EPFR15_EINT30S1              *((volatile unsigned char*)(0x42DEC7F4UL))
#define bFM4_GPIO_EPFR15_EINT31S0              *((volatile unsigned char*)(0x42DEC7F8UL))
#define bFM4_GPIO_EPFR15_EINT31S1              *((volatile unsigned char*)(0x42DEC7FCUL))
#define bFM4_GPIO_EPFR16_SCS6B0                *((volatile unsigned char*)(0x42DEC800UL))
#define bFM4_GPIO_EPFR16_SCS6B1                *((volatile unsigned char*)(0x42DEC804UL))
#define bFM4_GPIO_EPFR16_SCS7B0                *((volatile unsigned char*)(0x42DEC808UL))
#define bFM4_GPIO_EPFR16_SCS7B1                *((volatile unsigned char*)(0x42DEC80CUL))
#define bFM4_GPIO_EPFR16_SIN8S0                *((volatile unsigned char*)(0x42DEC810UL))
#define bFM4_GPIO_EPFR16_SIN8S1                *((volatile unsigned char*)(0x42DEC814UL))
#define bFM4_GPIO_EPFR16_SOT8B0                *((volatile unsigned char*)(0x42DEC818UL))
#define bFM4_GPIO_EPFR16_SOT8B1                *((volatile unsigned char*)(0x42DEC81CUL))
#define bFM4_GPIO_EPFR16_SCK8B0                *((volatile unsigned char*)(0x42DEC820UL))
#define bFM4_GPIO_EPFR16_SCK8B1                *((volatile unsigned char*)(0x42DEC824UL))
#define bFM4_GPIO_EPFR16_SIN9S0                *((volatile unsigned char*)(0x42DEC828UL))
#define bFM4_GPIO_EPFR16_SIN9S1                *((volatile unsigned char*)(0x42DEC82CUL))
#define bFM4_GPIO_EPFR16_SOT9B0                *((volatile unsigned char*)(0x42DEC830UL))
#define bFM4_GPIO_EPFR16_SOT9B1                *((volatile unsigned char*)(0x42DEC834UL))
#define bFM4_GPIO_EPFR16_SCK9B0                *((volatile unsigned char*)(0x42DEC838UL))
#define bFM4_GPIO_EPFR16_SCK9B1                *((volatile unsigned char*)(0x42DEC83CUL))
#define bFM4_GPIO_EPFR16_SIN10S0               *((volatile unsigned char*)(0x42DEC840UL))
#define bFM4_GPIO_EPFR16_SIN10S1               *((volatile unsigned char*)(0x42DEC844UL))
#define bFM4_GPIO_EPFR16_SOT10B0               *((volatile unsigned char*)(0x42DEC848UL))
#define bFM4_GPIO_EPFR16_SOT10B1               *((volatile unsigned char*)(0x42DEC84CUL))
#define bFM4_GPIO_EPFR16_SCK10B0               *((volatile unsigned char*)(0x42DEC850UL))
#define bFM4_GPIO_EPFR16_SCK10B1               *((volatile unsigned char*)(0x42DEC854UL))
#define bFM4_GPIO_EPFR16_SIN11S0               *((volatile unsigned char*)(0x42DEC858UL))
#define bFM4_GPIO_EPFR16_SIN11S1               *((volatile unsigned char*)(0x42DEC85CUL))
#define bFM4_GPIO_EPFR16_SOT11B0               *((volatile unsigned char*)(0x42DEC860UL))
#define bFM4_GPIO_EPFR16_SOT11B1               *((volatile unsigned char*)(0x42DEC864UL))
#define bFM4_GPIO_EPFR16_SCK11B0               *((volatile unsigned char*)(0x42DEC868UL))
#define bFM4_GPIO_EPFR16_SCK11B1               *((volatile unsigned char*)(0x42DEC86CUL))
#define bFM4_GPIO_EPFR16_SFMPAC                *((volatile unsigned char*)(0x42DEC870UL))
#define bFM4_GPIO_EPFR16_SFMPBC                *((volatile unsigned char*)(0x42DEC874UL))
#define bFM4_GPIO_EPFR17_SIN12S0               *((volatile unsigned char*)(0x42DEC890UL))
#define bFM4_GPIO_EPFR17_SIN12S1               *((volatile unsigned char*)(0x42DEC894UL))
#define bFM4_GPIO_EPFR17_SOT12B0               *((volatile unsigned char*)(0x42DEC898UL))
#define bFM4_GPIO_EPFR17_SOT12B1               *((volatile unsigned char*)(0x42DEC89CUL))
#define bFM4_GPIO_EPFR17_SCK12B0               *((volatile unsigned char*)(0x42DEC8A0UL))
#define bFM4_GPIO_EPFR17_SCK12B1               *((volatile unsigned char*)(0x42DEC8A4UL))
#define bFM4_GPIO_EPFR17_SIN13S0               *((volatile unsigned char*)(0x42DEC8A8UL))
#define bFM4_GPIO_EPFR17_SIN13S1               *((volatile unsigned char*)(0x42DEC8ACUL))
#define bFM4_GPIO_EPFR17_SOT13B0               *((volatile unsigned char*)(0x42DEC8B0UL))
#define bFM4_GPIO_EPFR17_SOT13B1               *((volatile unsigned char*)(0x42DEC8B4UL))
#define bFM4_GPIO_EPFR17_SCK13B0               *((volatile unsigned char*)(0x42DEC8B8UL))
#define bFM4_GPIO_EPFR17_SCK13B1               *((volatile unsigned char*)(0x42DEC8BCUL))
#define bFM4_GPIO_EPFR17_SIN14S0               *((volatile unsigned char*)(0x42DEC8C0UL))
#define bFM4_GPIO_EPFR17_SIN14S1               *((volatile unsigned char*)(0x42DEC8C4UL))
#define bFM4_GPIO_EPFR17_SOT14B0               *((volatile unsigned char*)(0x42DEC8C8UL))
#define bFM4_GPIO_EPFR17_SOT14B1               *((volatile unsigned char*)(0x42DEC8CCUL))
#define bFM4_GPIO_EPFR17_SCK14B0               *((volatile unsigned char*)(0x42DEC8D0UL))
#define bFM4_GPIO_EPFR17_SCK14B1               *((volatile unsigned char*)(0x42DEC8D4UL))
#define bFM4_GPIO_EPFR17_SIN15S0               *((volatile unsigned char*)(0x42DEC8D8UL))
#define bFM4_GPIO_EPFR17_SIN15S1               *((volatile unsigned char*)(0x42DEC8DCUL))
#define bFM4_GPIO_EPFR17_SOT15B0               *((volatile unsigned char*)(0x42DEC8E0UL))
#define bFM4_GPIO_EPFR17_SOT15B1               *((volatile unsigned char*)(0x42DEC8E4UL))
#define bFM4_GPIO_EPFR17_SCK15B0               *((volatile unsigned char*)(0x42DEC8E8UL))
#define bFM4_GPIO_EPFR17_SCK15B1               *((volatile unsigned char*)(0x42DEC8ECUL))
#define bFM4_GPIO_EPFR18_CECR0B0               *((volatile unsigned char*)(0x42DEC900UL))
#define bFM4_GPIO_EPFR18_CECR0B1               *((volatile unsigned char*)(0x42DEC904UL))
#define bFM4_GPIO_EPFR18_CECR1B0               *((volatile unsigned char*)(0x42DEC908UL))
#define bFM4_GPIO_EPFR18_CECR1B1               *((volatile unsigned char*)(0x42DEC90CUL))
#define bFM4_GPIO_EPFR18_QAIN3S0               *((volatile unsigned char*)(0x42DEC910UL))
#define bFM4_GPIO_EPFR18_QAIN3S1               *((volatile unsigned char*)(0x42DEC914UL))
#define bFM4_GPIO_EPFR18_QBIN3S0               *((volatile unsigned char*)(0x42DEC918UL))
#define bFM4_GPIO_EPFR18_QBIN3S1               *((volatile unsigned char*)(0x42DEC91CUL))
#define bFM4_GPIO_EPFR18_QZIN3S0               *((volatile unsigned char*)(0x42DEC920UL))
#define bFM4_GPIO_EPFR18_QZIN3S1               *((volatile unsigned char*)(0x42DEC924UL))
#define bFM4_GPIO_EPFR18_SDCLKE0               *((volatile unsigned char*)(0x42DEC938UL))
#define bFM4_GPIO_EPFR18_SDCLKE1               *((volatile unsigned char*)(0x42DEC93CUL))
#define bFM4_GPIO_EPFR18_SDCMDB0               *((volatile unsigned char*)(0x42DEC940UL))
#define bFM4_GPIO_EPFR18_SDCMDB1               *((volatile unsigned char*)(0x42DEC944UL))
#define bFM4_GPIO_EPFR18_SDDATA0B0             *((volatile unsigned char*)(0x42DEC948UL))
#define bFM4_GPIO_EPFR18_SDDATA0B1             *((volatile unsigned char*)(0x42DEC94CUL))
#define bFM4_GPIO_EPFR18_SDDATA1B0             *((volatile unsigned char*)(0x42DEC950UL))
#define bFM4_GPIO_EPFR18_SDDATA1B1             *((volatile unsigned char*)(0x42DEC954UL))
#define bFM4_GPIO_EPFR18_SDDATA2B0             *((volatile unsigned char*)(0x42DEC958UL))
#define bFM4_GPIO_EPFR18_SDDATA2B1             *((volatile unsigned char*)(0x42DEC95CUL))
#define bFM4_GPIO_EPFR18_SDDATA3B0             *((volatile unsigned char*)(0x42DEC960UL))
#define bFM4_GPIO_EPFR18_SDDATA3B1             *((volatile unsigned char*)(0x42DEC964UL))
#define bFM4_GPIO_EPFR18_SDCDS0                *((volatile unsigned char*)(0x42DEC968UL))
#define bFM4_GPIO_EPFR18_SDCDS1                *((volatile unsigned char*)(0x42DEC96CUL))
#define bFM4_GPIO_EPFR18_SDWPS0                *((volatile unsigned char*)(0x42DEC970UL))
#define bFM4_GPIO_EPFR18_SDWPS1                *((volatile unsigned char*)(0x42DEC974UL))
#define bFM4_GPIO_EPFR20_UESMCKE               *((volatile unsigned char*)(0x42DECA00UL))
#define bFM4_GPIO_EPFR20_UESMCEE               *((volatile unsigned char*)(0x42DECA04UL))
#define bFM4_GPIO_EPFR20_UERASE                *((volatile unsigned char*)(0x42DECA08UL))
#define bFM4_GPIO_EPFR20_UECASE                *((volatile unsigned char*)(0x42DECA0CUL))
#define bFM4_GPIO_EPFR20_UEDWEXE               *((volatile unsigned char*)(0x42DECA10UL))
#define bFM4_GPIO_EPFR20_UECSXE                *((volatile unsigned char*)(0x42DECA14UL))
#define bFM4_GPIO_EPFR20_UEDQM2E               *((volatile unsigned char*)(0x42DECA18UL))
#define bFM4_GPIO_EPFR20_UEDQM3E               *((volatile unsigned char*)(0x42DECA1CUL))
#define bFM4_GPIO_EPFR20_UEDTHHB               *((volatile unsigned char*)(0x42DECA20UL))
#define bFM4_GPIO_EPFR20_UED16B                *((volatile unsigned char*)(0x42DECA24UL))
#define bFM4_GPIO_EPFR20_UED17B                *((volatile unsigned char*)(0x42DECA28UL))
#define bFM4_GPIO_EPFR20_UED18B                *((volatile unsigned char*)(0x42DECA2CUL))
#define bFM4_GPIO_EPFR20_UED19B                *((volatile unsigned char*)(0x42DECA30UL))
#define bFM4_GPIO_EPFR20_UED20B                *((volatile unsigned char*)(0x42DECA34UL))
#define bFM4_GPIO_EPFR20_UED21B                *((volatile unsigned char*)(0x42DECA38UL))
#define bFM4_GPIO_EPFR20_UED22B                *((volatile unsigned char*)(0x42DECA3CUL))
#define bFM4_GPIO_EPFR20_UED23B                *((volatile unsigned char*)(0x42DECA40UL))
#define bFM4_GPIO_EPFR20_UED24B                *((volatile unsigned char*)(0x42DECA44UL))
#define bFM4_GPIO_EPFR20_UED25B                *((volatile unsigned char*)(0x42DECA48UL))
#define bFM4_GPIO_EPFR20_UED26B                *((volatile unsigned char*)(0x42DECA4CUL))
#define bFM4_GPIO_EPFR20_UED27B                *((volatile unsigned char*)(0x42DECA50UL))
#define bFM4_GPIO_EPFR20_UED28B                *((volatile unsigned char*)(0x42DECA54UL))
#define bFM4_GPIO_EPFR20_UED29B                *((volatile unsigned char*)(0x42DECA58UL))
#define bFM4_GPIO_EPFR20_UED30B                *((volatile unsigned char*)(0x42DECA5CUL))
#define bFM4_GPIO_EPFR20_UED31B                *((volatile unsigned char*)(0x42DECA60UL))
#define bFM4_GPIO_EPFR23_SCS60E0               *((volatile unsigned char*)(0x42DECB80UL))
#define bFM4_GPIO_EPFR23_SCS60E1               *((volatile unsigned char*)(0x42DECB84UL))
#define bFM4_GPIO_EPFR23_SCS61E0               *((volatile unsigned char*)(0x42DECB88UL))
#define bFM4_GPIO_EPFR23_SCS61E1               *((volatile unsigned char*)(0x42DECB8CUL))
#define bFM4_GPIO_EPFR23_SCS62E0               *((volatile unsigned char*)(0x42DECB90UL))
#define bFM4_GPIO_EPFR23_SCS62E1               *((volatile unsigned char*)(0x42DECB94UL))
#define bFM4_GPIO_EPFR23_SCS63E0               *((volatile unsigned char*)(0x42DECB98UL))
#define bFM4_GPIO_EPFR23_SCS63E1               *((volatile unsigned char*)(0x42DECB9CUL))
#define bFM4_GPIO_EPFR23_SCS70E0               *((volatile unsigned char*)(0x42DECBA0UL))
#define bFM4_GPIO_EPFR23_SCS70E1               *((volatile unsigned char*)(0x42DECBA4UL))
#define bFM4_GPIO_EPFR23_SCS71E0               *((volatile unsigned char*)(0x42DECBA8UL))
#define bFM4_GPIO_EPFR23_SCS71E1               *((volatile unsigned char*)(0x42DECBACUL))
#define bFM4_GPIO_EPFR23_SCS72E0               *((volatile unsigned char*)(0x42DECBB0UL))
#define bFM4_GPIO_EPFR23_SCS72E1               *((volatile unsigned char*)(0x42DECBB4UL))
#define bFM4_GPIO_EPFR23_SCS73E0               *((volatile unsigned char*)(0x42DECBB8UL))
#define bFM4_GPIO_EPFR23_SCS73E1               *((volatile unsigned char*)(0x42DECBBCUL))
#define bFM4_GPIO_EPFR24_I2SM4_MCLK0S0         *((volatile unsigned char*)(0x42DECC00UL))
#define bFM4_GPIO_EPFR24_I2SM4_MCLK0S1         *((volatile unsigned char*)(0x42DECC04UL))
#define bFM4_GPIO_EPFR24_I2SM4_MCLK0E0         *((volatile unsigned char*)(0x42DECC08UL))
#define bFM4_GPIO_EPFR24_I2SM4_MCLK0E1         *((volatile unsigned char*)(0x42DECC0CUL))
#define bFM4_GPIO_EPFR24_I2SM4_SCK0B0          *((volatile unsigned char*)(0x42DECC10UL))
#define bFM4_GPIO_EPFR24_I2SM4_SCK0B1          *((volatile unsigned char*)(0x42DECC14UL))
#define bFM4_GPIO_EPFR24_I2SM4_WS0B0           *((volatile unsigned char*)(0x42DECC18UL))
#define bFM4_GPIO_EPFR24_I2SM4_WS0B1           *((volatile unsigned char*)(0x42DECC1CUL))
#define bFM4_GPIO_EPFR24_I2SM4_SDI0S0          *((volatile unsigned char*)(0x42DECC20UL))
#define bFM4_GPIO_EPFR24_I2SM4_SDI0S1          *((volatile unsigned char*)(0x42DECC24UL))
#define bFM4_GPIO_EPFR24_I2SM4_SDO0E0          *((volatile unsigned char*)(0x42DECC28UL))
#define bFM4_GPIO_EPFR24_I2SM4_SDO0E1          *((volatile unsigned char*)(0x42DECC2CUL))
#define bFM4_GPIO_EPFR25_MCRX2S0               *((volatile unsigned char*)(0x42DECC80UL))
#define bFM4_GPIO_EPFR25_MCRX2S1               *((volatile unsigned char*)(0x42DECC84UL))
#define bFM4_GPIO_EPFR25_MCTX2E0               *((volatile unsigned char*)(0x42DECC88UL))
#define bFM4_GPIO_EPFR25_MCTX2E1               *((volatile unsigned char*)(0x42DECC8CUL))
#define bFM4_GPIO_EPFR26_Q_SCKE0               *((volatile unsigned char*)(0x42DECD00UL))
#define bFM4_GPIO_EPFR26_Q_SCKE1               *((volatile unsigned char*)(0x42DECD04UL))
#define bFM4_GPIO_EPFR26_Q_CS0E0               *((volatile unsigned char*)(0x42DECD08UL))
