MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2C48J0AGB1000A/mcu.h
/* MFS CSIO channel 7 registers */
#define bFM4_MFS7_CSIO_SMR_SOE                 *((volatile unsigned char*)(0x4270E000UL))
#define bFM4_MFS7_CSIO_SMR_SCKE                *((volatile unsigned char*)(0x4270E004UL))
#define bFM4_MFS7_CSIO_SMR_BDS                 *((volatile unsigned char*)(0x4270E008UL))
#define bFM4_MFS7_CSIO_SMR_SCINV               *((volatile unsigned char*)(0x4270E00CUL))
#define bFM4_MFS7_CSIO_SMR_MD0                 *((volatile unsigned char*)(0x4270E014UL))
#define bFM4_MFS7_CSIO_SMR_MD1                 *((volatile unsigned char*)(0x4270E018UL))
#define bFM4_MFS7_CSIO_SMR_MD2                 *((volatile unsigned char*)(0x4270E01CUL))
#define bFM4_MFS7_CSIO_SCR_TXE                 *((volatile unsigned char*)(0x4270E020UL))
#define bFM4_MFS7_CSIO_SCR_RXE                 *((volatile unsigned char*)(0x4270E024UL))
#define bFM4_MFS7_CSIO_SCR_TBIE                *((volatile unsigned char*)(0x4270E028UL))
#define bFM4_MFS7_CSIO_SCR_TIE                 *((volatile unsigned char*)(0x4270E02CUL))
#define bFM4_MFS7_CSIO_SCR_RIE                 *((volatile unsigned char*)(0x4270E030UL))
#define bFM4_MFS7_CSIO_SCR_SPI                 *((volatile unsigned char*)(0x4270E034UL))
#define bFM4_MFS7_CSIO_SCR_MS                  *((volatile unsigned char*)(0x4270E038UL))
#define bFM4_MFS7_CSIO_SCR_UPCL                *((volatile unsigned char*)(0x4270E03CUL))
#define bFM4_MFS7_CSIO_ESCR_L0                 *((volatile unsigned char*)(0x4270E080UL))
#define bFM4_MFS7_CSIO_ESCR_L1                 *((volatile unsigned char*)(0x4270E084UL))
#define bFM4_MFS7_CSIO_ESCR_L2                 *((volatile unsigned char*)(0x4270E088UL))
#define bFM4_MFS7_CSIO_ESCR_WT0                *((volatile unsigned char*)(0x4270E08CUL))
#define bFM4_MFS7_CSIO_ESCR_WT1                *((volatile unsigned char*)(0x4270E090UL))
#define bFM4_MFS7_CSIO_ESCR_CSFE               *((volatile unsigned char*)(0x4270E094UL))
#define bFM4_MFS7_CSIO_ESCR_L3                 *((volatile unsigned char*)(0x4270E098UL))
#define bFM4_MFS7_CSIO_ESCR_SOP                *((volatile unsigned char*)(0x4270E09CUL))
#define bFM4_MFS7_CSIO_SSR_TBI                 *((volatile unsigned char*)(0x4270E0A0UL))
#define bFM4_MFS7_CSIO_SSR_TDRE                *((volatile unsigned char*)(0x4270E0A4UL))
#define bFM4_MFS7_CSIO_SSR_RDRF                *((volatile unsigned char*)(0x4270E0A8UL))
#define bFM4_MFS7_CSIO_SSR_ORE                 *((volatile unsigned char*)(0x4270E0ACUL))
#define bFM4_MFS7_CSIO_SSR_AWC                 *((volatile unsigned char*)(0x4270E0B0UL))
#define bFM4_MFS7_CSIO_SSR_REC                 *((volatile unsigned char*)(0x4270E0BCUL))
#define bFM4_MFS7_CSIO_FCR_FE1                 *((volatile unsigned char*)(0x4270E280UL))
#define bFM4_MFS7_CSIO_FCR_FE2                 *((volatile unsigned char*)(0x4270E284UL))
#define bFM4_MFS7_CSIO_FCR_FCL1                *((volatile unsigned char*)(0x4270E288UL))
#define bFM4_MFS7_CSIO_FCR_FCL2                *((volatile unsigned char*)(0x4270E28CUL))
#define bFM4_MFS7_CSIO_FCR_FSET                *((volatile unsigned char*)(0x4270E290UL))
#define bFM4_MFS7_CSIO_FCR_FLD                 *((volatile unsigned char*)(0x4270E294UL))
#define bFM4_MFS7_CSIO_FCR_FLST                *((volatile unsigned char*)(0x4270E298UL))
#define bFM4_MFS7_CSIO_FCR_FSEL                *((volatile unsigned char*)(0x4270E2A0UL))
#define bFM4_MFS7_CSIO_FCR_FTIE                *((volatile unsigned char*)(0x4270E2A4UL))
#define bFM4_MFS7_CSIO_FCR_FDRQ                *((volatile unsigned char*)(0x4270E2A8UL))
#define bFM4_MFS7_CSIO_FCR_FRIIE               *((volatile unsigned char*)(0x4270E2ACUL))
#define bFM4_MFS7_CSIO_FCR_FLSTE               *((volatile unsigned char*)(0x4270E2B0UL))
#define bFM4_MFS7_CSIO_FCR0_FE1                *((volatile unsigned char*)(0x4270E280UL))
#define bFM4_MFS7_CSIO_FCR0_FE2                *((volatile unsigned char*)(0x4270E284UL))
#define bFM4_MFS7_CSIO_FCR0_FCL1               *((volatile unsigned char*)(0x4270E288UL))
#define bFM4_MFS7_CSIO_FCR0_FCL2               *((volatile unsigned char*)(0x4270E28CUL))
#define bFM4_MFS7_CSIO_FCR0_FSET               *((volatile unsigned char*)(0x4270E290UL))
#define bFM4_MFS7_CSIO_FCR0_FLD                *((volatile unsigned char*)(0x4270E294UL))
#define bFM4_MFS7_CSIO_FCR0_FLST               *((volatile unsigned char*)(0x4270E298UL))
#define bFM4_MFS7_CSIO_FCR1_FSEL               *((volatile unsigned char*)(0x4270E2A0UL))
#define bFM4_MFS7_CSIO_FCR1_FTIE               *((volatile unsigned char*)(0x4270E2A4UL))
#define bFM4_MFS7_CSIO_FCR1_FDRQ               *((volatile unsigned char*)(0x4270E2A8UL))
#define bFM4_MFS7_CSIO_FCR1_FRIIE              *((volatile unsigned char*)(0x4270E2ACUL))
#define bFM4_MFS7_CSIO_FCR1_FLSTE              *((volatile unsigned char*)(0x4270E2B0UL))
#define bFM4_MFS7_CSIO_FBYTE_FD0               *((volatile unsigned char*)(0x4270E300UL))
#define bFM4_MFS7_CSIO_FBYTE_FD1               *((volatile unsigned char*)(0x4270E304UL))
#define bFM4_MFS7_CSIO_FBYTE_FD2               *((volatile unsigned char*)(0x4270E308UL))
#define bFM4_MFS7_CSIO_FBYTE_FD3               *((volatile unsigned char*)(0x4270E30CUL))
#define bFM4_MFS7_CSIO_FBYTE_FD4               *((volatile unsigned char*)(0x4270E310UL))
#define bFM4_MFS7_CSIO_FBYTE_FD5               *((volatile unsigned char*)(0x4270E314UL))
#define bFM4_MFS7_CSIO_FBYTE_FD6               *((volatile unsigned char*)(0x4270E318UL))
#define bFM4_MFS7_CSIO_FBYTE_FD7               *((volatile unsigned char*)(0x4270E31CUL))
#define bFM4_MFS7_CSIO_FBYTE_FD8               *((volatile unsigned char*)(0x4270E320UL))
#define bFM4_MFS7_CSIO_FBYTE_FD9               *((volatile unsigned char*)(0x4270E324UL))
#define bFM4_MFS7_CSIO_FBYTE_FD10              *((volatile unsigned char*)(0x4270E328UL))
#define bFM4_MFS7_CSIO_FBYTE_FD11              *((volatile unsigned char*)(0x4270E32CUL))
#define bFM4_MFS7_CSIO_FBYTE_FD12              *((volatile unsigned char*)(0x4270E330UL))
#define bFM4_MFS7_CSIO_FBYTE_FD13              *((volatile unsigned char*)(0x4270E334UL))
#define bFM4_MFS7_CSIO_FBYTE_FD14              *((volatile unsigned char*)(0x4270E338UL))
#define bFM4_MFS7_CSIO_FBYTE_FD15              *((volatile unsigned char*)(0x4270E33CUL))
#define bFM4_MFS7_CSIO_FBYTE1_FD0              *((volatile unsigned char*)(0x4270E300UL))
#define bFM4_MFS7_CSIO_FBYTE1_FD1              *((volatile unsigned char*)(0x4270E304UL))
#define bFM4_MFS7_CSIO_FBYTE1_FD2              *((volatile unsigned char*)(0x4270E308UL))
#define bFM4_MFS7_CSIO_FBYTE1_FD3              *((volatile unsigned char*)(0x4270E30CUL))
#define bFM4_MFS7_CSIO_FBYTE1_FD4              *((volatile unsigned char*)(0x4270E310UL))
#define bFM4_MFS7_CSIO_FBYTE1_FD5              *((volatile unsigned char*)(0x4270E314UL))
#define bFM4_MFS7_CSIO_FBYTE1_FD6              *((volatile unsigned char*)(0x4270E318UL))
#define bFM4_MFS7_CSIO_FBYTE1_FD7              *((volatile unsigned char*)(0x4270E31CUL))
#define bFM4_MFS7_CSIO_FBYTE2_FD8              *((volatile unsigned char*)(0x4270E320UL))
#define bFM4_MFS7_CSIO_FBYTE2_FD9              *((volatile unsigned char*)(0x4270E324UL))
#define bFM4_MFS7_CSIO_FBYTE2_FD10             *((volatile unsigned char*)(0x4270E328UL))
#define bFM4_MFS7_CSIO_FBYTE2_FD11             *((volatile unsigned char*)(0x4270E32CUL))
#define bFM4_MFS7_CSIO_FBYTE2_FD12             *((volatile unsigned char*)(0x4270E330UL))
#define bFM4_MFS7_CSIO_FBYTE2_FD13             *((volatile unsigned char*)(0x4270E334UL))
#define bFM4_MFS7_CSIO_FBYTE2_FD14             *((volatile unsigned char*)(0x4270E338UL))
#define bFM4_MFS7_CSIO_FBYTE2_FD15             *((volatile unsigned char*)(0x4270E33CUL))
#define bFM4_MFS7_CSIO_SCSTR10_CSHD0           *((volatile unsigned char*)(0x4270E380UL))
#define bFM4_MFS7_CSIO_SCSTR10_CSHD1           *((volatile unsigned char*)(0x4270E384UL))
#define bFM4_MFS7_CSIO_SCSTR10_CSHD2           *((volatile unsigned char*)(0x4270E388UL))
#define bFM4_MFS7_CSIO_SCSTR10_CSHD3           *((volatile unsigned char*)(0x4270E38CUL))
#define bFM4_MFS7_CSIO_SCSTR10_CSHD4           *((volatile unsigned char*)(0x4270E390UL))
#define bFM4_MFS7_CSIO_SCSTR10_CSHD5           *((volatile unsigned char*)(0x4270E394UL))
#define bFM4_MFS7_CSIO_SCSTR10_CSHD6           *((volatile unsigned char*)(0x4270E398UL))
#define bFM4_MFS7_CSIO_SCSTR10_CSHD7           *((volatile unsigned char*)(0x4270E39CUL))
#define bFM4_MFS7_CSIO_SCSTR10_CSSU0           *((volatile unsigned char*)(0x4270E3A0UL))
#define bFM4_MFS7_CSIO_SCSTR10_CSSU1           *((volatile unsigned char*)(0x4270E3A4UL))
#define bFM4_MFS7_CSIO_SCSTR10_CSSU2           *((volatile unsigned char*)(0x4270E3A8UL))
#define bFM4_MFS7_CSIO_SCSTR10_CSSU3           *((volatile unsigned char*)(0x4270E3ACUL))
#define bFM4_MFS7_CSIO_SCSTR10_CSSU4           *((volatile unsigned char*)(0x4270E3B0UL))
#define bFM4_MFS7_CSIO_SCSTR10_CSSU5           *((volatile unsigned char*)(0x4270E3B4UL))
#define bFM4_MFS7_CSIO_SCSTR10_CSSU6           *((volatile unsigned char*)(0x4270E3B8UL))
#define bFM4_MFS7_CSIO_SCSTR10_CSSU7           *((volatile unsigned char*)(0x4270E3BCUL))
#define bFM4_MFS7_CSIO_SCSTR32_CSDS0           *((volatile unsigned char*)(0x4270E400UL))
#define bFM4_MFS7_CSIO_SCSTR32_CSDS1           *((volatile unsigned char*)(0x4270E404UL))
#define bFM4_MFS7_CSIO_SCSTR32_CSDS2           *((volatile unsigned char*)(0x4270E408UL))
#define bFM4_MFS7_CSIO_SCSTR32_CSDS3           *((volatile unsigned char*)(0x4270E40CUL))
#define bFM4_MFS7_CSIO_SCSTR32_CSDS4           *((volatile unsigned char*)(0x4270E410UL))
#define bFM4_MFS7_CSIO_SCSTR32_CSDS5           *((volatile unsigned char*)(0x4270E414UL))
#define bFM4_MFS7_CSIO_SCSTR32_CSDS6           *((volatile unsigned char*)(0x4270E418UL))
#define bFM4_MFS7_CSIO_SCSTR32_CSDS7           *((volatile unsigned char*)(0x4270E41CUL))
#define bFM4_MFS7_CSIO_SCSTR32_CSDS8           *((volatile unsigned char*)(0x4270E420UL))
#define bFM4_MFS7_CSIO_SCSTR32_CSDS9           *((volatile unsigned char*)(0x4270E424UL))
#define bFM4_MFS7_CSIO_SCSTR32_CSDS10          *((volatile unsigned char*)(0x4270E428UL))
#define bFM4_MFS7_CSIO_SCSTR32_CSDS11          *((volatile unsigned char*)(0x4270E42CUL))
#define bFM4_MFS7_CSIO_SCSTR32_CSDS12          *((volatile unsigned char*)(0x4270E430UL))
#define bFM4_MFS7_CSIO_SCSTR32_CSDS13          *((volatile unsigned char*)(0x4270E434UL))
#define bFM4_MFS7_CSIO_SCSTR32_CSDS14          *((volatile unsigned char*)(0x4270E438UL))
#define bFM4_MFS7_CSIO_SCSTR32_CSDS15          *((volatile unsigned char*)(0x4270E43CUL))
#define bFM4_MFS7_CSIO_SACSR_TMRE              *((volatile unsigned char*)(0x4270E480UL))
#define bFM4_MFS7_CSIO_SACSR_TDIV0             *((volatile unsigned char*)(0x4270E484UL))
#define bFM4_MFS7_CSIO_SACSR_TDIV1             *((volatile unsigned char*)(0x4270E488UL))
#define bFM4_MFS7_CSIO_SACSR_TDIV2             *((volatile unsigned char*)(0x4270E48CUL))
#define bFM4_MFS7_CSIO_SACSR_TDIV3             *((volatile unsigned char*)(0x4270E490UL))
#define bFM4_MFS7_CSIO_SACSR_TSYNE             *((volatile unsigned char*)(0x4270E498UL))
#define bFM4_MFS7_CSIO_SACSR_TINTE             *((volatile unsigned char*)(0x4270E49CUL))
#define bFM4_MFS7_CSIO_SACSR_TINT              *((volatile unsigned char*)(0x4270E4A0UL))
#define bFM4_MFS7_CSIO_SACSR_CSE               *((volatile unsigned char*)(0x4270E4ACUL))
#define bFM4_MFS7_CSIO_SACSR_CSEIE             *((volatile unsigned char*)(0x4270E4B0UL))
#define bFM4_MFS7_CSIO_SACSR_TBEEN             *((volatile unsigned char*)(0x4270E4B4UL))
#define bFM4_MFS7_CSIO_STMR_TM0                *((volatile unsigned char*)(0x4270E500UL))
#define bFM4_MFS7_CSIO_STMR_TM1                *((volatile unsigned char*)(0x4270E504UL))
#define bFM4_MFS7_CSIO_STMR_TM2                *((volatile unsigned char*)(0x4270E508UL))
#define bFM4_MFS7_CSIO_STMR_TM3                *((volatile unsigned char*)(0x4270E50CUL))
#define bFM4_MFS7_CSIO_STMR_TM4                *((volatile unsigned char*)(0x4270E510UL))
#define bFM4_MFS7_CSIO_STMR_TM5                *((volatile unsigned char*)(0x4270E514UL))
#define bFM4_MFS7_CSIO_STMR_TM6                *((volatile unsigned char*)(0x4270E518UL))
#define bFM4_MFS7_CSIO_STMR_TM7                *((volatile unsigned char*)(0x4270E51CUL))
#define bFM4_MFS7_CSIO_STMR_TM8                *((volatile unsigned char*)(0x4270E520UL))
#define bFM4_MFS7_CSIO_STMR_TM9                *((volatile unsigned char*)(0x4270E524UL))
#define bFM4_MFS7_CSIO_STMR_TM10               *((volatile unsigned char*)(0x4270E528UL))
#define bFM4_MFS7_CSIO_STMR_TM11               *((volatile unsigned char*)(0x4270E52CUL))
#define bFM4_MFS7_CSIO_STMR_TM12               *((volatile unsigned char*)(0x4270E530UL))
#define bFM4_MFS7_CSIO_STMR_TM13               *((volatile unsigned char*)(0x4270E534UL))
#define bFM4_MFS7_CSIO_STMR_TM14               *((volatile unsigned char*)(0x4270E538UL))
#define bFM4_MFS7_CSIO_STMR_TM15               *((volatile unsigned char*)(0x4270E53CUL))
#define bFM4_MFS7_CSIO_STMCR_TC0               *((volatile unsigned char*)(0x4270E580UL))
#define bFM4_MFS7_CSIO_STMCR_TC1               *((volatile unsigned char*)(0x4270E584UL))
#define bFM4_MFS7_CSIO_STMCR_TC2               *((volatile unsigned char*)(0x4270E588UL))
#define bFM4_MFS7_CSIO_STMCR_TC3               *((volatile unsigned char*)(0x4270E58CUL))
#define bFM4_MFS7_CSIO_STMCR_TC4               *((volatile unsigned char*)(0x4270E590UL))
#define bFM4_MFS7_CSIO_STMCR_TC5               *((volatile unsigned char*)(0x4270E594UL))
#define bFM4_MFS7_CSIO_STMCR_TC6               *((volatile unsigned char*)(0x4270E598UL))
#define bFM4_MFS7_CSIO_STMCR_TC7               *((volatile unsigned char*)(0x4270E59CUL))
#define bFM4_MFS7_CSIO_STMCR_TC8               *((volatile unsigned char*)(0x4270E5A0UL))
#define bFM4_MFS7_CSIO_STMCR_TC9               *((volatile unsigned char*)(0x4270E5A4UL))
#define bFM4_MFS7_CSIO_STMCR_TC10              *((volatile unsigned char*)(0x4270E5A8UL))
#define bFM4_MFS7_CSIO_STMCR_TC11              *((volatile unsigned char*)(0x4270E5ACUL))
#define bFM4_MFS7_CSIO_STMCR_TC12              *((volatile unsigned char*)(0x4270E5B0UL))
#define bFM4_MFS7_CSIO_STMCR_TC13              *((volatile unsigned char*)(0x4270E5B4UL))
#define bFM4_MFS7_CSIO_STMCR_TC14              *((volatile unsigned char*)(0x4270E5B8UL))
#define bFM4_MFS7_CSIO_STMCR_TC15              *((volatile unsigned char*)(0x4270E5BCUL))
#define bFM4_MFS7_CSIO_SCSCR_CSOE              *((volatile unsigned char*)(0x4270E600UL))
#define bFM4_MFS7_CSIO_SCSCR_CSEN0             *((volatile unsigned char*)(0x4270E604UL))
#define bFM4_MFS7_CSIO_SCSCR_CSEN1             *((volatile unsigned char*)(0x4270E608UL))
#define bFM4_MFS7_CSIO_SCSCR_CSEN2             *((volatile unsigned char*)(0x4270E60CUL))
#define bFM4_MFS7_CSIO_SCSCR_CSEN3             *((volatile unsigned char*)(0x4270E610UL))
#define bFM4_MFS7_CSIO_SCSCR_CSLVL             *((volatile unsigned char*)(0x4270E614UL))
#define bFM4_MFS7_CSIO_SCSCR_CDIV0             *((volatile unsigned char*)(0x4270E618UL))
#define bFM4_MFS7_CSIO_SCSCR_CDIV1             *((volatile unsigned char*)(0x4270E61CUL))
#define bFM4_MFS7_CSIO_SCSCR_CDIV2             *((volatile unsigned char*)(0x4270E620UL))
#define bFM4_MFS7_CSIO_SCSCR_SCAM              *((volatile unsigned char*)(0x4270E624UL))
#define bFM4_MFS7_CSIO_SCSCR_SCD0              *((volatile unsigned char*)(0x4270E628UL))
#define bFM4_MFS7_CSIO_SCSCR_SCD1              *((volatile unsigned char*)(0x4270E62CUL))
#define bFM4_MFS7_CSIO_SCSCR_SED0              *((volatile unsigned char*)(0x4270E630UL))
#define bFM4_MFS7_CSIO_SCSCR_SED1              *((volatile unsigned char*)(0x4270E634UL))
#define bFM4_MFS7_CSIO_SCSCR_SST0              *((volatile unsigned char*)(0x4270E638UL))
#define bFM4_MFS7_CSIO_SCSCR_SST1              *((volatile unsigned char*)(0x4270E63CUL))
#define bFM4_MFS7_CSIO_SCSFR0_CS1L0            *((volatile unsigned char*)(0x4270E680UL))
#define bFM4_MFS7_CSIO_SCSFR0_CS1L1            *((volatile unsigned char*)(0x4270E684UL))
#define bFM4_MFS7_CSIO_SCSFR0_CS1L2            *((volatile unsigned char*)(0x4270E688UL))
#define bFM4_MFS7_CSIO_SCSFR0_CS1L3            *((volatile unsigned char*)(0x4270E68CUL))
#define bFM4_MFS7_CSIO_SCSFR0_CS1L4            *((volatile unsigned char*)(0x4270E690UL))
#define bFM4_MFS7_CSIO_SCSFR0_CS1SPI           *((volatile unsigned char*)(0x4270E694UL))
#define bFM4_MFS7_CSIO_SCSFR0_CS1SCINV         *((volatile unsigned char*)(0x4270E698UL))
#define bFM4_MFS7_CSIO_SCSFR0_CS1CSLVL         *((volatile unsigned char*)(0x4270E69CUL))
#define bFM4_MFS7_CSIO_SCSFR1_CS2L0            *((volatile unsigned char*)(0x4270E6A0UL))
#define bFM4_MFS7_CSIO_SCSFR1_CS2L1            *((volatile unsigned char*)(0x4270E6A4UL))
#define bFM4_MFS7_CSIO_SCSFR1_CS2L2            *((volatile unsigned char*)(0x4270E6A8UL))
#define bFM4_MFS7_CSIO_SCSFR1_CS2L3            *((volatile unsigned char*)(0x4270E6ACUL))
#define bFM4_MFS7_CSIO_SCSFR1_CS2L4            *((volatile unsigned char*)(0x4270E6B0UL))
#define bFM4_MFS7_CSIO_SCSFR1_CS2SPI           *((volatile unsigned char*)(0x4270E6B4UL))
#define bFM4_MFS7_CSIO_SCSFR1_CS2SCINV         *((volatile unsigned char*)(0x4270E6B8UL))
#define bFM4_MFS7_CSIO_SCSFR1_CS2CSLVL         *((volatile unsigned char*)(0x4270E6BCUL))
#define bFM4_MFS7_CSIO_SCSFR2_CS3L0            *((volatile unsigned char*)(0x4270E700UL))
#define bFM4_MFS7_CSIO_SCSFR2_CS3L1            *((volatile unsigned char*)(0x4270E704UL))
#define bFM4_MFS7_CSIO_SCSFR2_CS3L2            *((volatile unsigned char*)(0x4270E708UL))
#define bFM4_MFS7_CSIO_SCSFR2_CS3L3            *((volatile unsigned char*)(0x4270E70CUL))
#define bFM4_MFS7_CSIO_SCSFR2_CS3L4            *((volatile unsigned char*)(0x4270E710UL))
#define bFM4_MFS7_CSIO_SCSFR2_CS3SPI           *((volatile unsigned char*)(0x4270E714UL))
#define bFM4_MFS7_CSIO_SCSFR2_CS3SCINV         *((volatile unsigned char*)(0x4270E718UL))
#define bFM4_MFS7_CSIO_SCSFR2_CS3CSLVL         *((volatile unsigned char*)(0x4270E71CUL))

