MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2C48J0AGB1000A/mcu.h
/* MFS CSIO channel 8 registers */
#define bFM4_MFS8_CSIO_SMR_SOE                 *((volatile unsigned char*)(0x42710000UL))
#define bFM4_MFS8_CSIO_SMR_SCKE                *((volatile unsigned char*)(0x42710004UL))
#define bFM4_MFS8_CSIO_SMR_BDS                 *((volatile unsigned char*)(0x42710008UL))
#define bFM4_MFS8_CSIO_SMR_SCINV               *((volatile unsigned char*)(0x4271000CUL))
#define bFM4_MFS8_CSIO_SMR_MD0                 *((volatile unsigned char*)(0x42710014UL))
#define bFM4_MFS8_CSIO_SMR_MD1                 *((volatile unsigned char*)(0x42710018UL))
#define bFM4_MFS8_CSIO_SMR_MD2                 *((volatile unsigned char*)(0x4271001CUL))
#define bFM4_MFS8_CSIO_SCR_TXE                 *((volatile unsigned char*)(0x42710020UL))
#define bFM4_MFS8_CSIO_SCR_RXE                 *((volatile unsigned char*)(0x42710024UL))
#define bFM4_MFS8_CSIO_SCR_TBIE                *((volatile unsigned char*)(0x42710028UL))
#define bFM4_MFS8_CSIO_SCR_TIE                 *((volatile unsigned char*)(0x4271002CUL))
#define bFM4_MFS8_CSIO_SCR_RIE                 *((volatile unsigned char*)(0x42710030UL))
#define bFM4_MFS8_CSIO_SCR_SPI                 *((volatile unsigned char*)(0x42710034UL))
#define bFM4_MFS8_CSIO_SCR_MS                  *((volatile unsigned char*)(0x42710038UL))
#define bFM4_MFS8_CSIO_SCR_UPCL                *((volatile unsigned char*)(0x4271003CUL))
#define bFM4_MFS8_CSIO_ESCR_L0                 *((volatile unsigned char*)(0x42710080UL))
#define bFM4_MFS8_CSIO_ESCR_L1                 *((volatile unsigned char*)(0x42710084UL))
#define bFM4_MFS8_CSIO_ESCR_L2                 *((volatile unsigned char*)(0x42710088UL))
#define bFM4_MFS8_CSIO_ESCR_WT0                *((volatile unsigned char*)(0x4271008CUL))
#define bFM4_MFS8_CSIO_ESCR_WT1                *((volatile unsigned char*)(0x42710090UL))
#define bFM4_MFS8_CSIO_ESCR_CSFE               *((volatile unsigned char*)(0x42710094UL))
#define bFM4_MFS8_CSIO_ESCR_L3                 *((volatile unsigned char*)(0x42710098UL))
#define bFM4_MFS8_CSIO_ESCR_SOP                *((volatile unsigned char*)(0x4271009CUL))
#define bFM4_MFS8_CSIO_SSR_TBI                 *((volatile unsigned char*)(0x427100A0UL))
#define bFM4_MFS8_CSIO_SSR_TDRE                *((volatile unsigned char*)(0x427100A4UL))
#define bFM4_MFS8_CSIO_SSR_RDRF                *((volatile unsigned char*)(0x427100A8UL))
#define bFM4_MFS8_CSIO_SSR_ORE                 *((volatile unsigned char*)(0x427100ACUL))
#define bFM4_MFS8_CSIO_SSR_AWC                 *((volatile unsigned char*)(0x427100B0UL))
#define bFM4_MFS8_CSIO_SSR_REC                 *((volatile unsigned char*)(0x427100BCUL))
#define bFM4_MFS8_CSIO_FCR_FE1                 *((volatile unsigned char*)(0x42710280UL))
#define bFM4_MFS8_CSIO_FCR_FE2                 *((volatile unsigned char*)(0x42710284UL))
#define bFM4_MFS8_CSIO_FCR_FCL1                *((volatile unsigned char*)(0x42710288UL))
#define bFM4_MFS8_CSIO_FCR_FCL2                *((volatile unsigned char*)(0x4271028CUL))
#define bFM4_MFS8_CSIO_FCR_FSET                *((volatile unsigned char*)(0x42710290UL))
#define bFM4_MFS8_CSIO_FCR_FLD                 *((volatile unsigned char*)(0x42710294UL))
#define bFM4_MFS8_CSIO_FCR_FLST                *((volatile unsigned char*)(0x42710298UL))
#define bFM4_MFS8_CSIO_FCR_FSEL                *((volatile unsigned char*)(0x427102A0UL))
#define bFM4_MFS8_CSIO_FCR_FTIE                *((volatile unsigned char*)(0x427102A4UL))
#define bFM4_MFS8_CSIO_FCR_FDRQ                *((volatile unsigned char*)(0x427102A8UL))
#define bFM4_MFS8_CSIO_FCR_FRIIE               *((volatile unsigned char*)(0x427102ACUL))
#define bFM4_MFS8_CSIO_FCR_FLSTE               *((volatile unsigned char*)(0x427102B0UL))
#define bFM4_MFS8_CSIO_FCR0_FE1                *((volatile unsigned char*)(0x42710280UL))
#define bFM4_MFS8_CSIO_FCR0_FE2                *((volatile unsigned char*)(0x42710284UL))
#define bFM4_MFS8_CSIO_FCR0_FCL1               *((volatile unsigned char*)(0x42710288UL))
#define bFM4_MFS8_CSIO_FCR0_FCL2               *((volatile unsigned char*)(0x4271028CUL))
#define bFM4_MFS8_CSIO_FCR0_FSET               *((volatile unsigned char*)(0x42710290UL))
#define bFM4_MFS8_CSIO_FCR0_FLD                *((volatile unsigned char*)(0x42710294UL))
#define bFM4_MFS8_CSIO_FCR0_FLST               *((volatile unsigned char*)(0x42710298UL))
#define bFM4_MFS8_CSIO_FCR1_FSEL               *((volatile unsigned char*)(0x427102A0UL))
#define bFM4_MFS8_CSIO_FCR1_FTIE               *((volatile unsigned char*)(0x427102A4UL))
#define bFM4_MFS8_CSIO_FCR1_FDRQ               *((volatile unsigned char*)(0x427102A8UL))
#define bFM4_MFS8_CSIO_FCR1_FRIIE              *((volatile unsigned char*)(0x427102ACUL))
#define bFM4_MFS8_CSIO_FCR1_FLSTE              *((volatile unsigned char*)(0x427102B0UL))
#define bFM4_MFS8_CSIO_FBYTE_FD0               *((volatile unsigned char*)(0x42710300UL))
#define bFM4_MFS8_CSIO_FBYTE_FD1               *((volatile unsigned char*)(0x42710304UL))
#define bFM4_MFS8_CSIO_FBYTE_FD2               *((volatile unsigned char*)(0x42710308UL))
#define bFM4_MFS8_CSIO_FBYTE_FD3               *((volatile unsigned char*)(0x4271030CUL))
#define bFM4_MFS8_CSIO_FBYTE_FD4               *((volatile unsigned char*)(0x42710310UL))
#define bFM4_MFS8_CSIO_FBYTE_FD5               *((volatile unsigned char*)(0x42710314UL))
#define bFM4_MFS8_CSIO_FBYTE_FD6               *((volatile unsigned char*)(0x42710318UL))
#define bFM4_MFS8_CSIO_FBYTE_FD7               *((volatile unsigned char*)(0x4271031CUL))
#define bFM4_MFS8_CSIO_FBYTE_FD8               *((volatile unsigned char*)(0x42710320UL))
#define bFM4_MFS8_CSIO_FBYTE_FD9               *((volatile unsigned char*)(0x42710324UL))
#define bFM4_MFS8_CSIO_FBYTE_FD10              *((volatile unsigned char*)(0x42710328UL))
#define bFM4_MFS8_CSIO_FBYTE_FD11              *((volatile unsigned char*)(0x4271032CUL))
#define bFM4_MFS8_CSIO_FBYTE_FD12              *((volatile unsigned char*)(0x42710330UL))
#define bFM4_MFS8_CSIO_FBYTE_FD13              *((volatile unsigned char*)(0x42710334UL))
#define bFM4_MFS8_CSIO_FBYTE_FD14              *((volatile unsigned char*)(0x42710338UL))
#define bFM4_MFS8_CSIO_FBYTE_FD15              *((volatile unsigned char*)(0x4271033CUL))
#define bFM4_MFS8_CSIO_FBYTE1_FD0              *((volatile unsigned char*)(0x42710300UL))
#define bFM4_MFS8_CSIO_FBYTE1_FD1              *((volatile unsigned char*)(0x42710304UL))
#define bFM4_MFS8_CSIO_FBYTE1_FD2              *((volatile unsigned char*)(0x42710308UL))
#define bFM4_MFS8_CSIO_FBYTE1_FD3              *((volatile unsigned char*)(0x4271030CUL))
#define bFM4_MFS8_CSIO_FBYTE1_FD4              *((volatile unsigned char*)(0x42710310UL))
#define bFM4_MFS8_CSIO_FBYTE1_FD5              *((volatile unsigned char*)(0x42710314UL))
#define bFM4_MFS8_CSIO_FBYTE1_FD6              *((volatile unsigned char*)(0x42710318UL))
#define bFM4_MFS8_CSIO_FBYTE1_FD7              *((volatile unsigned char*)(0x4271031CUL))
#define bFM4_MFS8_CSIO_FBYTE2_FD8              *((volatile unsigned char*)(0x42710320UL))
#define bFM4_MFS8_CSIO_FBYTE2_FD9              *((volatile unsigned char*)(0x42710324UL))
#define bFM4_MFS8_CSIO_FBYTE2_FD10             *((volatile unsigned char*)(0x42710328UL))
#define bFM4_MFS8_CSIO_FBYTE2_FD11             *((volatile unsigned char*)(0x4271032CUL))
#define bFM4_MFS8_CSIO_FBYTE2_FD12             *((volatile unsigned char*)(0x42710330UL))
#define bFM4_MFS8_CSIO_FBYTE2_FD13             *((volatile unsigned char*)(0x42710334UL))
#define bFM4_MFS8_CSIO_FBYTE2_FD14             *((volatile unsigned char*)(0x42710338UL))
#define bFM4_MFS8_CSIO_FBYTE2_FD15             *((volatile unsigned char*)(0x4271033CUL))
#define bFM4_MFS8_CSIO_SCSTR10_CSHD0           *((volatile unsigned char*)(0x42710380UL))
#define bFM4_MFS8_CSIO_SCSTR10_CSHD1           *((volatile unsigned char*)(0x42710384UL))
#define bFM4_MFS8_CSIO_SCSTR10_CSHD2           *((volatile unsigned char*)(0x42710388UL))
#define bFM4_MFS8_CSIO_SCSTR10_CSHD3           *((volatile unsigned char*)(0x4271038CUL))
#define bFM4_MFS8_CSIO_SCSTR10_CSHD4           *((volatile unsigned char*)(0x42710390UL))
#define bFM4_MFS8_CSIO_SCSTR10_CSHD5           *((volatile unsigned char*)(0x42710394UL))
#define bFM4_MFS8_CSIO_SCSTR10_CSHD6           *((volatile unsigned char*)(0x42710398UL))
#define bFM4_MFS8_CSIO_SCSTR10_CSHD7           *((volatile unsigned char*)(0x4271039CUL))
#define bFM4_MFS8_CSIO_SCSTR10_CSSU0           *((volatile unsigned char*)(0x427103A0UL))
#define bFM4_MFS8_CSIO_SCSTR10_CSSU1           *((volatile unsigned char*)(0x427103A4UL))
#define bFM4_MFS8_CSIO_SCSTR10_CSSU2           *((volatile unsigned char*)(0x427103A8UL))
#define bFM4_MFS8_CSIO_SCSTR10_CSSU3           *((volatile unsigned char*)(0x427103ACUL))
#define bFM4_MFS8_CSIO_SCSTR10_CSSU4           *((volatile unsigned char*)(0x427103B0UL))
#define bFM4_MFS8_CSIO_SCSTR10_CSSU5           *((volatile unsigned char*)(0x427103B4UL))
#define bFM4_MFS8_CSIO_SCSTR10_CSSU6           *((volatile unsigned char*)(0x427103B8UL))
#define bFM4_MFS8_CSIO_SCSTR10_CSSU7           *((volatile unsigned char*)(0x427103BCUL))
#define bFM4_MFS8_CSIO_SCSTR32_CSDS0           *((volatile unsigned char*)(0x42710400UL))
#define bFM4_MFS8_CSIO_SCSTR32_CSDS1           *((volatile unsigned char*)(0x42710404UL))
#define bFM4_MFS8_CSIO_SCSTR32_CSDS2           *((volatile unsigned char*)(0x42710408UL))
#define bFM4_MFS8_CSIO_SCSTR32_CSDS3           *((volatile unsigned char*)(0x4271040CUL))
#define bFM4_MFS8_CSIO_SCSTR32_CSDS4           *((volatile unsigned char*)(0x42710410UL))
#define bFM4_MFS8_CSIO_SCSTR32_CSDS5           *((volatile unsigned char*)(0x42710414UL))
#define bFM4_MFS8_CSIO_SCSTR32_CSDS6           *((volatile unsigned char*)(0x42710418UL))
#define bFM4_MFS8_CSIO_SCSTR32_CSDS7           *((volatile unsigned char*)(0x4271041CUL))
#define bFM4_MFS8_CSIO_SCSTR32_CSDS8           *((volatile unsigned char*)(0x42710420UL))
#define bFM4_MFS8_CSIO_SCSTR32_CSDS9           *((volatile unsigned char*)(0x42710424UL))
#define bFM4_MFS8_CSIO_SCSTR32_CSDS10          *((volatile unsigned char*)(0x42710428UL))
#define bFM4_MFS8_CSIO_SCSTR32_CSDS11          *((volatile unsigned char*)(0x4271042CUL))
#define bFM4_MFS8_CSIO_SCSTR32_CSDS12          *((volatile unsigned char*)(0x42710430UL))
#define bFM4_MFS8_CSIO_SCSTR32_CSDS13          *((volatile unsigned char*)(0x42710434UL))
#define bFM4_MFS8_CSIO_SCSTR32_CSDS14          *((volatile unsigned char*)(0x42710438UL))
#define bFM4_MFS8_CSIO_SCSTR32_CSDS15          *((volatile unsigned char*)(0x4271043CUL))
#define bFM4_MFS8_CSIO_SACSR_TMRE              *((volatile unsigned char*)(0x42710480UL))
#define bFM4_MFS8_CSIO_SACSR_TDIV0             *((volatile unsigned char*)(0x42710484UL))
#define bFM4_MFS8_CSIO_SACSR_TDIV1             *((volatile unsigned char*)(0x42710488UL))
#define bFM4_MFS8_CSIO_SACSR_TDIV2             *((volatile unsigned char*)(0x4271048CUL))
#define bFM4_MFS8_CSIO_SACSR_TDIV3             *((volatile unsigned char*)(0x42710490UL))
#define bFM4_MFS8_CSIO_SACSR_TSYNE             *((volatile unsigned char*)(0x42710498UL))
#define bFM4_MFS8_CSIO_SACSR_TINTE             *((volatile unsigned char*)(0x4271049CUL))
#define bFM4_MFS8_CSIO_SACSR_TINT              *((volatile unsigned char*)(0x427104A0UL))
#define bFM4_MFS8_CSIO_SACSR_CSE               *((volatile unsigned char*)(0x427104ACUL))
#define bFM4_MFS8_CSIO_SACSR_CSEIE             *((volatile unsigned char*)(0x427104B0UL))
#define bFM4_MFS8_CSIO_SACSR_TBEEN             *((volatile unsigned char*)(0x427104B4UL))
#define bFM4_MFS8_CSIO_STMR_TM0                *((volatile unsigned char*)(0x42710500UL))
#define bFM4_MFS8_CSIO_STMR_TM1                *((volatile unsigned char*)(0x42710504UL))
#define bFM4_MFS8_CSIO_STMR_TM2                *((volatile unsigned char*)(0x42710508UL))
#define bFM4_MFS8_CSIO_STMR_TM3                *((volatile unsigned char*)(0x4271050CUL))
#define bFM4_MFS8_CSIO_STMR_TM4                *((volatile unsigned char*)(0x42710510UL))
#define bFM4_MFS8_CSIO_STMR_TM5                *((volatile unsigned char*)(0x42710514UL))
#define bFM4_MFS8_CSIO_STMR_TM6                *((volatile unsigned char*)(0x42710518UL))
#define bFM4_MFS8_CSIO_STMR_TM7                *((volatile unsigned char*)(0x4271051CUL))
#define bFM4_MFS8_CSIO_STMR_TM8                *((volatile unsigned char*)(0x42710520UL))
#define bFM4_MFS8_CSIO_STMR_TM9                *((volatile unsigned char*)(0x42710524UL))
#define bFM4_MFS8_CSIO_STMR_TM10               *((volatile unsigned char*)(0x42710528UL))
#define bFM4_MFS8_CSIO_STMR_TM11               *((volatile unsigned char*)(0x4271052CUL))
#define bFM4_MFS8_CSIO_STMR_TM12               *((volatile unsigned char*)(0x42710530UL))
#define bFM4_MFS8_CSIO_STMR_TM13               *((volatile unsigned char*)(0x42710534UL))
#define bFM4_MFS8_CSIO_STMR_TM14               *((volatile unsigned char*)(0x42710538UL))
#define bFM4_MFS8_CSIO_STMR_TM15               *((volatile unsigned char*)(0x4271053CUL))
#define bFM4_MFS8_CSIO_STMCR_TC0               *((volatile unsigned char*)(0x42710580UL))
#define bFM4_MFS8_CSIO_STMCR_TC1               *((volatile unsigned char*)(0x42710584UL))
#define bFM4_MFS8_CSIO_STMCR_TC2               *((volatile unsigned char*)(0x42710588UL))
#define bFM4_MFS8_CSIO_STMCR_TC3               *((volatile unsigned char*)(0x4271058CUL))
#define bFM4_MFS8_CSIO_STMCR_TC4               *((volatile unsigned char*)(0x42710590UL))
#define bFM4_MFS8_CSIO_STMCR_TC5               *((volatile unsigned char*)(0x42710594UL))
#define bFM4_MFS8_CSIO_STMCR_TC6               *((volatile unsigned char*)(0x42710598UL))
#define bFM4_MFS8_CSIO_STMCR_TC7               *((volatile unsigned char*)(0x4271059CUL))
#define bFM4_MFS8_CSIO_STMCR_TC8               *((volatile unsigned char*)(0x427105A0UL))
#define bFM4_MFS8_CSIO_STMCR_TC9               *((volatile unsigned char*)(0x427105A4UL))
#define bFM4_MFS8_CSIO_STMCR_TC10              *((volatile unsigned char*)(0x427105A8UL))
#define bFM4_MFS8_CSIO_STMCR_TC11              *((volatile unsigned char*)(0x427105ACUL))
#define bFM4_MFS8_CSIO_STMCR_TC12              *((volatile unsigned char*)(0x427105B0UL))
#define bFM4_MFS8_CSIO_STMCR_TC13              *((volatile unsigned char*)(0x427105B4UL))
#define bFM4_MFS8_CSIO_STMCR_TC14              *((volatile unsigned char*)(0x427105B8UL))
#define bFM4_MFS8_CSIO_STMCR_TC15              *((volatile unsigned char*)(0x427105BCUL))
#define bFM4_MFS8_CSIO_SCSCR_CSOE              *((volatile unsigned char*)(0x42710600UL))
#define bFM4_MFS8_CSIO_SCSCR_CSEN0             *((volatile unsigned char*)(0x42710604UL))
#define bFM4_MFS8_CSIO_SCSCR_CSEN1             *((volatile unsigned char*)(0x42710608UL))
#define bFM4_MFS8_CSIO_SCSCR_CSEN2             *((volatile unsigned char*)(0x4271060CUL))
#define bFM4_MFS8_CSIO_SCSCR_CSEN3             *((volatile unsigned char*)(0x42710610UL))
#define bFM4_MFS8_CSIO_SCSCR_CSLVL             *((volatile unsigned char*)(0x42710614UL))
#define bFM4_MFS8_CSIO_SCSCR_CDIV0             *((volatile unsigned char*)(0x42710618UL))
#define bFM4_MFS8_CSIO_SCSCR_CDIV1             *((volatile unsigned char*)(0x4271061CUL))
#define bFM4_MFS8_CSIO_SCSCR_CDIV2             *((volatile unsigned char*)(0x42710620UL))
#define bFM4_MFS8_CSIO_SCSCR_SCAM              *((volatile unsigned char*)(0x42710624UL))
#define bFM4_MFS8_CSIO_SCSCR_SCD0              *((volatile unsigned char*)(0x42710628UL))
#define bFM4_MFS8_CSIO_SCSCR_SCD1              *((volatile unsigned char*)(0x4271062CUL))
#define bFM4_MFS8_CSIO_SCSCR_SED0              *((volatile unsigned char*)(0x42710630UL))
#define bFM4_MFS8_CSIO_SCSCR_SED1              *((volatile unsigned char*)(0x42710634UL))
#define bFM4_MFS8_CSIO_SCSCR_SST0              *((volatile unsigned char*)(0x42710638UL))
#define bFM4_MFS8_CSIO_SCSCR_SST1              *((volatile unsigned char*)(0x4271063CUL))
#define bFM4_MFS8_CSIO_SCSFR0_CS1L0            *((volatile unsigned char*)(0x42710680UL))
#define bFM4_MFS8_CSIO_SCSFR0_CS1L1            *((volatile unsigned char*)(0x42710684UL))
#define bFM4_MFS8_CSIO_SCSFR0_CS1L2            *((volatile unsigned char*)(0x42710688UL))
#define bFM4_MFS8_CSIO_SCSFR0_CS1L3            *((volatile unsigned char*)(0x4271068CUL))
#define bFM4_MFS8_CSIO_SCSFR0_CS1L4            *((volatile unsigned char*)(0x42710690UL))
#define bFM4_MFS8_CSIO_SCSFR0_CS1SPI           *((volatile unsigned char*)(0x42710694UL))
#define bFM4_MFS8_CSIO_SCSFR0_CS1SCINV         *((volatile unsigned char*)(0x42710698UL))
#define bFM4_MFS8_CSIO_SCSFR0_CS1CSLVL         *((volatile unsigned char*)(0x4271069CUL))
#define bFM4_MFS8_CSIO_SCSFR1_CS2L0            *((volatile unsigned char*)(0x427106A0UL))
#define bFM4_MFS8_CSIO_SCSFR1_CS2L1            *((volatile unsigned char*)(0x427106A4UL))
#define bFM4_MFS8_CSIO_SCSFR1_CS2L2            *((volatile unsigned char*)(0x427106A8UL))
#define bFM4_MFS8_CSIO_SCSFR1_CS2L3            *((volatile unsigned char*)(0x427106ACUL))
#define bFM4_MFS8_CSIO_SCSFR1_CS2L4            *((volatile unsigned char*)(0x427106B0UL))
#define bFM4_MFS8_CSIO_SCSFR1_CS2SPI           *((volatile unsigned char*)(0x427106B4UL))
#define bFM4_MFS8_CSIO_SCSFR1_CS2SCINV         *((volatile unsigned char*)(0x427106B8UL))
#define bFM4_MFS8_CSIO_SCSFR1_CS2CSLVL         *((volatile unsigned char*)(0x427106BCUL))
#define bFM4_MFS8_CSIO_SCSFR2_CS3L0            *((volatile unsigned char*)(0x42710700UL))
#define bFM4_MFS8_CSIO_SCSFR2_CS3L1            *((volatile unsigned char*)(0x42710704UL))
#define bFM4_MFS8_CSIO_SCSFR2_CS3L2            *((volatile unsigned char*)(0x42710708UL))
#define bFM4_MFS8_CSIO_SCSFR2_CS3L3            *((volatile unsigned char*)(0x4271070CUL))
#define bFM4_MFS8_CSIO_SCSFR2_CS3L4            *((volatile unsigned char*)(0x42710710UL))
#define bFM4_MFS8_CSIO_SCSFR2_CS3SPI           *((volatile unsigned char*)(0x42710714UL))
#define bFM4_MFS8_CSIO_SCSFR2_CS3SCINV         *((volatile unsigned char*)(0x42710718UL))
#define bFM4_MFS8_CSIO_SCSFR2_CS3CSLVL         *((volatile unsigned char*)(0x4271071CUL))

