MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2C48J0AGB1000A/mcu.h
/* MFS UART channel 11 registers */
#define bFM4_MFS11_UART_SMR_SOE                *((volatile unsigned char*)(0x42716000UL))
#define bFM4_MFS11_UART_SMR_BDS                *((volatile unsigned char*)(0x42716008UL))
#define bFM4_MFS11_UART_SMR_SBL                *((volatile unsigned char*)(0x4271600CUL))
#define bFM4_MFS11_UART_SMR_WUCR               *((volatile unsigned char*)(0x42716010UL))
#define bFM4_MFS11_UART_SMR_MD0                *((volatile unsigned char*)(0x42716014UL))
#define bFM4_MFS11_UART_SMR_MD1                *((volatile unsigned char*)(0x42716018UL))
#define bFM4_MFS11_UART_SMR_MD2                *((volatile unsigned char*)(0x4271601CUL))
#define bFM4_MFS11_UART_SCR_TXE                *((volatile unsigned char*)(0x42716020UL))
#define bFM4_MFS11_UART_SCR_RXE                *((volatile unsigned char*)(0x42716024UL))
#define bFM4_MFS11_UART_SCR_TBIE               *((volatile unsigned char*)(0x42716028UL))
#define bFM4_MFS11_UART_SCR_TIE                *((volatile unsigned char*)(0x4271602CUL))
#define bFM4_MFS11_UART_SCR_RIE                *((volatile unsigned char*)(0x42716030UL))
#define bFM4_MFS11_UART_SCR_UPCL               *((volatile unsigned char*)(0x4271603CUL))
#define bFM4_MFS11_UART_ESCR_L0                *((volatile unsigned char*)(0x42716080UL))
#define bFM4_MFS11_UART_ESCR_L1                *((volatile unsigned char*)(0x42716084UL))
#define bFM4_MFS11_UART_ESCR_L2                *((volatile unsigned char*)(0x42716088UL))
#define bFM4_MFS11_UART_ESCR_P                 *((volatile unsigned char*)(0x4271608CUL))
#define bFM4_MFS11_UART_ESCR_PEN               *((volatile unsigned char*)(0x42716090UL))
#define bFM4_MFS11_UART_ESCR_INV               *((volatile unsigned char*)(0x42716094UL))
#define bFM4_MFS11_UART_ESCR_ESBL              *((volatile unsigned char*)(0x42716098UL))
#define bFM4_MFS11_UART_ESCR_FLWEN             *((volatile unsigned char*)(0x4271609CUL))
#define bFM4_MFS11_UART_SSR_TBI                *((volatile unsigned char*)(0x427160A0UL))
#define bFM4_MFS11_UART_SSR_TDRE               *((volatile unsigned char*)(0x427160A4UL))
#define bFM4_MFS11_UART_SSR_RDRF               *((volatile unsigned char*)(0x427160A8UL))
#define bFM4_MFS11_UART_SSR_ORE                *((volatile unsigned char*)(0x427160ACUL))
#define bFM4_MFS11_UART_SSR_FRE                *((volatile unsigned char*)(0x427160B0UL))
#define bFM4_MFS11_UART_SSR_PE                 *((volatile unsigned char*)(0x427160B4UL))
#define bFM4_MFS11_UART_SSR_REC                *((volatile unsigned char*)(0x427160BCUL))
#define bFM4_MFS11_UART_BGR_EXT                *((volatile unsigned char*)(0x427161BCUL))
#define bFM4_MFS11_UART_BGR1_EXT               *((volatile unsigned char*)(0x427161BCUL))
#define bFM4_MFS11_UART_FCR_FE1                *((volatile unsigned char*)(0x42716280UL))
#define bFM4_MFS11_UART_FCR_FE2                *((volatile unsigned char*)(0x42716284UL))
#define bFM4_MFS11_UART_FCR_FCL1               *((volatile unsigned char*)(0x42716288UL))
#define bFM4_MFS11_UART_FCR_FCL2               *((volatile unsigned char*)(0x4271628CUL))
#define bFM4_MFS11_UART_FCR_FSET               *((volatile unsigned char*)(0x42716290UL))
#define bFM4_MFS11_UART_FCR_FLD                *((volatile unsigned char*)(0x42716294UL))
#define bFM4_MFS11_UART_FCR_FLST               *((volatile unsigned char*)(0x42716298UL))
#define bFM4_MFS11_UART_FCR_FSEL               *((volatile unsigned char*)(0x427162A0UL))
#define bFM4_MFS11_UART_FCR_FTIE               *((volatile unsigned char*)(0x427162A4UL))
#define bFM4_MFS11_UART_FCR_FDRQ               *((volatile unsigned char*)(0x427162A8UL))
#define bFM4_MFS11_UART_FCR_FRIIE              *((volatile unsigned char*)(0x427162ACUL))
#define bFM4_MFS11_UART_FCR_FLSTE              *((volatile unsigned char*)(0x427162B0UL))
#define bFM4_MFS11_UART_FCR0_FE1               *((volatile unsigned char*)(0x42716280UL))
#define bFM4_MFS11_UART_FCR0_FE2               *((volatile unsigned char*)(0x42716284UL))
#define bFM4_MFS11_UART_FCR0_FCL1              *((volatile unsigned char*)(0x42716288UL))
#define bFM4_MFS11_UART_FCR0_FCL2              *((volatile unsigned char*)(0x4271628CUL))
#define bFM4_MFS11_UART_FCR0_FSET              *((volatile unsigned char*)(0x42716290UL))
#define bFM4_MFS11_UART_FCR0_FLD               *((volatile unsigned char*)(0x42716294UL))
#define bFM4_MFS11_UART_FCR0_FLST              *((volatile unsigned char*)(0x42716298UL))
#define bFM4_MFS11_UART_FCR1_FSEL              *((volatile unsigned char*)(0x427162A0UL))
#define bFM4_MFS11_UART_FCR1_FTIE              *((volatile unsigned char*)(0x427162A4UL))
#define bFM4_MFS11_UART_FCR1_FDRQ              *((volatile unsigned char*)(0x427162A8UL))
#define bFM4_MFS11_UART_FCR1_FRIIE             *((volatile unsigned char*)(0x427162ACUL))
#define bFM4_MFS11_UART_FCR1_FLSTE             *((volatile unsigned char*)(0x427162B0UL))
#define bFM4_MFS11_UART_FBYTE_FD0              *((volatile unsigned char*)(0x42716300UL))
#define bFM4_MFS11_UART_FBYTE_FD1              *((volatile unsigned char*)(0x42716304UL))
#define bFM4_MFS11_UART_FBYTE_FD2              *((volatile unsigned char*)(0x42716308UL))
#define bFM4_MFS11_UART_FBYTE_FD3              *((volatile unsigned char*)(0x4271630CUL))
#define bFM4_MFS11_UART_FBYTE_FD4              *((volatile unsigned char*)(0x42716310UL))
#define bFM4_MFS11_UART_FBYTE_FD5              *((volatile unsigned char*)(0x42716314UL))
#define bFM4_MFS11_UART_FBYTE_FD6              *((volatile unsigned char*)(0x42716318UL))
#define bFM4_MFS11_UART_FBYTE_FD7              *((volatile unsigned char*)(0x4271631CUL))
#define bFM4_MFS11_UART_FBYTE_FD8              *((volatile unsigned char*)(0x42716320UL))
#define bFM4_MFS11_UART_FBYTE_FD9              *((volatile unsigned char*)(0x42716324UL))
#define bFM4_MFS11_UART_FBYTE_FD10             *((volatile unsigned char*)(0x42716328UL))
#define bFM4_MFS11_UART_FBYTE_FD11             *((volatile unsigned char*)(0x4271632CUL))
#define bFM4_MFS11_UART_FBYTE_FD12             *((volatile unsigned char*)(0x42716330UL))
#define bFM4_MFS11_UART_FBYTE_FD13             *((volatile unsigned char*)(0x42716334UL))
#define bFM4_MFS11_UART_FBYTE_FD14             *((volatile unsigned char*)(0x42716338UL))
#define bFM4_MFS11_UART_FBYTE_FD15             *((volatile unsigned char*)(0x4271633CUL))
#define bFM4_MFS11_UART_FBYTE1_FD0             *((volatile unsigned char*)(0x42716300UL))
#define bFM4_MFS11_UART_FBYTE1_FD1             *((volatile unsigned char*)(0x42716304UL))
#define bFM4_MFS11_UART_FBYTE1_FD2             *((volatile unsigned char*)(0x42716308UL))
#define bFM4_MFS11_UART_FBYTE1_FD3             *((volatile unsigned char*)(0x4271630CUL))
#define bFM4_MFS11_UART_FBYTE1_FD4             *((volatile unsigned char*)(0x42716310UL))
#define bFM4_MFS11_UART_FBYTE1_FD5             *((volatile unsigned char*)(0x42716314UL))
#define bFM4_MFS11_UART_FBYTE1_FD6             *((volatile unsigned char*)(0x42716318UL))
#define bFM4_MFS11_UART_FBYTE1_FD7             *((volatile unsigned char*)(0x4271631CUL))
#define bFM4_MFS11_UART_FBYTE2_FD8             *((volatile unsigned char*)(0x42716320UL))
#define bFM4_MFS11_UART_FBYTE2_FD9             *((volatile unsigned char*)(0x42716324UL))
#define bFM4_MFS11_UART_FBYTE2_FD10            *((volatile unsigned char*)(0x42716328UL))
#define bFM4_MFS11_UART_FBYTE2_FD11            *((volatile unsigned char*)(0x4271632CUL))
#define bFM4_MFS11_UART_FBYTE2_FD12            *((volatile unsigned char*)(0x42716330UL))
#define bFM4_MFS11_UART_FBYTE2_FD13            *((volatile unsigned char*)(0x42716334UL))
#define bFM4_MFS11_UART_FBYTE2_FD14            *((volatile unsigned char*)(0x42716338UL))
#define bFM4_MFS11_UART_FBYTE2_FD15            *((volatile unsigned char*)(0x4271633CUL))

