MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2C48J0AGB1000A/mcu.h
/* SD IF registers */
#define bFM4_SDIF_STRSFMD_DMAEN                *((volatile unsigned char*)(0x42dc0180UL))
#define bFM4_SDIF_STRSFMD_BLCKCNTEN            *((volatile unsigned char*)(0x42dc0184UL))
#define bFM4_SDIF_STRSFMD_DTTRSFDIR            *((volatile unsigned char*)(0x42dc0190UL))
#define bFM4_SDIF_STRSFMD_BLCKCNTSEL           *((volatile unsigned char*)(0x42dc0194UL))
#define bFM4_SDIF_SCMMD_CMDCRCCHKE             *((volatile unsigned char*)(0x42dc01cCUL))
#define bFM4_SDIF_SCMMD_CMDIDXCHKE             *((volatile unsigned char*)(0x42dc01d0UL))
#define bFM4_SDIF_SCMMD_DATPRESSEL             *((volatile unsigned char*)(0x42dc01d4UL))
#define bFM4_SDIF_SPRSTAT_CMDINH               *((volatile unsigned char*)(0x42dc0480UL))
#define bFM4_SDIF_SPRSTAT_CMDDAYTINH           *((volatile unsigned char*)(0x42dc0484UL))
#define bFM4_SDIF_SPRSTAT_DATLNACT             *((volatile unsigned char*)(0x42dc0488UL))
#define bFM4_SDIF_SPRSTAT_RETUNEREQ            *((volatile unsigned char*)(0x42dc048CUL))
#define bFM4_SDIF_SPRSTAT_WRTRSFACT            *((volatile unsigned char*)(0x42dc04a0UL))
#define bFM4_SDIF_SPRSTAT_RDTRSFACT            *((volatile unsigned char*)(0x42dc04a4UL))
#define bFM4_SDIF_SPRSTAT_BUFWREN              *((volatile unsigned char*)(0x42dc04a8UL))
#define bFM4_SDIF_SPRSTAT_BUFRDEN              *((volatile unsigned char*)(0x42dc04aCUL))
#define bFM4_SDIF_SPRSTAT_CARDINS              *((volatile unsigned char*)(0x42dc04c0UL))
#define bFM4_SDIF_SPRSTAT_CARDSTB              *((volatile unsigned char*)(0x42dc04c4UL))
#define bFM4_SDIF_SPRSTAT_CARDDET              *((volatile unsigned char*)(0x42dc04c8UL))
#define bFM4_SDIF_SPRSTAT_WPPINLVL             *((volatile unsigned char*)(0x42dc04cCUL))
#define bFM4_SDIF_SPRSTAT_CMDLNSGN             *((volatile unsigned char*)(0x42dc04e0UL))
#define bFM4_SDIF_SHCTL1_LEDCTRL               *((volatile unsigned char*)(0x42dc0500UL))
#define bFM4_SDIF_SHCTL1_DATAWIDTH             *((volatile unsigned char*)(0x42dc0504UL))
#define bFM4_SDIF_SHCTL1_HIGHSPDEN             *((volatile unsigned char*)(0x42dc0508UL))
#define bFM4_SDIF_SHCTL1_EXTDTWIDTH            *((volatile unsigned char*)(0x42dc0514UL))
#define bFM4_SDIF_SHCTL1_CDTSTLVL              *((volatile unsigned char*)(0x42dc0518UL))
#define bFM4_SDIF_SHCTL1_CDSGNSEL              *((volatile unsigned char*)(0x42dc051CUL))
#define bFM4_SDIF_SPWRCTL_SDBUSPWR             *((volatile unsigned char*)(0x42dc0520UL))
#define bFM4_SDIF_SBLKGPCTL_BLCKGSTPREQ        *((volatile unsigned char*)(0x42dc0540UL))
#define bFM4_SDIF_SBLKGPCTL_CONTREQ            *((volatile unsigned char*)(0x42dc0544UL))
#define bFM4_SDIF_SBLKGPCTL_RDWAITCTL          *((volatile unsigned char*)(0x42dc0548UL))
#define bFM4_SDIF_SBLKGPCTL_BLCKGAPINT         *((volatile unsigned char*)(0x42dc054CUL))
#define bFM4_SDIF_SWKUPCTL_WKUPEVNTEN0         *((volatile unsigned char*)(0x42dc0560UL))
#define bFM4_SDIF_SWKUPCTL_WKUPEVNTEN1         *((volatile unsigned char*)(0x42dc0564UL))
#define bFM4_SDIF_SWKUPCTL_WKUPEVNTEN2         *((volatile unsigned char*)(0x42dc0568UL))
#define bFM4_SDIF_SCLKCTL_INTLCLCKEN           *((volatile unsigned char*)(0x42dc0580UL))
#define bFM4_SDIF_SCLKCTL_INTLCLCKST           *((volatile unsigned char*)(0x42dc0584UL))
#define bFM4_SDIF_SCLKCTL_SDCLCKEN             *((volatile unsigned char*)(0x42dc0588UL))
#define bFM4_SDIF_SCLKCTL_CLCKGENSEL           *((volatile unsigned char*)(0x42dc0594UL))
#define bFM4_SDIF_SSRST_SWRSTALL               *((volatile unsigned char*)(0x42dc05e0UL))
#define bFM4_SDIF_SSRST_SWRSTCMDLN             *((volatile unsigned char*)(0x42dc05e4UL))
#define bFM4_SDIF_SSRST_SWRSTDATLN             *((volatile unsigned char*)(0x42dc05e8UL))
#define bFM4_SDIF_SNINTST_CMDCMPLT             *((volatile unsigned char*)(0x42dc0600UL))
#define bFM4_SDIF_SNINTST_TRSFCMPLT            *((volatile unsigned char*)(0x42dc0604UL))
#define bFM4_SDIF_SNINTST_BLCKGEVNT            *((volatile unsigned char*)(0x42dc0608UL))
#define bFM4_SDIF_SNINTST_DMAINT               *((volatile unsigned char*)(0x42dc060CUL))
#define bFM4_SDIF_SNINTST_BUFWRRDY             *((volatile unsigned char*)(0x42dc0610UL))
#define bFM4_SDIF_SNINTST_BUFRDRDY             *((volatile unsigned char*)(0x42dc0614UL))
#define bFM4_SDIF_SNINTST_CARDINS              *((volatile unsigned char*)(0x42dc0618UL))
#define bFM4_SDIF_SNINTST_CARDRMV              *((volatile unsigned char*)(0x42dc061CUL))
#define bFM4_SDIF_SNINTST_CARDINT              *((volatile unsigned char*)(0x42dc0620UL))
#define bFM4_SDIF_SNINTST_INT_A                *((volatile unsigned char*)(0x42dc0624UL))
#define bFM4_SDIF_SNINTST_INT_B                *((volatile unsigned char*)(0x42dc0628UL))
#define bFM4_SDIF_SNINTST_INT_C                *((volatile unsigned char*)(0x42dc062CUL))
#define bFM4_SDIF_SNINTST_RETUNEEVT            *((volatile unsigned char*)(0x42dc0630UL))
#define bFM4_SDIF_SNINTST_ERRORINT             *((volatile unsigned char*)(0x42dc063CUL))
#define bFM4_SDIF_SEINTST_CMDTOERR             *((volatile unsigned char*)(0x42dc0640UL))
#define bFM4_SDIF_SEINTST_CMDCRCERR            *((volatile unsigned char*)(0x42dc0644UL))
#define bFM4_SDIF_SEINTST_CMDEBERR             *((volatile unsigned char*)(0x42dc0648UL))
#define bFM4_SDIF_SEINTST_CMDIDXERR            *((volatile unsigned char*)(0x42dc064CUL))
#define bFM4_SDIF_SEINTST_DTTOERR              *((volatile unsigned char*)(0x42dc0650UL))
#define bFM4_SDIF_SEINTST_DTEBERR              *((volatile unsigned char*)(0x42dc0654UL))
#define bFM4_SDIF_SEINTST_DTCRCERR             *((volatile unsigned char*)(0x42dc0658UL))
#define bFM4_SDIF_SEINTST_CRTLMTERR            *((volatile unsigned char*)(0x42dc065CUL))
#define bFM4_SDIF_SEINTST_ACMD12ERR            *((volatile unsigned char*)(0x42dc0660UL))
#define bFM4_SDIF_SEINTST_ADMAERR              *((volatile unsigned char*)(0x42dc0664UL))
#define bFM4_SDIF_SEINTST_TUNINGERR            *((volatile unsigned char*)(0x42dc0668UL))
#define bFM4_SDIF_SEINTST_BTACKERR             *((volatile unsigned char*)(0x42dc0670UL))
#define bFM4_SDIF_SEINTST_ACMD19ERR            *((volatile unsigned char*)(0x42dc0674UL))
#define bFM4_SDIF_SEINTST_AHBMSTERR            *((volatile unsigned char*)(0x42dc0678UL))
#define bFM4_SDIF_SNINTSTE_CMDCMPLTS           *((volatile unsigned char*)(0x42dc0680UL))
#define bFM4_SDIF_SNINTSTE_TRSFCMPLTS          *((volatile unsigned char*)(0x42dc0684UL))
#define bFM4_SDIF_SNINTSTE_BLCKGEVNTS          *((volatile unsigned char*)(0x42dc0688UL))
#define bFM4_SDIF_SNINTSTE_DMAINTS             *((volatile unsigned char*)(0x42dc068CUL))
#define bFM4_SDIF_SNINTSTE_BUFWRRDYS           *((volatile unsigned char*)(0x42dc0690UL))
#define bFM4_SDIF_SNINTSTE_BUFRDRDYS           *((volatile unsigned char*)(0x42dc0694UL))
#define bFM4_SDIF_SNINTSTE_CARDINSS            *((volatile unsigned char*)(0x42dc0698UL))
#define bFM4_SDIF_SNINTSTE_CARDRMVS            *((volatile unsigned char*)(0x42dc069CUL))
#define bFM4_SDIF_SNINTSTE_CARDINTS            *((volatile unsigned char*)(0x42dc06a0UL))
#define bFM4_SDIF_SNINTSTE_INT_AS              *((volatile unsigned char*)(0x42dc06a4UL))
#define bFM4_SDIF_SNINTSTE_INT_BS              *((volatile unsigned char*)(0x42dc06a8UL))
#define bFM4_SDIF_SNINTSTE_INT_CS              *((volatile unsigned char*)(0x42dc06aCUL))
#define bFM4_SDIF_SNINTSTE_RETUNEEVTS          *((volatile unsigned char*)(0x42dc06b0UL))
#define bFM4_SDIF_SEINTSTE_CMDTOERRS           *((volatile unsigned char*)(0x42dc06c0UL))
#define bFM4_SDIF_SEINTSTE_CMDCRCERRS          *((volatile unsigned char*)(0x42dc06c4UL))
#define bFM4_SDIF_SEINTSTE_CMDEBERRS           *((volatile unsigned char*)(0x42dc06c8UL))
#define bFM4_SDIF_SEINTSTE_CMDIDXERRS          *((volatile unsigned char*)(0x42dc06cCUL))
#define bFM4_SDIF_SEINTSTE_DTTOERRS            *((volatile unsigned char*)(0x42dc06d0UL))
#define bFM4_SDIF_SEINTSTE_DTEBERRS            *((volatile unsigned char*)(0x42dc06d4UL))
#define bFM4_SDIF_SEINTSTE_DTCRCERRS           *((volatile unsigned char*)(0x42dc06d8UL))
#define bFM4_SDIF_SEINTSTE_CRTLMTERRS          *((volatile unsigned char*)(0x42dc06dCUL))
#define bFM4_SDIF_SEINTSTE_ACMD12ERRS          *((volatile unsigned char*)(0x42dc06e0UL))
#define bFM4_SDIF_SEINTSTE_ADMAERRS            *((volatile unsigned char*)(0x42dc06e4UL))
#define bFM4_SDIF_SEINTSTE_TUNINGERRS          *((volatile unsigned char*)(0x42dc06e8UL))
#define bFM4_SDIF_SEINTSTE_BTACKERRS           *((volatile unsigned char*)(0x42dc06f0UL))
#define bFM4_SDIF_SEINTSTE_ACMD19ERRS          *((volatile unsigned char*)(0x42dc06f4UL))
#define bFM4_SDIF_SEINTSTE_AHBMSTERRS          *((volatile unsigned char*)(0x42dc06f8UL))
#define bFM4_SDIF_SNINTSGE_CMDCMPLTG           *((volatile unsigned char*)(0x42dc0700UL))
#define bFM4_SDIF_SNINTSGE_TRSFCMPLTG          *((volatile unsigned char*)(0x42dc0704UL))
#define bFM4_SDIF_SNINTSGE_BLCKGEVNTG          *((volatile unsigned char*)(0x42dc0708UL))
#define bFM4_SDIF_SNINTSGE_DMAINTG             *((volatile unsigned char*)(0x42dc070CUL))
#define bFM4_SDIF_SNINTSGE_BUFWRRDYG           *((volatile unsigned char*)(0x42dc0710UL))
#define bFM4_SDIF_SNINTSGE_BUFRDRDYG           *((volatile unsigned char*)(0x42dc0714UL))
#define bFM4_SDIF_SNINTSGE_CARDINSG            *((volatile unsigned char*)(0x42dc0718UL))
#define bFM4_SDIF_SNINTSGE_CARDRMVG            *((volatile unsigned char*)(0x42dc071CUL))
#define bFM4_SDIF_SNINTSGE_CARDINTG            *((volatile unsigned char*)(0x42dc0720UL))
#define bFM4_SDIF_SNINTSGE_INT_AG              *((volatile unsigned char*)(0x42dc0724UL))
#define bFM4_SDIF_SNINTSGE_INT_BG              *((volatile unsigned char*)(0x42dc0728UL))
#define bFM4_SDIF_SNINTSGE_INT_CG              *((volatile unsigned char*)(0x42dc072CUL))
#define bFM4_SDIF_SNINTSGE_RETUNEEVTG          *((volatile unsigned char*)(0x42dc0730UL))
#define bFM4_SDIF_SEINTSGE_CMDTOERRG           *((volatile unsigned char*)(0x42dc0740UL))
#define bFM4_SDIF_SEINTSGE_CMDCRCERRG          *((volatile unsigned char*)(0x42dc0744UL))
#define bFM4_SDIF_SEINTSGE_CMDEBERRG           *((volatile unsigned char*)(0x42dc0748UL))
#define bFM4_SDIF_SEINTSGE_CMDIDXERRG          *((volatile unsigned char*)(0x42dc074CUL))
#define bFM4_SDIF_SEINTSGE_DTTOERRG            *((volatile unsigned char*)(0x42dc0750UL))
#define bFM4_SDIF_SEINTSGE_DTEBERRG            *((volatile unsigned char*)(0x42dc0754UL))
#define bFM4_SDIF_SEINTSGE_DTCRCERRG           *((volatile unsigned char*)(0x42dc0758UL))
#define bFM4_SDIF_SEINTSGE_CRTLMTERRG          *((volatile unsigned char*)(0x42dc075CUL))
#define bFM4_SDIF_SEINTSGE_ACMD12ERRG          *((volatile unsigned char*)(0x42dc0760UL))
#define bFM4_SDIF_SEINTSGE_ADMAERRG            *((volatile unsigned char*)(0x42dc0764UL))
#define bFM4_SDIF_SEINTSGE_TUNINGERRG          *((volatile unsigned char*)(0x42dc0768UL))
#define bFM4_SDIF_SEINTSGE_BTACKERRG           *((volatile unsigned char*)(0x42dc0770UL))
#define bFM4_SDIF_SEINTSGE_ACMD19ERRG          *((volatile unsigned char*)(0x42dc0774UL))
#define bFM4_SDIF_SEINTSGE_AHBMSTERRG          *((volatile unsigned char*)(0x42dc0778UL))
#define bFM4_SDIF_SACMDEST_ACMD12NOEX          *((volatile unsigned char*)(0x42dc0780UL))
#define bFM4_SDIF_SACMDEST_ACMDTOERR           *((volatile unsigned char*)(0x42dc0784UL))
#define bFM4_SDIF_SACMDEST_ACMDCRCERR          *((volatile unsigned char*)(0x42dc0788UL))
#define bFM4_SDIF_SACMDEST_ACMDEBERR           *((volatile unsigned char*)(0x42dc078CUL))
#define bFM4_SDIF_SACMDEST_ACMDIDXERR          *((volatile unsigned char*)(0x42dc0790UL))
#define bFM4_SDIF_SACMDEST_CMDND12ERR          *((volatile unsigned char*)(0x42dc079CUL))
#define bFM4_SDIF_SHCTL2_V18SGNEN              *((volatile unsigned char*)(0x42dc07cCUL))
#define bFM4_SDIF_SHCTL2_DOTUING               *((volatile unsigned char*)(0x42dc07d8UL))
#define bFM4_SDIF_SHCTL2_SMPCLKSEK             *((volatile unsigned char*)(0x42dc07dCUL))
#define bFM4_SDIF_SHCTL2_ASYINTEN              *((volatile unsigned char*)(0x42dc07f8UL))
#define bFM4_SDIF_SHCTL2_PREVALEN              *((volatile unsigned char*)(0x42dc07fCUL))
#define bFM4_SDIF_CAPBLTY0_TOCLKUNIT           *((volatile unsigned char*)(0x42dc081CUL))
#define bFM4_SDIF_CAPBLTY1_EMBD8BIT            *((volatile unsigned char*)(0x42dc0848UL))
#define bFM4_SDIF_CAPBLTY1_ADMA2SPT            *((volatile unsigned char*)(0x42dc084CUL))
#define bFM4_SDIF_CAPBLTY1_HGHSPDSPT           *((volatile unsigned char*)(0x42dc0854UL))
#define bFM4_SDIF_CAPBLTY1_SDMASPT             *((volatile unsigned char*)(0x42dc0858UL))
#define bFM4_SDIF_CAPBLTY1_LWPWRSPT            *((volatile unsigned char*)(0x42dc085CUL))
#define bFM4_SDIF_CAPBLTY1_V33SPT              *((volatile unsigned char*)(0x42dc0860UL))
#define bFM4_SDIF_CAPBLTY1_V30SPT              *((volatile unsigned char*)(0x42dc0864UL))
#define bFM4_SDIF_CAPBLTY1_V18SPT              *((volatile unsigned char*)(0x42dc0868UL))
#define bFM4_SDIF_CAPBLTY1_BUS64SPT            *((volatile unsigned char*)(0x42dc0870UL))
#define bFM4_SDIF_CAPBLTY1_ASYINTSPT           *((volatile unsigned char*)(0x42dc0874UL))
#define bFM4_SDIF_CAPBLTY2_SDR50SPT            *((volatile unsigned char*)(0x42dc0880UL))
#define bFM4_SDIF_CAPBLTY2_SDR104SPT           *((volatile unsigned char*)(0x42dc0884UL))
#define bFM4_SDIF_CAPBLTY2_DDR50SPT            *((volatile unsigned char*)(0x42dc0888UL))
#define bFM4_SDIF_CAPBLTY2_DRVTPASPT           *((volatile unsigned char*)(0x42dc0890UL))
#define bFM4_SDIF_CAPBLTY2_DRVTPBSPT           *((volatile unsigned char*)(0x42dc0894UL))
#define bFM4_SDIF_CAPBLTY2_DRVTPCSPT           *((volatile unsigned char*)(0x42dc0898UL))
#define bFM4_SDIF_CAPBLTY2_USETNSDR50          *((volatile unsigned char*)(0x42dc08b4UL))
#define bFM4_SDIF_FEACEST_FEVNT12ND            *((volatile unsigned char*)(0x42dc0a00UL))
#define bFM4_SDIF_FEACEST_FEVNTTO              *((volatile unsigned char*)(0x42dc0a04UL))
#define bFM4_SDIF_FEACEST_FEVNTCRC             *((volatile unsigned char*)(0x42dc0a08UL))
#define bFM4_SDIF_FEACEST_FEVNTEB              *((volatile unsigned char*)(0x42dc0a0CUL))
#define bFM4_SDIF_FEACEST_FEVNTIDX             *((volatile unsigned char*)(0x42dc0a10UL))
#define bFM4_SDIF_FEACEST_FEVNTCMD12           *((volatile unsigned char*)(0x42dc0a1CUL))
#define bFM4_SDIF_SFEEIST_FETOERR              *((volatile unsigned char*)(0x42dc0a40UL))
#define bFM4_SDIF_SFEEIST_FECRCERR             *((volatile unsigned char*)(0x42dc0a44UL))
#define bFM4_SDIF_SFEEIST_FEEBERR              *((volatile unsigned char*)(0x42dc0a48UL))
#define bFM4_SDIF_SFEEIST_FEIDXERR             *((volatile unsigned char*)(0x42dc0a4CUL))
#define bFM4_SDIF_SFEEIST_FEDTOTERR            *((volatile unsigned char*)(0x42dc0a50UL))
#define bFM4_SDIF_SFEEIST_FEDTCRCERR           *((volatile unsigned char*)(0x42dc0a54UL))
#define bFM4_SDIF_SFEEIST_FEDTEBERR            *((volatile unsigned char*)(0x42dc0a58UL))
#define bFM4_SDIF_SFEEIST_FECRLTERR            *((volatile unsigned char*)(0x42dc0a5CUL))
#define bFM4_SDIF_SFEEIST_FEA12ERR             *((volatile unsigned char*)(0x42dc0a60UL))
#define bFM4_SDIF_SFEEIST_FEADMAERR            *((volatile unsigned char*)(0x42dc0a64UL))
#define bFM4_SDIF_SFEEIST_FETUNEERR            *((volatile unsigned char*)(0x42dc0a68UL))
#define bFM4_SDIF_SFEEIST_FEACKERR             *((volatile unsigned char*)(0x42dc0a70UL))
#define bFM4_SDIF_SFEEIST_FEA19ERR             *((volatile unsigned char*)(0x42dc0a74UL))
#define bFM4_SDIF_SFEEIST_FEAHBMSERR           *((volatile unsigned char*)(0x42dc0a78UL))
#define bFM4_SDIF_ADMAEST_ADMALENME            *((volatile unsigned char*)(0x42dc0a88UL))
#define bFM4_SDIF_SPRVAL0_CGSELVAL             *((volatile unsigned char*)(0x42dc0c28UL))
#define bFM4_SDIF_SPRVAL1_CGSELVAL             *((volatile unsigned char*)(0x42dc0c68UL))
#define bFM4_SDIF_SPRVAL2_CGSELVAL             *((volatile unsigned char*)(0x42dc0ca8UL))
#define bFM4_SDIF_SPRVAL3_CGSELVAL             *((volatile unsigned char*)(0x42dc0ce8UL))
#define bFM4_SDIF_SPRVAL4_CGSELVAL             *((volatile unsigned char*)(0x42dc0d28UL))
#define bFM4_SDIF_SPRVAL5_CGSELVAL             *((volatile unsigned char*)(0x42dc0d68UL))
#define bFM4_SDIF_SPRVAL6_CGSELVAL             *((volatile unsigned char*)(0x42dc0da8UL))
#define bFM4_SDIF_SPRVAL7_CGSELVAL             *((volatile unsigned char*)(0x42dc0de8UL))
#define bFM4_SDIF_AHBCFGL_SINEN                *((volatile unsigned char*)(0x42dc200CUL))
#define bFM4_SDIF_AHBCFGL_BSLOCK               *((volatile unsigned char*)(0x42dc2010UL))
#define bFM4_SDIF_AHBCFGL_BSLOCKSEL            *((volatile unsigned char*)(0x42dc2014UL))
#define bFM4_SDIF_AHBCFGL_ENDIANSEL            *((volatile unsigned char*)(0x42dc2018UL))
#define bFM4_SDIF_SPWSWCL_ATPWRSWEN            *((volatile unsigned char*)(0x42dc2080UL))
#define bFM4_SDIF_SPWSWCL_IOREGSEL             *((volatile unsigned char*)(0x42dc2084UL))
#define bFM4_SDIF_STUNSETL_TNPHSELEN           *((volatile unsigned char*)(0x42dc2120UL))
#define bFM4_SDIF_STUNSETL_TNERRBDSEL          *((volatile unsigned char*)(0x42dc2124UL))
#define bFM4_SDIF_STUNSETL_RETNTAPSEL          *((volatile unsigned char*)(0x42dc2128UL))
#define bFM4_SDIF_STUNSETH_CMDCFCHKDS          *((volatile unsigned char*)(0x42dc2140UL))
#define bFM4_SDIF_PSWISTL_INT5MS               *((volatile unsigned char*)(0x42dc2300UL))
#define bFM4_SDIF_PSWISTL_INT1MS               *((volatile unsigned char*)(0x42dc2304UL))
#define bFM4_SDIF_PSWISTEL_INT5MSSTS           *((volatile unsigned char*)(0x42dc2380UL))
#define bFM4_SDIF_PSWISTEL_INT1MSSTS           *((volatile unsigned char*)(0x42dc2384UL))
#define bFM4_SDIF_PSWISGEL_INT5MSSGEN          *((volatile unsigned char*)(0x42dc2400UL))
#define bFM4_SDIF_PSWISGEL_INT1MSSGEN          *((volatile unsigned char*)(0x42dc2404UL))
#define bFM4_SDIF_MMCSDCL_LCKRSTESD            *((volatile unsigned char*)(0x42dc2480UL))
#define bFM4_SDIF_MMCSDCL_RSTMMC               *((volatile unsigned char*)(0x42dc2484UL))
#define bFM4_SDIF_MMCSDCL_VCCCTLMMC            *((volatile unsigned char*)(0x42dc2488UL))
#define bFM4_SDIF_MMCSDCL_VCCQCTLMMC           *((volatile unsigned char*)(0x42dc248CUL))
#define bFM4_SDIF_MMCSDCL_MMCDDRSEL            *((volatile unsigned char*)(0x42dc24a0UL))
#define bFM4_SDIF_MMCSDCL_CMDDATDLY            *((volatile unsigned char*)(0x42dc24a4UL))
#define bFM4_SDIF_MMCSDCH_BTACKENMMC           *((volatile unsigned char*)(0x42dc24c0UL))
#define bFM4_SDIF_MMCSDCH_BTABTENMMC           *((volatile unsigned char*)(0x42dc24c4UL))
#define bFM4_SDIF_MMCSDCH_BTMDENMMC            *((volatile unsigned char*)(0x42dc24c8UL))
#define bFM4_SDIF_MCWIRQC0_WTIRQEN             *((volatile unsigned char*)(0x42dc2500UL))
#define bFM4_SDIF_MCWIRQC0_WTIRQST             *((volatile unsigned char*)(0x42dc2504UL))

