MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2C48J0AGB1000A/mcu.h
#define bFM4_CANFD_TXBTO_TO18                  *((volatile unsigned char*)(0x42E01B48UL))
#define bFM4_CANFD_TXBTO_TO19                  *((volatile unsigned char*)(0x42E01B4CUL))
#define bFM4_CANFD_TXBTO_TO20                  *((volatile unsigned char*)(0x42E01B50UL))
#define bFM4_CANFD_TXBTO_TO21                  *((volatile unsigned char*)(0x42E01B54UL))
#define bFM4_CANFD_TXBTO_TO22                  *((volatile unsigned char*)(0x42E01B58UL))
#define bFM4_CANFD_TXBTO_TO23                  *((volatile unsigned char*)(0x42E01B5CUL))
#define bFM4_CANFD_TXBTO_TO24                  *((volatile unsigned char*)(0x42E01B60UL))
#define bFM4_CANFD_TXBTO_TO25                  *((volatile unsigned char*)(0x42E01B64UL))
#define bFM4_CANFD_TXBTO_TO26                  *((volatile unsigned char*)(0x42E01B68UL))
#define bFM4_CANFD_TXBTO_TO27                  *((volatile unsigned char*)(0x42E01B6CUL))
#define bFM4_CANFD_TXBTO_TO28                  *((volatile unsigned char*)(0x42E01B70UL))
#define bFM4_CANFD_TXBTO_TO29                  *((volatile unsigned char*)(0x42E01B74UL))
#define bFM4_CANFD_TXBTO_TO30                  *((volatile unsigned char*)(0x42E01B78UL))
#define bFM4_CANFD_TXBTO_TO31                  *((volatile unsigned char*)(0x42E01B7CUL))
#define bFM4_CANFD_TXBCF_CF0                   *((volatile unsigned char*)(0x42E01B80UL))
#define bFM4_CANFD_TXBCF_CF1                   *((volatile unsigned char*)(0x42E01B84UL))
#define bFM4_CANFD_TXBCF_CF2                   *((volatile unsigned char*)(0x42E01B88UL))
#define bFM4_CANFD_TXBCF_CF3                   *((volatile unsigned char*)(0x42E01B8CUL))
#define bFM4_CANFD_TXBCF_CF4                   *((volatile unsigned char*)(0x42E01B90UL))
#define bFM4_CANFD_TXBCF_CF5                   *((volatile unsigned char*)(0x42E01B94UL))
#define bFM4_CANFD_TXBCF_CF6                   *((volatile unsigned char*)(0x42E01B98UL))
#define bFM4_CANFD_TXBCF_CF7                   *((volatile unsigned char*)(0x42E01B9CUL))
#define bFM4_CANFD_TXBCF_CF8                   *((volatile unsigned char*)(0x42E01BA0UL))
#define bFM4_CANFD_TXBCF_CF9                   *((volatile unsigned char*)(0x42E01BA4UL))
#define bFM4_CANFD_TXBCF_CF10                  *((volatile unsigned char*)(0x42E01BA8UL))
#define bFM4_CANFD_TXBCF_CF11                  *((volatile unsigned char*)(0x42E01BACUL))
#define bFM4_CANFD_TXBCF_CF12                  *((volatile unsigned char*)(0x42E01BB0UL))
#define bFM4_CANFD_TXBCF_CF13                  *((volatile unsigned char*)(0x42E01BB4UL))
#define bFM4_CANFD_TXBCF_CF14                  *((volatile unsigned char*)(0x42E01BB8UL))
#define bFM4_CANFD_TXBCF_CF15                  *((volatile unsigned char*)(0x42E01BBCUL))
#define bFM4_CANFD_TXBCF_CF16                  *((volatile unsigned char*)(0x42E01BC0UL))
#define bFM4_CANFD_TXBCF_CF17                  *((volatile unsigned char*)(0x42E01BC4UL))
#define bFM4_CANFD_TXBCF_CF18                  *((volatile unsigned char*)(0x42E01BC8UL))
#define bFM4_CANFD_TXBCF_CF19                  *((volatile unsigned char*)(0x42E01BCCUL))
#define bFM4_CANFD_TXBCF_CF20                  *((volatile unsigned char*)(0x42E01BD0UL))
#define bFM4_CANFD_TXBCF_CF21                  *((volatile unsigned char*)(0x42E01BD4UL))
#define bFM4_CANFD_TXBCF_CF22                  *((volatile unsigned char*)(0x42E01BD8UL))
#define bFM4_CANFD_TXBCF_CF23                  *((volatile unsigned char*)(0x42E01BDCUL))
#define bFM4_CANFD_TXBCF_CF24                  *((volatile unsigned char*)(0x42E01BE0UL))
#define bFM4_CANFD_TXBCF_CF25                  *((volatile unsigned char*)(0x42E01BE4UL))
#define bFM4_CANFD_TXBCF_CF26                  *((volatile unsigned char*)(0x42E01BE8UL))
#define bFM4_CANFD_TXBCF_CF27                  *((volatile unsigned char*)(0x42E01BECUL))
#define bFM4_CANFD_TXBCF_CF28                  *((volatile unsigned char*)(0x42E01BF0UL))
#define bFM4_CANFD_TXBCF_CF29                  *((volatile unsigned char*)(0x42E01BF4UL))
#define bFM4_CANFD_TXBCF_CF30                  *((volatile unsigned char*)(0x42E01BF8UL))
#define bFM4_CANFD_TXBCF_CF31                  *((volatile unsigned char*)(0x42E01BFCUL))
#define bFM4_CANFD_TXBTIE_TIE0                 *((volatile unsigned char*)(0x42E01C00UL))
#define bFM4_CANFD_TXBTIE_TIE1                 *((volatile unsigned char*)(0x42E01C04UL))
#define bFM4_CANFD_TXBTIE_TIE2                 *((volatile unsigned char*)(0x42E01C08UL))
#define bFM4_CANFD_TXBTIE_TIE3                 *((volatile unsigned char*)(0x42E01C0CUL))
#define bFM4_CANFD_TXBTIE_TIE4                 *((volatile unsigned char*)(0x42E01C10UL))
#define bFM4_CANFD_TXBTIE_TIE5                 *((volatile unsigned char*)(0x42E01C14UL))
#define bFM4_CANFD_TXBTIE_TIE6                 *((volatile unsigned char*)(0x42E01C18UL))
#define bFM4_CANFD_TXBTIE_TIE7                 *((volatile unsigned char*)(0x42E01C1CUL))
#define bFM4_CANFD_TXBTIE_TIE8                 *((volatile unsigned char*)(0x42E01C20UL))
#define bFM4_CANFD_TXBTIE_TIE9                 *((volatile unsigned char*)(0x42E01C24UL))
#define bFM4_CANFD_TXBTIE_TIE10                *((volatile unsigned char*)(0x42E01C28UL))
#define bFM4_CANFD_TXBTIE_TIE11                *((volatile unsigned char*)(0x42E01C2CUL))
#define bFM4_CANFD_TXBTIE_TIE12                *((volatile unsigned char*)(0x42E01C30UL))
#define bFM4_CANFD_TXBTIE_TIE13                *((volatile unsigned char*)(0x42E01C34UL))
#define bFM4_CANFD_TXBTIE_TIE14                *((volatile unsigned char*)(0x42E01C38UL))
#define bFM4_CANFD_TXBTIE_TIE15                *((volatile unsigned char*)(0x42E01C3CUL))
#define bFM4_CANFD_TXBTIE_TIE16                *((volatile unsigned char*)(0x42E01C40UL))
#define bFM4_CANFD_TXBTIE_TIE17                *((volatile unsigned char*)(0x42E01C44UL))
#define bFM4_CANFD_TXBTIE_TIE18                *((volatile unsigned char*)(0x42E01C48UL))
#define bFM4_CANFD_TXBTIE_TIE19                *((volatile unsigned char*)(0x42E01C4CUL))
#define bFM4_CANFD_TXBTIE_TIE20                *((volatile unsigned char*)(0x42E01C50UL))
#define bFM4_CANFD_TXBTIE_TIE21                *((volatile unsigned char*)(0x42E01C54UL))
#define bFM4_CANFD_TXBTIE_TIE22                *((volatile unsigned char*)(0x42E01C58UL))
#define bFM4_CANFD_TXBTIE_TIE23                *((volatile unsigned char*)(0x42E01C5CUL))
#define bFM4_CANFD_TXBTIE_TIE24                *((volatile unsigned char*)(0x42E01C60UL))
#define bFM4_CANFD_TXBTIE_TIE25                *((volatile unsigned char*)(0x42E01C64UL))
#define bFM4_CANFD_TXBTIE_TIE26                *((volatile unsigned char*)(0x42E01C68UL))
#define bFM4_CANFD_TXBTIE_TIE27                *((volatile unsigned char*)(0x42E01C6CUL))
#define bFM4_CANFD_TXBTIE_TIE28                *((volatile unsigned char*)(0x42E01C70UL))
#define bFM4_CANFD_TXBTIE_TIE29                *((volatile unsigned char*)(0x42E01C74UL))
#define bFM4_CANFD_TXBTIE_TIE30                *((volatile unsigned char*)(0x42E01C78UL))
#define bFM4_CANFD_TXBTIE_TIE31                *((volatile unsigned char*)(0x42E01C7CUL))
#define bFM4_CANFD_TXBCIE_CFIE0                *((volatile unsigned char*)(0x42E01C80UL))
#define bFM4_CANFD_TXBCIE_CFIE1                *((volatile unsigned char*)(0x42E01C84UL))
#define bFM4_CANFD_TXBCIE_CFIE2                *((volatile unsigned char*)(0x42E01C88UL))
#define bFM4_CANFD_TXBCIE_CFIE3                *((volatile unsigned char*)(0x42E01C8CUL))
#define bFM4_CANFD_TXBCIE_CFIE4                *((volatile unsigned char*)(0x42E01C90UL))
#define bFM4_CANFD_TXBCIE_CFIE5                *((volatile unsigned char*)(0x42E01C94UL))
#define bFM4_CANFD_TXBCIE_CFIE6                *((volatile unsigned char*)(0x42E01C98UL))
#define bFM4_CANFD_TXBCIE_CFIE7                *((volatile unsigned char*)(0x42E01C9CUL))
#define bFM4_CANFD_TXBCIE_CFIE8                *((volatile unsigned char*)(0x42E01CA0UL))
#define bFM4_CANFD_TXBCIE_CFIE9                *((volatile unsigned char*)(0x42E01CA4UL))
#define bFM4_CANFD_TXBCIE_CFIE10               *((volatile unsigned char*)(0x42E01CA8UL))
#define bFM4_CANFD_TXBCIE_CFIE11               *((volatile unsigned char*)(0x42E01CACUL))
#define bFM4_CANFD_TXBCIE_CFIE12               *((volatile unsigned char*)(0x42E01CB0UL))
#define bFM4_CANFD_TXBCIE_CFIE13               *((volatile unsigned char*)(0x42E01CB4UL))
#define bFM4_CANFD_TXBCIE_CFIE14               *((volatile unsigned char*)(0x42E01CB8UL))
#define bFM4_CANFD_TXBCIE_CFIE15               *((volatile unsigned char*)(0x42E01CBCUL))
#define bFM4_CANFD_TXBCIE_CFIE16               *((volatile unsigned char*)(0x42E01CC0UL))
#define bFM4_CANFD_TXBCIE_CFIE17               *((volatile unsigned char*)(0x42E01CC4UL))
#define bFM4_CANFD_TXBCIE_CFIE18               *((volatile unsigned char*)(0x42E01CC8UL))
#define bFM4_CANFD_TXBCIE_CFIE19               *((volatile unsigned char*)(0x42E01CCCUL))
#define bFM4_CANFD_TXBCIE_CFIE20               *((volatile unsigned char*)(0x42E01CD0UL))
#define bFM4_CANFD_TXBCIE_CFIE21               *((volatile unsigned char*)(0x42E01CD4UL))
#define bFM4_CANFD_TXBCIE_CFIE22               *((volatile unsigned char*)(0x42E01CD8UL))
#define bFM4_CANFD_TXBCIE_CFIE23               *((volatile unsigned char*)(0x42E01CDCUL))
#define bFM4_CANFD_TXBCIE_CFIE24               *((volatile unsigned char*)(0x42E01CE0UL))
#define bFM4_CANFD_TXBCIE_CFIE25               *((volatile unsigned char*)(0x42E01CE4UL))
#define bFM4_CANFD_TXBCIE_CFIE26               *((volatile unsigned char*)(0x42E01CE8UL))
#define bFM4_CANFD_TXBCIE_CFIE27               *((volatile unsigned char*)(0x42E01CECUL))
#define bFM4_CANFD_TXBCIE_CFIE28               *((volatile unsigned char*)(0x42E01CF0UL))
#define bFM4_CANFD_TXBCIE_CFIE29               *((volatile unsigned char*)(0x42E01CF4UL))
#define bFM4_CANFD_TXBCIE_CFIE30               *((volatile unsigned char*)(0x42E01CF8UL))
#define bFM4_CANFD_TXBCIE_CFIE31               *((volatile unsigned char*)(0x42E01CFCUL))
#define bFM4_CANFD_TXEFC_EFSA0                 *((volatile unsigned char*)(0x42E01E08UL))
#define bFM4_CANFD_TXEFC_EFSA1                 *((volatile unsigned char*)(0x42E01E0CUL))
#define bFM4_CANFD_TXEFC_EFSA2                 *((volatile unsigned char*)(0x42E01E10UL))
#define bFM4_CANFD_TXEFC_EFSA3                 *((volatile unsigned char*)(0x42E01E14UL))
#define bFM4_CANFD_TXEFC_EFSA4                 *((volatile unsigned char*)(0x42E01E18UL))
#define bFM4_CANFD_TXEFC_EFSA5                 *((volatile unsigned char*)(0x42E01E1CUL))
#define bFM4_CANFD_TXEFC_EFSA6                 *((volatile unsigned char*)(0x42E01E20UL))
#define bFM4_CANFD_TXEFC_EFSA7                 *((volatile unsigned char*)(0x42E01E24UL))
#define bFM4_CANFD_TXEFC_EFSA8                 *((volatile unsigned char*)(0x42E01E28UL))
#define bFM4_CANFD_TXEFC_EFSA9                 *((volatile unsigned char*)(0x42E01E2CUL))
#define bFM4_CANFD_TXEFC_EFSA10                *((volatile unsigned char*)(0x42E01E30UL))
#define bFM4_CANFD_TXEFC_EFSA11                *((volatile unsigned char*)(0x42E01E34UL))
#define bFM4_CANFD_TXEFC_EFSA12                *((volatile unsigned char*)(0x42E01E38UL))
#define bFM4_CANFD_TXEFC_EFSA13                *((volatile unsigned char*)(0x42E01E3CUL))
#define bFM4_CANFD_TXEFC_EFS0                  *((volatile unsigned char*)(0x42E01E40UL))
#define bFM4_CANFD_TXEFC_EFS1                  *((volatile unsigned char*)(0x42E01E44UL))
#define bFM4_CANFD_TXEFC_EFS2                  *((volatile unsigned char*)(0x42E01E48UL))
#define bFM4_CANFD_TXEFC_EFS3                  *((volatile unsigned char*)(0x42E01E4CUL))
#define bFM4_CANFD_TXEFC_EFS4                  *((volatile unsigned char*)(0x42E01E50UL))
#define bFM4_CANFD_TXEFC_EFS5                  *((volatile unsigned char*)(0x42E01E54UL))
#define bFM4_CANFD_TXEFC_EFWM0                 *((volatile unsigned char*)(0x42E01E60UL))
#define bFM4_CANFD_TXEFC_EFWM1                 *((volatile unsigned char*)(0x42E01E64UL))
#define bFM4_CANFD_TXEFC_EFWM2                 *((volatile unsigned char*)(0x42E01E68UL))
#define bFM4_CANFD_TXEFC_EFWM3                 *((volatile unsigned char*)(0x42E01E6CUL))
#define bFM4_CANFD_TXEFC_EFWM4                 *((volatile unsigned char*)(0x42E01E70UL))
#define bFM4_CANFD_TXEFC_EFWM5                 *((volatile unsigned char*)(0x42E01E74UL))
#define bFM4_CANFD_TXFS_EFFL0                  *((volatile unsigned char*)(0x42E01E80UL))
#define bFM4_CANFD_TXFS_EFFL1                  *((volatile unsigned char*)(0x42E01E84UL))
#define bFM4_CANFD_TXFS_EFFL2                  *((volatile unsigned char*)(0x42E01E88UL))
#define bFM4_CANFD_TXFS_EFFL3                  *((volatile unsigned char*)(0x42E01E8CUL))
#define bFM4_CANFD_TXFS_EFFL4                  *((volatile unsigned char*)(0x42E01E90UL))
#define bFM4_CANFD_TXFS_EFFL5                  *((volatile unsigned char*)(0x42E01E94UL))
#define bFM4_CANFD_TXFS_EFGI0                  *((volatile unsigned char*)(0x42E01EA0UL))
#define bFM4_CANFD_TXFS_EFGI1                  *((volatile unsigned char*)(0x42E01EA4UL))
#define bFM4_CANFD_TXFS_EFGI2                  *((volatile unsigned char*)(0x42E01EA8UL))
#define bFM4_CANFD_TXFS_EFGI3                  *((volatile unsigned char*)(0x42E01EACUL))
#define bFM4_CANFD_TXFS_EFGI4                  *((volatile unsigned char*)(0x42E01EB0UL))
#define bFM4_CANFD_TXFS_EFPI0                  *((volatile unsigned char*)(0x42E01EC0UL))
#define bFM4_CANFD_TXFS_EFPI1                  *((volatile unsigned char*)(0x42E01EC4UL))
#define bFM4_CANFD_TXFS_EFPI2                  *((volatile unsigned char*)(0x42E01EC8UL))
#define bFM4_CANFD_TXFS_EFPI3                  *((volatile unsigned char*)(0x42E01ECCUL))
#define bFM4_CANFD_TXFS_EFPI4                  *((volatile unsigned char*)(0x42E01ED0UL))
#define bFM4_CANFD_TXFS_EFF                    *((volatile unsigned char*)(0x42E01EE0UL))
#define bFM4_CANFD_TXFS_TEFL                   *((volatile unsigned char*)(0x42E01EE4UL))
#define bFM4_CANFD_TXFA_EFAI0                  *((volatile unsigned char*)(0x42E01F00UL))
#define bFM4_CANFD_TXFA_EFAI1                  *((volatile unsigned char*)(0x42E01F04UL))
#define bFM4_CANFD_TXFA_EFAI2                  *((volatile unsigned char*)(0x42E01F08UL))
#define bFM4_CANFD_TXFA_EFAI3                  *((volatile unsigned char*)(0x42E01F0CUL))
#define bFM4_CANFD_TXFA_EFAI4                  *((volatile unsigned char*)(0x42E01F10UL))
#define bFM4_CANFD_FDECR_SEIE                  *((volatile unsigned char*)(0x42E04000UL))
#define bFM4_CANFD_FDECR_DEIE                  *((volatile unsigned char*)(0x42E04004UL))
#define bFM4_CANFD_FDECR_CEREN                 *((volatile unsigned char*)(0x42E04008UL))
#define bFM4_CANFD_FDECR_CEIV                  *((volatile unsigned char*)(0x42E0400CUL))
#define bFM4_CANFD_FDESR_SEI                   *((volatile unsigned char*)(0x42E04020UL))
#define bFM4_CANFD_FDESR_DEI                   *((volatile unsigned char*)(0x42E04024UL))
#define bFM4_CANFD_FDSEAR_SRA0                 *((volatile unsigned char*)(0x42E04040UL))
#define bFM4_CANFD_FDSEAR_SRA1                 *((volatile unsigned char*)(0x42E04044UL))
#define bFM4_CANFD_FDSEAR_SRA2                 *((volatile unsigned char*)(0x42E04048UL))
#define bFM4_CANFD_FDSEAR_SRA3                 *((volatile unsigned char*)(0x42E0404CUL))
#define bFM4_CANFD_FDSEAR_SRA4                 *((volatile unsigned char*)(0x42E04050UL))
#define bFM4_CANFD_FDSEAR_SRA5                 *((volatile unsigned char*)(0x42E04054UL))
#define bFM4_CANFD_FDSEAR_SRA6                 *((volatile unsigned char*)(0x42E04058UL))
#define bFM4_CANFD_FDSEAR_SRA7                 *((volatile unsigned char*)(0x42E0405CUL))
#define bFM4_CANFD_FDSEAR_SRA8                 *((volatile unsigned char*)(0x42E04060UL))
#define bFM4_CANFD_FDSEAR_SRA9                 *((volatile unsigned char*)(0x42E04064UL))
#define bFM4_CANFD_FDSEAR_SRA10                *((volatile unsigned char*)(0x42E04068UL))
#define bFM4_CANFD_FDSEAR_SRA11                *((volatile unsigned char*)(0x42E0406CUL))
#define bFM4_CANFD_FDSEAR_SRA12                *((volatile unsigned char*)(0x42E04070UL))
#define bFM4_CANFD_FDSEAR_SRA13                *((volatile unsigned char*)(0x42E04074UL))
#define bFM4_CANFD_FDSEAR_SRA14                *((volatile unsigned char*)(0x42E04078UL))
#define bFM4_CANFD_FDSEAR_SRA15                *((volatile unsigned char*)(0x42E0407CUL))
#define bFM4_CANFD_FDESCR_SEIC                 *((volatile unsigned char*)(0x42E040A0UL))
#define bFM4_CANFD_FDESCR_DEIC                 *((volatile unsigned char*)(0x42E040A4UL))
#define bFM4_CANFD_FDDEAR_DRA0                 *((volatile unsigned char*)(0x42E040C0UL))
#define bFM4_CANFD_FDDEAR_DRA1                 *((volatile unsigned char*)(0x42E040C4UL))
#define bFM4_CANFD_FDDEAR_DRA2                 *((volatile unsigned char*)(0x42E040C8UL))
#define bFM4_CANFD_FDDEAR_DRA3                 *((volatile unsigned char*)(0x42E040CCUL))
#define bFM4_CANFD_FDDEAR_DRA4                 *((volatile unsigned char*)(0x42E040D0UL))
#define bFM4_CANFD_FDDEAR_DRA5                 *((volatile unsigned char*)(0x42E040D4UL))
#define bFM4_CANFD_FDDEAR_DRA6                 *((volatile unsigned char*)(0x42E040D8UL))
#define bFM4_CANFD_FDDEAR_DRA7                 *((volatile unsigned char*)(0x42E040DCUL))
#define bFM4_CANFD_FDDEAR_DRA8                 *((volatile unsigned char*)(0x42E040E0UL))
#define bFM4_CANFD_FDDEAR_DRA9                 *((volatile unsigned char*)(0x42E040E4UL))
#define bFM4_CANFD_FDDEAR_DRA10                *((volatile unsigned char*)(0x42E040E8UL))
#define bFM4_CANFD_FDDEAR_DRA11                *((volatile unsigned char*)(0x42E040ECUL))
#define bFM4_CANFD_FDDEAR_DRA12                *((volatile unsigned char*)(0x42E040F0UL))
#define bFM4_CANFD_FDDEAR_DRA13                *((volatile unsigned char*)(0x42E040F4UL))
#define bFM4_CANFD_FDDEAR_DRA14                *((volatile unsigned char*)(0x42E040F8UL))
#define bFM4_CANFD_FDDEAR_DRA15                *((volatile unsigned char*)(0x42E040FCUL))
#define bFM4_CANFD_TSCNTR_CCLR                 *((volatile unsigned char*)(0x42E04200UL))
#define bFM4_CANFD_TSMDR_CNTEN                 *((volatile unsigned char*)(0x42E04240UL))
#define bFM4_CANFD_TSDIVR_CDIV0                *((volatile unsigned char*)(0x42E04280UL))
#define bFM4_CANFD_TSDIVR_CDIV1                *((volatile unsigned char*)(0x42E04284UL))
#define bFM4_CANFD_TSDIVR_CDIV2                *((volatile unsigned char*)(0x42E04288UL))
#define bFM4_CANFD_TSDIVR_CDIV3                *((volatile unsigned char*)(0x42E0428CUL))
#define bFM4_CANFD_TSDIVR_CDIV4                *((volatile unsigned char*)(0x42E04290UL))
#define bFM4_CANFD_TSDIVR_CDIV5                *((volatile unsigned char*)(0x42E04294UL))
#define bFM4_CANFD_TSDIVR_CDIV6                *((volatile unsigned char*)(0x42E04298UL))
#define bFM4_CANFD_TSDIVR_CDIV7                *((volatile unsigned char*)(0x42E0429CUL))
#define bFM4_CANFD_TSDIVR_CDIV8                *((volatile unsigned char*)(0x42E042A0UL))
#define bFM4_CANFD_TSDIVR_CDIV9                *((volatile unsigned char*)(0x42E042A4UL))
#define bFM4_CANFD_TSDIVR_CDIV10               *((volatile unsigned char*)(0x42E042A8UL))
#define bFM4_CANFD_TSDIVR_CDIV11               *((volatile unsigned char*)(0x42E042ACUL))
#define bFM4_CANFD_TSDIVR_CDIV12               *((volatile unsigned char*)(0x42E042B0UL))
#define bFM4_CANFD_TSDIVR_CDIV13               *((volatile unsigned char*)(0x42E042B4UL))
#define bFM4_CANFD_TSDIVR_CDIV14               *((volatile unsigned char*)(0x42E042B8UL))
#define bFM4_CANFD_TSDIVR_CDIV15               *((volatile unsigned char*)(0x42E042BCUL))
#define bFM4_CANFD_TSCDTR_CNT0                 *((volatile unsigned char*)(0x42E04300UL))
#define bFM4_CANFD_TSCDTR_CNT1                 *((volatile unsigned char*)(0x42E04304UL))
#define bFM4_CANFD_TSCDTR_CNT2                 *((volatile unsigned char*)(0x42E04308UL))
#define bFM4_CANFD_TSCDTR_CNT3                 *((volatile unsigned char*)(0x42E0430CUL))
#define bFM4_CANFD_TSCDTR_CNT4                 *((volatile unsigned char*)(0x42E04310UL))
#define bFM4_CANFD_TSCDTR_CNT5                 *((volatile unsigned char*)(0x42E04314UL))
#define bFM4_CANFD_TSCDTR_CNT6                 *((volatile unsigned char*)(0x42E04318UL))
#define bFM4_CANFD_TSCDTR_CNT7                 *((volatile unsigned char*)(0x42E0431CUL))
#define bFM4_CANFD_TSCDTR_CNT8                 *((volatile unsigned char*)(0x42E04320UL))
#define bFM4_CANFD_TSCDTR_CNT9                 *((volatile unsigned char*)(0x42E04324UL))
#define bFM4_CANFD_TSCDTR_CNT10                *((volatile unsigned char*)(0x42E04328UL))
#define bFM4_CANFD_TSCDTR_CNT11                *((volatile unsigned char*)(0x42E0432CUL))
#define bFM4_CANFD_TSCDTR_CNT12                *((volatile unsigned char*)(0x42E04330UL))
#define bFM4_CANFD_TSCDTR_CNT13                *((volatile unsigned char*)(0x42E04334UL))
#define bFM4_CANFD_TSCDTR_CNT14                *((volatile unsigned char*)(0x42E04338UL))
#define bFM4_CANFD_TSCDTR_CNT15                *((volatile unsigned char*)(0x42E0433CUL))
#define bFM4_CANFD_TSCPCLR_CMP0                *((volatile unsigned char*)(0x42E04340UL))
#define bFM4_CANFD_TSCPCLR_CMP1                *((volatile unsigned char*)(0x42E04344UL))
#define bFM4_CANFD_TSCPCLR_CMP2                *((volatile unsigned char*)(0x42E04348UL))
#define bFM4_CANFD_TSCPCLR_CMP3                *((volatile unsigned char*)(0x42E0434CUL))
#define bFM4_CANFD_TSCPCLR_CMP4                *((volatile unsigned char*)(0x42E04350UL))
#define bFM4_CANFD_TSCPCLR_CMP5                *((volatile unsigned char*)(0x42E04354UL))
#define bFM4_CANFD_TSCPCLR_CMP6                *((volatile unsigned char*)(0x42E04358UL))
#define bFM4_CANFD_TSCPCLR_CMP7                *((volatile unsigned char*)(0x42E0435CUL))
#define bFM4_CANFD_TSCPCLR_CMP8                *((volatile unsigned char*)(0x42E04360UL))
#define bFM4_CANFD_TSCPCLR_CMP9                *((volatile unsigned char*)(0x42E04364UL))
#define bFM4_CANFD_TSCPCLR_CMP10               *((volatile unsigned char*)(0x42E04368UL))
#define bFM4_CANFD_TSCPCLR_CMP11               *((volatile unsigned char*)(0x42E0436CUL))
#define bFM4_CANFD_TSCPCLR_CMP12               *((volatile unsigned char*)(0x42E04370UL))
#define bFM4_CANFD_TSCPCLR_CMP13               *((volatile unsigned char*)(0x42E04374UL))
#define bFM4_CANFD_TSCPCLR_CMP14               *((volatile unsigned char*)(0x42E04378UL))
#define bFM4_CANFD_TSCPCLR_CMP15               *((volatile unsigned char*)(0x42E0437CUL))

/* Programable-CRC registers */
#define bFM4_PCRC_PRGCRC_CFG_CIRQCLR           *((volatile unsigned char*)(0x43000180UL))
#define bFM4_PCRC_PRGCRC_CFG_FO0               *((volatile unsigned char*)(0x430001A0UL))
#define bFM4_PCRC_PRGCRC_CFG_FO1               *((volatile unsigned char*)(0x430001A4UL))
#define bFM4_PCRC_PRGCRC_CFG_FI0               *((volatile unsigned char*)(0x430001A8UL))
#define bFM4_PCRC_PRGCRC_CFG_FI1               *((volatile unsigned char*)(0x430001ACUL))
#define bFM4_PCRC_PRGCRC_CFG_TEST0             *((volatile unsigned char*)(0x430001C0UL))
#define bFM4_PCRC_PRGCRC_CFG_TEST1             *((volatile unsigned char*)(0x430001C4UL))
#define bFM4_PCRC_PRGCRC_CFG_TEST2             *((volatile unsigned char*)(0x430001C8UL))
#define bFM4_PCRC_PRGCRC_CFG_TEST3             *((volatile unsigned char*)(0x430001CCUL))
#define bFM4_PCRC_PRGCRC_CFG_TEST4             *((volatile unsigned char*)(0x430001D0UL))
#define bFM4_PCRC_PRGCRC_CFG_TEST5             *((volatile unsigned char*)(0x430001D4UL))
#define bFM4_PCRC_PRGCRC_CFG_SZ0               *((volatile unsigned char*)(0x430001D8UL))
#define bFM4_PCRC_PRGCRC_CFG_SZ1               *((volatile unsigned char*)(0x430001DCUL))
#define bFM4_PCRC_PRGCRC_CFG_CIRQ              *((volatile unsigned char*)(0x430001E0UL))
#define bFM4_PCRC_PRGCRC_CFG_CIEN              *((volatile unsigned char*)(0x430001E4UL))
#define bFM4_PCRC_PRGCRC_CFG_CDEN              *((volatile unsigned char*)(0x430001E8UL))
#define bFM4_PCRC_PRGCRC_CFG_LOCK              *((volatile unsigned char*)(0x430001F0UL))

